[{"leaf":false,"text":"Third Grade Social Studies: Community and Culture","children":[{"leaf":false,"text":"Third Grade Standard I: Students will understand how geography influences community location and development.","children":[{"leaf":false,"text":"Benchmark: The geography of a community influences the cultural development of the humans who inhabit the community. There are relationships between climate, natural resources, and other geographic characteristics and a community's cultural development. The unique characteristics of an area influence where and how communities develop, their relative wealth and power, and how they adapt to changes.","children":[{"leaf":false,"text":"Objective 1: Determine the relationships between human settlement and geography.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC4F","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"a. Identify the geographic features common to areas where human settlements exist."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC50","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"b. Use map features to make logical inferences and describe relationships between human settlement and physical geography (e.g. population density in relation to latitude, cities' proximity to water, utilization of natural resources)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC51","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"c. Compare the shapes and purposes of natural and human-made boundaries of cities, counties and states."}]},{"leaf":false,"text":"Objective 2: Describe how various communities have adapted to existing environments and how other communities have modified the environment.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC52","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"a. Describe the major world ecosystems (i.e. desert, plain, tropic, tundra, grassland, mountain, forest, wetland)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC53","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"b. Identify important natural resources of world ecosystems."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC54","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"c. Describe how communities have modified the environment to accommodate their needs (e.g. logging, storing water, building transportation systems)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC55","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"d. Investigate ways different communities have adapted into an ecosystem."}]},{"leaf":false,"text":"Objective 3: Analyze ways cultures use, maintain, and preserve the physical environment.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC56","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"a. Identify ways people use the physical environment (e.g. agriculture, recreation, energy, industry)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC57","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"b. Compare changes in the availability and use of natural resources over time."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC58","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"c. Describe ways to conserve and protect natural resources (e.g. reduce, reuse, recycle)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC59","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"d. Compare perspectives of various communities toward the natural environment."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC5A","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"e. Make inferences about the positive and negative impacts of human-caused change to the physical environment."}]}]}]},{"leaf":false,"text":"Third Grade Standard II: Students will understand cultural factors that shape a community.","children":[{"leaf":false,"text":"Benchmark: All people exist within cultures, or the way of life of a group of people. All human communities have cultural attributes. These attributes change over time in response to changes in the world around them. Indigenous cultures in North and South America demonstrate these attributes, and teachers are encouraged to select examples from these rich cultural traditions.","children":[{"leaf":false,"text":"Objective 1: Evaluate key factors that determine how a community develops.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC5B","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"a. Identify the elements of culture (e.g. language, religion, customs, artistic expression, systems of exchange)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC5C","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"b. Describe how stories, folktales, music, and artistic creations serve as expressions of culture."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC5D","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"c. Compare elements of the local community with communities from different parts of the world (e.g. industry, economic specialization )"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC5E","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"d. Identify and explain the interrelationship of the environment (e.g. location, natural resources, climate) and community development (e.g. food, shelter, clothing, industries, markets, recreation, artistic creations)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC5F","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"e. Examine changes in communities that can or have occurred when two or more cultures interact."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC60","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"f. Explain changes within communities caused by human inventions (e.g. steel plow, internal combustion engine, television, computer)."}]},{"leaf":false,"text":"Objective 2: Explain how selected indigenous cultures of the Americas have changed over time.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC61","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"a. Describe and compare early indigenous people of the Americas (e.g. Eastern Woodlands, Plains, Great Basin, Southwestern, Arctic, Incan, Aztec, Mayan)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC62","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"b. Analyze how these cultures changed with the arrival of people from Europe, and how the cultures of the Europeans changed."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC63","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"c. Identify how indigenous people maintain cultural traditions today."}]}]}]},{"leaf":false,"text":"Third Grade Standard III: Students will understand the principles of civic responsibility in classroom, community, and country.","children":[{"leaf":false,"text":"Benchmark: There are purposes and roles of representative government. People are elected in this nation to represent the views of other people. There are rights people have within this government. There are multiple functions and services of government. Community members have rights, and with those rights come responsibilities. For a community to function effectively, community members must understand and accept those responsibilities. Recognizing and considering the viewpoints of others is essential in a community.","children":[{"leaf":false,"text":"Objective 1: Describe the rights and responsibilities inherent in being a contributing member of a community.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC64","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"a. Identify how these rights and responsibilities are reflected in the patriotic symbols and traditions of the United States (i.e. Pledge of Allegiance, flag etiquette)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC65","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"b. List the responsibilities community members have to one another."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC66","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"c. Identify why these responsibilities are important for a functioning community (e.g. voting, jury duty, taxpaying, obedience to laws)."}]},{"leaf":false,"text":"Objective 2: Identify ways community needs are met by government.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC67","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"a. Differentiate between personal and community needs."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC68","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"b. Identify roles of representative government (e.g. make laws, maintain order, levy taxes, provide public services)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC69","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"c. Research community needs and the role government serves in meeting those needs."}]},{"leaf":false,"text":"Objective 3: Apply principles of civic responsibility.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC6A","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"a. Engage in meaningful dialogue about the community and current events within the classroom, school, and local community."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC6B","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"b. Identify and consider the diverse viewpoints of the people who comprise a community."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC6C","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"c. Demonstrate respect for the opinions, backgrounds, and cultures of others."}]}]}]}]},{"leaf":false,"text":"Fourth Grade Social Studies: Utah Studies","children":[{"leaf":false,"text":"Standard I: Students will understand the relationship between the physical geography in Utah and human life.","children":[{"leaf":false,"text":"Benchmark: Utah's physical geography has a direct impact on the cultures of the various peoples who have inhabited it throughout time. By learning about the physical geography of Utah and how it has changed over time, students will be able to understand the interrelationships between the physical geography of Utah and human cultural development.","children":[{"leaf":false,"text":"Objective 1: Classify major physical geographic attributes of Utah.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC6D","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"a. Identify Utah's latitude, longitude, hemisphere, climate, natural resources, landforms, and regions using a variety of geographic tools."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC6E","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"b. Examine the forces at work in creating the physical geography of Utah (e.g. erosion, seismic activity, climate change)."}]},{"leaf":false,"text":"Objective 2: Analyze how physical geography affects human life in Utah.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC6F","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"a. Identify population concentrations in the state and infer causal relationships between population and physical geography."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC70","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"b. Classify the distribution and use of natural resources."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC71","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"c. Compare the development of industry and business in Utah as it relates to its physical geography (e.g. mining, oil, agriculture, tourism)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC72","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"d. Make inferences about the relationships between the physical geography of Utah and the state's communication and transportation systems (e.g. trails, roads, telegraph, rail lines)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC73","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"e. Examine the interactions between physical geography and public health and safety (e.g. inversions, earthquakes, flooding, fire)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC74","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"f. Explain how archaeology informs about the past (e.g. artifacts, ruins, excavations)."}]},{"leaf":false,"text":"Objective 3: Analyze how human actions modify the physical environment.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC75","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"a. Describe how and why humans have changed the physical environment of Utah to meet their needs (e.g. reservoirs, irrigation, climate, transportation systems and cities)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC76","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"b. Explain viewpoints regarding environmental issues (e.g. species protection, land use, pollution controls, mass transit, water rights, trust lands)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC77","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"c. Outline the development of recreation in Utah since 1900 (e.g. sports, tourism, state, and national parks)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC78","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"d. Make data-supported predictions about the future needs of Utahns and the natural resources that will be necessary to meet those needs."}]}]}]},{"leaf":false,"text":"Fourth Grade Standard II: Students will understand how Utah's history has been shaped by many diverse people, events, and ideas.","children":[{"leaf":false,"text":"Benchmark: The history of Utah has been shaped by many diverse people, events, challenges, and ideas. People came to the land now known as Utah for many reasons, and from many different places around the world. The story of Utah includes American Indians, the Dominguez- Escalante exploration, explorers, trappers, Latinos, Mormon pioneers, Polynesians, Chinese, Japanese, Greeks, African-Americans, Middle Easterners, and many other groups seeking new homes, work and refuge. As each culture has come to Utah, Utah has changed. These changes have had and will continue to have significant impacts on all the people of Utah.","children":[{"leaf":false,"text":"Objective 1: Describe the historical and current impact of various cultural groups on Utah.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC79","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"a. Chart the routes that diverse cultural groups took from their places of origin to Utah, using maps and other resources."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC7A","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"b. Explore points of view about life in Utah from a variety of cultural groups using primary source documents."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC7B","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"c. Explore cultural influences from various groups found in Utah today (e.g. food, music, religion, dress, festivals)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC7C","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"d. Identify and describe leaders from various cultures who exemplify outstanding character and life skills."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC7D","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"e. Explain the importance of preserving cultural prehistory and history, including archaeological sites and other historic sites and artifacts."}]},{"leaf":false,"text":"Objective 2: Describe ways that Utah has changed over time.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC7E","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"a. Identify key events and trends in Utah history and their significance (e.g. American Indian settlement, European exploration, Mormon settlement, westward expansion, American Indian relocation, statehood, development of industry, World War I and II)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC7F","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"b. Compare the experiences faced by today's immigrants with those faced by immigrants in Utah's history."}]},{"leaf":false,"text":"Objective 3: Investigate the development of the economy in Utah.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC80","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"a. Explain the relationship between supply and demand."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC81","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"b. Describe the role of producers and consumers."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC82","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"c. Identify examples of producers and consumers in the local community."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC83","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"d. Research the development of Utah's economy over time."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC84","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"e. Identify the factors which bring about economic changes (e.g. natural resource development, new technologies, new market development, globalization, global conflicts, education)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC85","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"f. Examine how economic development affects communities (e.g. dams, sports, tourism, power plants, mining, etc.)."}]}]}]},{"leaf":false,"text":"Fourth Grade Standard III: Students will understand the roles of civic life, politics, and government in the lives of Utah citizens.","children":[{"leaf":false,"text":"Benchmark: Representative government has developed in Utah. People who live in Utah have rights and responsibilities associated with representative government. People have created systems of power and authority within this government.","children":[{"leaf":false,"text":"Objective 1: Describe the responsibilities and rights of individuals in a representative government as well as in the school and community.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC86","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"a. Identify rights of a citizen (e.g. voting, peaceful assembly, freedom of religion)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC87","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"b. Identify responsibilities of a citizen (e.g. jury duty, obeying the law, paying taxes)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC88","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"c. Determine how and why the rights and responsibilities of various groups have varied over time (e.g. Chinese railroad workers, Greek miners, women, children, Mormons, Japanese-Americans at Topaz, American Indians, African-Americans)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC89","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"d. Explain how the influence and power of individuals is affected when they organize into groups."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC8A","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"e. Describe and model ways that citizens can participate in civic responsibilities (e.g. current issue analysis, recycling, volunteering with civic organizations, letter writing)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC8B","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"f. Contribute to and practice classroom goals, rules and responsibilities."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC8C","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"g. Recognize and demonstrate respect for United States and Utah symbols (i.e. Pledge of Allegiance, flag etiquette)."}]},{"leaf":false,"text":"Objective 2: Analyze the different ways people have organized governments in Utah to meet community needs.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC8D","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"a. Identify the forms of government found in Utah in different eras (i.e. historic and current American Indian government, State of Deseret, Utah Territory, statehood-era, present)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC8E","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"b. Compare how these governments addressed community needs."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC8F","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"c. Compare the roles and responsibilities of state, county, and local officials."}]}]}]}]},{"leaf":false,"text":"Fifth Grade Social Studies: United States Studies","children":[{"leaf":false,"text":"Fifth Grade Standard I: Students will understand how the exploration and colonization of North America transformed human history.","children":[{"leaf":false,"text":"Benchmark: The era of the exploration and colonization of the Americas by Europeans marked the beginning of the recorded history of what is now the United States. This period also marked the beginning of global trade and cultural exchanges that would alter the lives of people around the world. This era would significantly affect the range of personal freedom among individuals and groups in the Americas. The growing conflicts between American Indian populations and European colonists, and the expansion of the African slave trade provide contrasts to the emerging development of self-rule.","children":[{"leaf":false,"text":"Objective 1: Describe and explain the growth and development of the early American colonies.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC90","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"a. Using maps -- including pre-1492 maps -- and other geographic tools, locate and analyze the routes used by the explorers."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC91","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"b. Explain how advances in technology lead to an increase in exploration (e.g. ship technology)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC92","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"c. Identify explorers who came to the Americas and the nations they represented."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC93","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"d. Determine reasons for the exploration of North America (e.g., religious, economic, political)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC94","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"e. Compare the geographic and cultural differences between the New England, Middle, and Southern colonies (e.g., religious, economic, political)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC95","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"f. Analyze contributions of American Indian people to the colonial settlements."}]},{"leaf":false,"text":"Objective 2: Assess the global impact of cultural and economic diffusion as a result of colonization.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC96","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"a. Describe the cultural and economic impacts that occurred as a result of trade between North America and other markets (e.g., arts, language, ideas, the beginning and expansion of the slave trade, new agricultural markets)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC97","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"b. Analyze and explain the population decline in American Indian populations (i.e. disease, warfare, displacement)."}]},{"leaf":false,"text":"Objective 3: Distinguish between the rights and responsibilities held by different groups of people during the colonial period.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC98","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"a. Compare the varying degrees of freedom held by different groups (e.g. American Indians, landowners, women, indentured servants, enslaved people)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC99","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"b. Explain how early leaders established the first colonial governments (e.g. Mayflower compact, charters)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC9A","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"c. Describe the basic principles and purposes of the Iroquois Confederacy."}]}]}]},{"leaf":false,"text":"Fifth Grade Standard II: Students will understand the chronology and significance of key events leading to self-government.","children":[{"leaf":false,"text":"Benchmark: The English colonies in North America began to organize and discuss creating an independent form of government separate from England's rule. After making their case in their Declaration of Independence, the colonies engaged in a Revolutionary war that culminated in their independence and the creation of a new nation, the United States of America.","children":[{"leaf":false,"text":"Objective 1: Describe how the movement toward revolution culminated in a Declaration of Independence.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC9B","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"a. Explain the role of events that led to declaring independence (e.g., French and Indian War, Stamp Act, Boston Tea Party)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC9C","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"b. Analyze arguments both for and against declaring independence using primary sources from Loyalist and patriot perspectives."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC9D","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"c. Explain the content and purpose for the Declaration of Independence."}]},{"leaf":false,"text":"Objective 2: Evaluate the Revolutionary War's impact on self-rule.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC9E","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"a. Plot a time line of the key events of the Revolutionary War."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113AC9F","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"b. Profile citizens who rose to greatness as leaders."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ACA0","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"c. Assess how the Revolutionary War changed the way people thought about their own rights."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ACA1","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"d. Explain how the winning of the war set in motion a need for a new government that would serve the needs of the new states."}]}]}]},{"leaf":false,"text":"Fifth Grade Standard III: Students will understand the rights and responsibilities guaranteed in the United States Constitution and Bill of Rights.","children":[{"leaf":false,"text":"Benchmark: The new United States needed a set of rules. A group of leading thinkers of the Revolutionary era met to create a new document to lay out the form of the new government. Drawing upon ideas both old and new, and finding ways to compromise to meet the needs and demands of multiple interests, they created this new government charter called the Constitution. The Constitution created a strong national government with separate branches within the government to insure there were checks on power and balances of responsibilities. The Constitution has been changed, or amended, numerous times since then, first with the addition of the Bill of Rights.","children":[{"leaf":false,"text":"Objective 1: Assess the underlying principles of the US Constitution.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ACA2","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"a. Recognize ideas from documents used to develop the Constitution (e.g. Magna Carta, Iroquois Confederacy, Articles of Confederation, Virginia Plan)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ACA3","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"b. Analyze goals outlined in the Preamble."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ACA4","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"c. Distinguish between the role of the Legislative, Executive, and Judicial branches of the government."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ACA5","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"d. Explain the process of passing a law."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ACA6","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"e. Describe the concept of checks and balances."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ACA7","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"f. Discover the basis for the patriotic and citizenship traditions we have today (i.e. Pledge of Allegiance, flag etiquette, voting)."}]},{"leaf":false,"text":"Objective 2: Assess how the US Constitution has been amended and interpreted over time, and the impact these amendments have had on the rights and responsibilities of citizens of the United States.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ACA8","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"a. Explain the significance of the Bill of Rights."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ACA9","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"b. Identify how the rights of selected groups have changed and how the Constitution reflects those changes (e.g. women, enslaved people)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ACAA","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"c. Analyze the impact of the Constitution on their lives today (e.g. freedom of religion, speech, press, assembly, petition)."}]}]}]},{"leaf":false,"text":"Fifth Grade Standard IV: Students will understand that the 19th century was a time of incredible change for the United States, including geographic expansion, constitutional crisis, and economic growth.","children":[{"leaf":false,"text":"Benchmark: As the United States expanded westward, major issues, some of them from the first years of the nation, began to challenge the stability of the nation. As the nation expanded, issues of states rights, the institution of slavery, and economic development culminated in a Civil War. This war formally ended slavery and strengthened the power of the Federal government. The era after the Civil War was a time of major economic development and technological innovation.","children":[{"leaf":false,"text":"Objective 1: Investigate the significant events during America's expansion and the roles people played.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ACAB","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"a. Identify key reasons why people move and the traits necessary for survival."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ACAC","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"b. Examine causes and consequences of important events in the United States expansion (e.g. Louisiana Purchase, Lewis and Clark expedition, treaties with American Indians, Homestead Act, Trail of Tears, California Gold Rush)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ACAD","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"c. Compare the trails that were important during westward expansion (e.g. Oregon, Mormon, Spanish, California)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ACAE","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"d. Assess the impact of expansion on native inhabitants of the west."}]},{"leaf":false,"text":"Objective 2: Assess the geographic, cultural, political, and economic divisions between regions that contributed to the Civil War.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ACAF","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"a. Describe the impact of physical geography on the cultures of the northern and southern regions (e.g. industrial resources, agriculture, climate)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ACB0","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"b. Compare how cultural and economic differences of the North and South led to tensions."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ACB1","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"c. Identify the range of individual responses to the growing political conflicts between the North and South (e.g. states rights advocates, abolitionists, slaveholders, enslaved people)."}]},{"leaf":false,"text":"Objective 3: Evaluate the course of events of the Civil War and its impact both immediate and long-term.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ACB2","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"a. Identify the key ideas, events, and leaders of the Civil War using primary sources (e.g. Gettysburg Address, Emancipation Proclamation, news accounts, photographic records, diaries)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ACB3","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"b. Contrast the impact of the war on individuals in various regions (e.g. North, South, West)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ACB4","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"c. Explain how the Civil War helped forge ideas of national identity."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ACB5","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"d. Examine the difficulties of reconciliation within the nation."}]},{"leaf":false,"text":"Objective 4: Understand the impact of major economic forces at work in the post-Civil War.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ACB6","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"a. Assess how the free-market system in the United States serves as an engine of change and innovation."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ACB7","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"b. Describe the wide-ranging impact of the Industrial Revolution (e.g. inventions, industries, innovations)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ACB8","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"c. Evaluate the roles new immigrants played in the economy of this time."}]}]}]},{"leaf":false,"text":"Fifth Grade Standard V: Students will address the causes, consequences and implications of the emergence of the United States as a world power.","children":[{"leaf":false,"text":"Benchmark: The United States now has a range of influence that spans the globe. This emergence of power gained fullest expression in the 20th century. The touchstone events of war and worldwide economic depression, coupled with social movements based on the democratic ideals central to the United States Constitution, positioned the United States as a world superpower. With this power comes questions about the role and responsibilities the United States can and should play in the world.","children":[{"leaf":false,"text":"Objective 1: Describe the role of the United States during World War I, The Great Depression, and World War II.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ACB9","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"a. Review the impact of World War I on the United States."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ACBA","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"b. Summarize the consequences of the Great Depression on the United States (e.g. mass migration, the New Deal)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ACBB","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"c. Analyze how the United States' involvement in World War II led to its emergence as a superpower."}]},{"leaf":false,"text":"Objective 2: Assess the impact of social and political movements in recent United States history.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ACBC","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"a. Identify major social movements of the 20th century (e.g. the women's movement, the civil rights movement, child labor reforms)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ACBD","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"b. Identify leaders of social and political movements"}]},{"leaf":false,"text":"Objective 3: Evaluate the role of the United States as a world power.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ACBE","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"a. Assess differing points of view on the role of the US as a world power (e.g. influencing the spread of democracy, supporting the rule of law, advocating human rights, promoting environmental stewardship)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ACBF","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"b. Identify a current issue facing the world and propose a role the United States could play in being part of a solution (e.g. genocide, child labor, civil rights, education, public health, environmental protections, suffrage, economic disparities)."}]}]}]}]},{"leaf":false,"text":"Sixth Grade Social Studies: World Studies","children":[{"leaf":false,"text":"Sixth Grade Standard I: Students will understand how ancient civilizations developed and how they contributed to the current state of the world.","children":[{"leaf":false,"text":"Benchmark: Humans originated in Africa and migrated across the Earth, creating ancient civilizations in nearly every region that could support life. Modern civilizations can trace their foundations to these ancient civilizations. Their cultures and histories can teach us much about ourselves and the modern world in which we live.","children":[{"leaf":false,"text":"Objective 1: Explain why physical geography affected the development of early civilizations.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ACC0","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"a. Identify the major physical features of the regions where ancient civilizations flourished."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ACC1","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"b. Describe how these features influenced the success or decline of the civilizations."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ACC2","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"c. Compare maps of these ancient civilizations to current political maps and make inferences about the continuing affects of physical geography on cultural development."}]},{"leaf":false,"text":"Objective 2: Evaluate how religion has played a central role in human history from ancient times to today.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ACC3","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"a. Explore the importance of religion in the cultural expression of ancient civilizations (e.g. customs, artistic expression, creation stories, architecture of sacred spaces)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ACC4","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"b. Identify key tenets of the major world religions (i.e. Buddhism, Christianity, Hinduism, Islam, Judaism)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ACC5","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"c. Analyze how religious ideas influence current issues."}]},{"leaf":false,"text":"Objective 3: Explain how modern governments can trace some of their attributes to the systems of power, authority, and governance established in ancient civilizations.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ACC6","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"a. Identify forms of government within these civilizations."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ACC7","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"b. Compare those forms to existing systems of governance in today's world."}]},{"leaf":false,"text":"Objective 4: Analyze how the earliest civilizations created technologies and systems to meet community and personal needs.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ACC8","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"a. Identify innovations in manmade structures over time (e.g. irrigation, roads, building materials) and their influence on meeting needs."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ACC9","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"b. Examine the evolution and importance of writing."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ACCA","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"c. Identify cultural expressions that reflect these systems (e.g. architecture, artistic expression, medicine, philosophy, drama, literature)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ACCB","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"d. Compare social classes, vocations, and gender roles within ancient civilizations."}]}]}]},{"leaf":false,"text":"Sixth Grade Standard II: Students will understand the transformation of cultures during the Middle Ages and the Renaissance and the impact of this transformation on modern times.","children":[{"leaf":false,"text":"Benchmark: The Middle Ages and the Renaissance were epochs of great impact on our modern world. The expansion of knowledge, technological innovation and global interconnectedness set in motion changes that still resonate today.","children":[{"leaf":false,"text":"Objective 1: Explain how physical geography affects economic and cultural expansion.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ACCC","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"a. Identify natural resources and physical features that affected expansion."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ACCD","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"b. Describe the development of international trade via the desert, sea, and land and the resultant cultural exchanges between Asia, the Middle East, and Europe (e.g. the Silk Road)"}]},{"leaf":false,"text":"Objective 2: Explore the importance of religion in the Middle Ages and the Renaissance and its relevance to modern times.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ACCE","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"a. Explain the influence of religion on cultural expression (e.g. the arts, architecture, government, education, family structure)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ACCF","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"b. Compare relations between the Muslim, Christian, and Jewish faiths during the Middle Ages, Renaissance, and the modern world (e.g. Crusades, periods of peaceful coexistence, periods of conflict)."}]},{"leaf":false,"text":"Objective 3: Examine how systems of governance began steps toward self-rule during the Middle Ages and the Renaissance.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ACD0","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"a. Examine relationships between significant events and ideas and their influence on systems of government (e.g. the rise of the merchant class, the Magna Carta, the impact of the Black Death, Germanic tribes, feudalism, manors, city-states)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ACD1","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"b. Compare individual rights of people in the United States today with the rights of selected groups in the Middle Ages and the Renaissance (e.g. serfs, nobility, merchant class)."}]},{"leaf":false,"text":"Objective 4: Explain the importance of the Renaissance as a rebirth of cultural and intellectual pursuits.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ACD2","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"a. Investigate how technological and scientific developments of the time promoted literacy and the exchange of ideas that continue to this day (e.g. moveable type, telescope, microscope)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ACD3","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"b. Identify leading Renaissance artists and thinkers and their contributions to visual arts, writing, music, and architecture (e.g. Machiavelli, Michelangelo, Leonardo da Vinci, Palestrina, Shakespeare, Tallis)."}]}]}]},{"leaf":false,"text":"Sixth Grade Standard III: Students will understand how revolutions have had an impact on the modern world.","children":[{"leaf":false,"text":"Benchmark: When people think of revolution, most of us think of armed conflict. World history has multiple examples of revolutionary times and revolutionary ideas and movements, but the era from 1750 to 1914 provides several strong examples of change in different arenas. The technological and economic impact of the industrial revolution meshed with the rise of new political ideologies and the rise of European dominance. The global forces of revolution created changes that still resonate to this day.","children":[{"leaf":false,"text":"Objective 1: Understand processes of revolution","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ACD4","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"a. Examine social, religious, and economic issues that may lead to revolution."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ACD5","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"b. Identify and compare how revolutions develop in multiple areas of human life (e.g. scientific, agricultural, industrial, political, medical)."}]},{"leaf":false,"text":"Objective 2: Analyze the impact of selected revolutions.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ACD6","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"a. Identify representative people from selected revolutions (e.g. Napoleon, Martin Luther, James Watt, Isaac Newton, Madame Curie, Anton Van Leeuwenhoek)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ACD7","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"b. Examine the outcomes of selected revolutions (e.g. the Scientific and Industrial revolutions, the Reformation, the French Revolution)."}]}]}]},{"leaf":false,"text":"Sixth Grade Standard IV: Students will understand current global issues and their rights and responsibilities in the interconnected world.","children":[{"leaf":false,"text":"Benchmark: The modern world has witnessed incredible change in global trade, the spread of democracy, the influence of technology, an increase in environmental awareness and advances in human knowledge. The 20th century saw two world wars, the rise of competing economic systems, and unprecedented technological change. Against the backdrop of the modern world there are many opinions regarding the civic responsibilities humans have to one another.","children":[{"leaf":false,"text":"Objective 1. Analyze how major world events of the 20th century affect the world today.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ACD8","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"a. Identify key events, ideas, and leaders of the 20th century (e.g. World War I, World War II, the Cold War, the Korean and Vietnamese conflicts, dynamic Asian economies)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ACD9","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"b. Describe the impact of these events on the world today."}]},{"leaf":false,"text":"Objective 2: Explore current global issues facing the modern world and identify potential solutions.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ACDA","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"c. Investigate pressing issues facing the world today (e.g. environmental, pollution, political turmoil, hunger, poverty, genocide, famine, natural disasters, child labor)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ACDB","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"d. Identify potential solutions to pressing issues."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ACDC","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"e. Identify individuals and groups making positive changes in the world today and support these choices with evidence."}]},{"leaf":false,"text":"Objective 2: Determine human rights and responsibilities in the world.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ACDD","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"a. Identify rights considered essential for all humans (e.g. health care, education, safety, freedom from fear, freedom of expression)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ACDE","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"b. Propose steps individual students can take to protect these rights (e.g. support for sister schools, energy and resource conservation, letter writing, career choices, fundraising efforts)."}]}]}]}]}]