[{"leaf":false,"text":"1.1 The Creative Process: All students will demonstrate an understanding of the elements and principles that govern the creation of works of art in dance, music, theatre, and visual art.","children":[{"leaf":false,"text":"A. Dance","children":[{"leaf":false,"text":"NOTE: By the end of grade 2, ALL students progress toward BASIC LITERACY in the following content knowledge and skills in DANCE.","children":[{"leaf":false,"text":"Original choreography and improvisation of movement sequences begins with basic understanding of the elements of dance.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDED","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"asn_statementNotation":"1.1.2.A.1","text":"Identify the elements of dance in planned and improvised dance sequences."}]},{"leaf":false,"text":"Original movement is generated through improvisational skills and techniques.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDEE","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"asn_statementNotation":"1.1.2.A.2","text":"Use improvisation to discover new movement to fulfill the intent of the choreography."}]},{"leaf":false,"text":"There are distinct differences between pedestrian movements and formal training in dance.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDEF","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"asn_statementNotation":"1.1.2.A.3","text":"Demonstrate the difference between pantomime, pedestrian movement, abstract gesture, and dance movement."}]},{"leaf":false,"text":"The coordination and isolation of different body parts is dependent on the dynamic alignment of the body while standing and moving.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDF0","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"asn_statementNotation":"1.1.2.A.4","text":"Apply and adapt isolated and coordinated body part articulations, body alignment, balance, and body patterning."}]}]},{"leaf":false,"text":"NOTE: By the end of grade 5, ALL students demonstrate BASIC LITERACY in the following content knowledge and skills in DANCE.","children":[{"leaf":false,"text":"Basic choreographed structures employ the elements of dance.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDF1","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"asn_statementNotation":"1.1.5.A.1","text":"Analyze both formal and expressive aspects of time, shape, space, and energy, and differentiate basic choreographic structures in various dance works."}]},{"leaf":false,"text":"Movement is developed and generated through improvisation. Form and structure are important when interpreting original choreography.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDF2","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"asn_statementNotation":"1.1.5.A.2","text":"Analyze the use of improvisation that fulfills the intent of and develops choreography in both its form and structure."}]},{"leaf":false,"text":"Musical and non-musical forms of sound can affect meaning in choreography and improvisation.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDF3","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"asn_statementNotation":"1.1.5.A.3","text":"Determine how accompaniment (such as sound, spoken text, or silence) can affect choreography and improvisation."}]},{"leaf":false,"text":"Compositional works are distinguished by the use of various body movements and sources of initiation (i.e., central, peripheral, or transverse).","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDF4","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"asn_statementNotation":"1.1.5.A.4","text":"Differentiate contrasting and complimentary shapes, shared weight centers, body parts, body patterning, balance, and range of motion in compositions and performances."}]}]},{"leaf":false,"text":"NOTE: By the end of grade 8, those students choosing DANCE as their required area of specialization demonstrate COMPETENCY in the following content knowledge and skills.","children":[{"leaf":false,"text":"Numerous formal choreographic structures can be used to develop the elements of dance in the creation of dance works.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDF5","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"asn_statementNotation":"1.1.8.A.1","text":"Interpret the choreographic structures of contrast and transition, the process of reordering and chance, and the structures of AB, ABA, canon, call and response, and narrative."}]},{"leaf":false,"text":"Styles and techniques in dance are defined by the ways in which the elements of dance and choreographic principles are manipulated in the creation of dance compositions.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDF6","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"asn_statementNotation":"1.1.8.A.2","text":"Analyze dance techniques and styles to discern the compositional use of the elements of dance and choreographic principles relating to dynamics, as well as to discern spatial relationships."}]},{"leaf":false,"text":"Dance employs various themes and arts media to engage the viewer, develop meaning, and communicate emotions.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDF7","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"asn_statementNotation":"1.1.8.A.3","text":"Examine how dance compositions are influenced by various social themes and arts media (e.g., dance for camera, interactive, telematics)."}]},{"leaf":false,"text":"The quality of integrated movement depends on body alignment and the synchronized use of major and minor muscle groups. Variety in body patterns, range of motion, application of the elements of dance, and skill level enhance dance compositions and performance.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDF8","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"asn_statementNotation":"1.1.8.A.4","text":"Integrate a variety of isolated and coordinated movements in dance compositions and performances, making use of all major muscle groups, proper body mechanics, body patterning, balance, and range of motion."}]}]},{"leaf":false,"text":"NOTE: By the end of grade 12, those students choosing DANCE as their required area of specialization demonstrate PROFICIENCY in the following content knowledge and skills.","children":[{"leaf":false,"text":"Creating master works in dance requires ability to comprehend, articulate, and manipulate time, space, and energy across and within a broad spectrum of choreographic structures and through the use of many choreographic devices.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDF9","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"1.1.12.A.1","text":"Articulate understanding of choreographic structures or forms (e.g., palindrome, theme and variation, rondo, retrograde, inversion, narrative, and accumulation) in master works of dance."}]},{"leaf":false,"text":"Acute kinesthetic awareness and mastery of composition are essential for creating and interpreting master works of art.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDFA","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"1.1.12.A.2","text":"Categorize the elements, principles, and choreographic structures of dance masterworks."}]},{"leaf":false,"text":"Interpretation of dance is heavily reliant on its context.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDFB","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"1.1.12.A.3","text":"Analyze issues of gender, ethnicity, socio-economic status, politics, age, and physical conditioning in relation to dance performances."}]},{"leaf":false,"text":"Artistry in dance performance is accomplished through complete integration of anatomical principles and clear direction of intent and purpose.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDFC","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"1.1.12.A.4","text":"Synthesize knowledge of anatomical principles related to body alignment, body patterning, balance, strength, and coordination in compositions and performances."}]}]}]},{"leaf":false,"text":"B. Music","children":[{"leaf":false,"text":"NOTE: By the end of grade 2, ALL students progress toward BASIC LITERACY in the following content knowledge and skills in MUSIC.","children":[{"leaf":false,"text":"Ear training and listening skill are prerequisites for musical literacy.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDE3","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"asn_statementNotation":"1.1.2.B.1","text":"Explore the elements of music through verbal and written responses to diverse aural prompts and printed scores."}]},{"leaf":false,"text":"The elements of music are foundational to basic music literacy.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDE4","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"asn_statementNotation":"1.1.2.B.2","text":"Identify musical elements in response to diverse aural prompts, such as rhythm, timbre, dynamics, form, and melody."}]},{"leaf":false,"text":"Music is often defined as organized sound that is dependent on predictable properties of tone and pitch. Musical notation captures tonality, dynamic range, and rhythm.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDE5","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"asn_statementNotation":"1.1.2.B.3","text":"Identify and categorize sound sources by common traits (e.g., scales, rhythmic patterns, and/or other musical elements), and identify rhythmic notation up to eighth notes and rests."}]},{"leaf":false,"text":"Musical instruments have unique qualities of tonality and resonance. Conventional instruments are divided into musical families according to shared properties.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDE6","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"asn_statementNotation":"1.1.2.B.4","text":"Categorize families of instruments and identify their associated musical properties."}]}]},{"leaf":false,"text":"NOTE: By the end of grade 5, ALL students demonstrate BASIC LITERACY in the following content knowledge and skills in MUSIC.","children":[{"leaf":false,"text":"Reading basic music notation contributes to musical fluency and literacy. Musical intelligence is related to ear training and listening skill, and temporal spatial reasoning ability is connected to listening skill.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDE7","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"asn_statementNotation":"1.1.5.B.1","text":"Identify the elements of music in response to aural prompts and printed music notational systems."}]},{"leaf":false,"text":"The elements of music are building blocks denoting meter, rhythmic concepts, tonality, intervals, chords, and melodic and harmonic progressions, all of which contribute to musical literacy.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDE8","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"asn_statementNotation":"1.1.5.B.2","text":"Demonstrate the basic concepts of meter, rhythm, tonality, intervals, chords, and melodic and harmonic progressions, and differentiate basic structures."}]}]},{"leaf":false,"text":"NOTE: By the end of grade 8, those students choosing MUSIC as their required area of specialization demonstrate COMPETENCY in the following content knowledge and skills.","children":[{"leaf":false,"text":"Common, recognizable musical forms often have characteristics related to specific cultural traditions.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDE9","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"asn_statementNotation":"1.1.8.B.1","text":"Analyze the application of the elements of music in diverse Western and non-Western musical works from different historical eras using active listening and by reading and interpreting written scores."}]},{"leaf":false,"text":"Compositional techniques used in different styles and genres of music vary according to prescribed sets of rules.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDEA","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"asn_statementNotation":"1.1.8.B.2","text":"Compare and contrast the use of structural forms and the manipulation of the elements of music in diverse styles and genres of musical compositions."}]}]},{"leaf":false,"text":"NOTE: By the end of grade 12, those students choosing MUSIC as their required area of specialization demonstrate PROFICIENCY in the following content knowledge and skills.","children":[{"leaf":false,"text":"Understanding nuanced stylistic differences among various genres of music is a component of musical fluency. Meter, rhythm, tonality, and harmonics are determining factors in the categorization of musical genres.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDEB","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"1.1.12.B.1","text":"Examine how aspects of meter, rhythm, tonality, intervals, chords, and harmonic progressions are organized and manipulated to establish unity and variety in genres of musical compositions."}]},{"leaf":false,"text":"Musical proficiency is characterized by the ability to sight-read advanced notation. Musical fluency is also characterized by the ability to classify and replicate the stylistic differences in music of varying traditions.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDEC","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"1.1.12.B.2","text":"Synthesize knowledge of the elements of music in the deconstruction and performance of complex musical scores from diverse cultural contexts."}]}]}]},{"leaf":false,"text":"C. Theatre","children":[{"leaf":false,"text":"NOTE: By the end of grade 2, ALL students progress toward BASIC LITERACY in the following content knowledge and skills in THEATRE.","children":[{"leaf":false,"text":"The elements of theatre are recognizable in theatrical performances.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDD4","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"asn_statementNotation":"1.1.2.C.1","text":"Identify basic elements of theatre and describe their use in a variety of theatrical performances."}]},{"leaf":false,"text":"Theatre artists use precise vocabulary when staging a play.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDD5","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"asn_statementNotation":"1.1.2.C.2","text":"Express stage directions, areas of the stage, basic stage movements, and parts of a script using correct theatre terms (e.g., setting, costumes, plot, theme, etc.)."}]},{"leaf":false,"text":"Creative drama and storytelling use voice, movement, and facial expression to communicate emotions. Creating characters is an act of intention in which actors play themselves in an imaginary set of circumstances.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDD6","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"asn_statementNotation":"1.1.2.C.3","text":"Distinguish between characters, actors, and the self by demonstrating respect for personal space, creative movement, and pantomime skills while interacting with others in creative drama and storytelling."}]},{"leaf":false,"text":"The technical theatrical elements and theatre architecture are inherent in theatrical design and production.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDD7","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"asn_statementNotation":"1.1.2.C.4","text":"Describe the use of the technical theatrical elements by examining examples of theatrical design in productions."}]}]},{"leaf":false,"text":"NOTE: By the end of grade 5, ALL students demonstrate BASIC LITERACY in the following content knowledge and skills in THEATRE.","children":[{"leaf":false,"text":"The well-made play uses a specific, identifiable narrative structure (e.g., inciting incident, climax, dénouement, etc.).","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDD8","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"asn_statementNotation":"1.1.5.C.1","text":"Evaluate the characteristics of a well-made play in a variety of scripts and performances."}]},{"leaf":false,"text":"The actor's physicality and vocal techniques have a direct relationship to character development.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDD9","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"asn_statementNotation":"1.1.5.C.2","text":"Interpret the relationship between the actor's physical and vocal choices and an audience's perception of character development by identifying examples of vocal variety, stage business, concentration, and focus."}]},{"leaf":false,"text":"Time, place, mood, and theme are enhanced through use of the technical theatrical elements.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDDA","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"asn_statementNotation":"1.1.5.C.3","text":"Analyze the use of technical theatrical elements to identify how time, place, mood, and theme are created."}]},{"leaf":false,"text":"Sensory recall is a technique actors commonly employ to heighten the believability of a character.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDDB","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"asn_statementNotation":"1.1.5.C.4","text":"Explain the function of sensory recall and apply it to character development."}]}]},{"leaf":false,"text":"NOTE: By the end of grade 8, those students choosing THEATRE as their required area of specialization demonstrate COMPETENCY in the following content knowledge and skills.","children":[{"leaf":false,"text":"Distinct pieces of dramatic literature and theatrical trends reflect cultural traditions and periods in history.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDDC","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"asn_statementNotation":"1.1.8.C.1","text":"Analyze the structural components of plays and performances from a variety of Western and non-Western theatrical traditions and from different historical eras."}]},{"leaf":false,"text":"Actors exercise their voices and bodies through a wide variety of techniques to expand the range and the clarity of the characters they develop.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDDD","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"asn_statementNotation":"1.1.8.C.2","text":"Determine the effectiveness of various methods of vocal, physical, relaxation, and acting techniques used in actor training."}]},{"leaf":false,"text":"Emotion and meaning are often communicated through modulations of vocal rate, pitch, and volume.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDDE","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"asn_statementNotation":"1.1.8.C.3","text":"Differentiate among vocal rate, pitch, and volume, and explain how they affect articulation, meaning, and character."}]},{"leaf":false,"text":"A team of artists, technicians, and managers who collaborate to achieve a common goal uses a broad range of skills to create theatrical performances.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDDF","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"asn_statementNotation":"1.1.8.C.4","text":"Define the areas of responsibility (e.g., actor, director, producer, scenic, lighting, costume, stagehand, etc.) and necessary job skills of the front and back-of-house members of a theatre company."}]}]},{"leaf":false,"text":"NOTE: By the end of grade 12, those students choosing THEATRE as their required area of specialization demonstrate PROFICIENCY in the following content knowledge and skills.","children":[{"leaf":false,"text":"Theatre and the arts play a significant role in human history and culture.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDE0","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"1.1.12.C.1","text":"Analyze examples of theatre's influence on history and history's influence on theatre in Western and non-Western theatre traditions."}]},{"leaf":false,"text":"Characters have physical, emotional, and social dimensions that can be communicated through the application of acting techniques.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDE1","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"1.1.12.C.2","text":"Formulate a process of script analysis to identify how the physical, emotional, and social dimensions of a character are communicated through the application of acting techniques."}]},{"leaf":false,"text":"Theatre production is an art, but it is also a science requiring knowledge of safety procedures, materials, technology, and construction techniques.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDE2","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"1.1.12.C.3","text":"Apply the basic physical and chemical properties (e.g., light, electricity, color, paint, scenic construction, costumes, makeup, and audio components) inherent in technical theatre to safely implement theatre design."}]}]}]},{"leaf":false,"text":"D. Visual Art","children":[{"leaf":false,"text":"NOTE: By the end of grade 2, ALL students progress toward BASIC LITERACY in the following content knowledge and skills in VISUAL ART.","children":[{"leaf":false,"text":"The basic elements of art and principles of design govern art creation and composition.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDCC","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"asn_statementNotation":"1.1.2.D.1","text":"Identify the basic elements of art and principles of design in diverse types of artwork."}]},{"leaf":false,"text":"Recognizing the elements of art and principles of design in artworks of known and emerging artists, as well as peers, is an initial step toward visual literacy.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDCD","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"asn_statementNotation":"1.1.2.D.2","text":"Identify elements of art and principles of design in specific works of art and explain how they are used."}]}]},{"leaf":false,"text":"NOTE: By the end of grade 5, ALL students demonstrate BASIC LITERACY in the following content knowledge and skills in VISUAL ART.","children":[{"leaf":false,"text":"Understanding the function and purpose of the elements of art and principles of design assists with forming an appreciation of how art and design enhance functionality and improve quality of living.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDCE","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"asn_statementNotation":"1.1.5.D.1","text":"Identify elements of art and principles of design that are evident in everyday life."}]},{"leaf":false,"text":"The elements of art and principles of design are universal.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDCF","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"asn_statementNotation":"1.1.5.D.2","text":"Compare and contrast works of art in various mediums that use the same art elements and principles of design."}]}]},{"leaf":false,"text":"NOTE: By the end of grade 8, those students choosing VISUAL ART as their required area of specialization demonstrate COMPETENCY in the following content knowledge and skills.","children":[{"leaf":false,"text":"Art is a universal language. Visual communication through art crosses cultural and language barriers throughout time.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDD0","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"asn_statementNotation":"1.1.8. D.1","text":"Describe the intellectual and emotional significance conveyed by the application of the elements of art and principles of design in different historical eras and cultures."}]},{"leaf":false,"text":"The study of masterworks of art from diverse cultures and different historical eras assists in understanding specific cultures.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDD1","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"asn_statementNotation":"1.1.8. D.2","text":"Compare and contrast various masterworks of art from diverse cultures, and identify elements of the works that relate to specific cultural heritages."}]}]},{"leaf":false,"text":"NOTE: By the end of grade 12, those students choosing VISUAL ART as their required area of specialization demonstrate PROFICIENCY in the following content knowledge and skills.","children":[{"leaf":false,"text":"Common themes exist in artwork from a variety of cultures across time and are communicated through metaphor, symbolism, and allegory.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDD2","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"1.1.12.D.1","text":"Distinguish innovative applications of the elements of art and principles of design in visual artworks from diverse cultural perspectives and identify specific cross-cultural themes."}]},{"leaf":false,"text":"Stimuli for the creation of artworks can come from many places, including other arts disciplines.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDD3","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"1.1.12.D.2","text":"Translate literary, musical, theatrical, and dance compositions by using them as stimulus/inspiration for corresponding visual artworks."}]}]}]}]},{"leaf":false,"text":"1.2: History of the Arts and Culture: All students will understand the role, development, and influence of the arts throughout history and across cultures.","children":[{"leaf":false,"text":"A. History of the Arts and Culture","children":[{"leaf":false,"text":"NOTE: By the end of grade 2, ALL students progress toward BASIC LITERACY in the following content knowledge and skills in DANCE, MUSIC, THEATRE, and VISUAL ART.","children":[{"leaf":false,"text":"Dance, music, theatre, and visual artwork from diverse cultures and historical eras have distinct characteristics and common themes that are revealed by contextual clues within the works of art.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED6E","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"asn_statementNotation":"1.2.2.A.1","text":"Identify characteristic theme-based works of dance, music, theatre, and visual art, such as artworks based on the themes of family and community, from various historical periods and world cultures."}]},{"leaf":false,"text":"The function and purpose of art-making across cultures is a reflection of societal values and beliefs.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED6F","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"asn_statementNotation":"1.2.2.A.2","text":"Identify how artists and specific works of dance, music, theatre, and visual art reflect, and are affected by, past and present cultures."}]}]},{"leaf":false,"text":"NOTE: By the end of grade 5, ALL students demonstrate BASIC LITERACY in the following content knowledge and skills in DANCE, MUSIC, THEATRE, and VISUAL ART.","children":[{"leaf":false,"text":"Art and culture reflect and affect each other.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED70","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"asn_statementNotation":"1.2.5.A.1","text":"Recognize works of dance, music, theatre, and visual art as a reflection of societal values and beliefs."}]},{"leaf":false,"text":"Characteristic approaches to content, form, style, and design define art genres.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED71","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"asn_statementNotation":"1.2.5.A.2","text":"Relate common artistic elements that define distinctive art genres in dance, music, theatre, and visual art."}]},{"leaf":false,"text":"Sometimes the contributions of an individual artist can influence a generation of artists and signal the beginning of a new art genre.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED72","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"asn_statementNotation":"1.2.5.A.3","text":"Determine the impact of significant contributions of individual artists in dance, music, theatre, and visual art from diverse cultures throughout history."}]}]},{"leaf":false,"text":"NOTE: By the end of grade 8, all students demonstrate COMPETENCY in the following content knowledge and skills for their required area of specialization in DANCE, MUSIC, THEATRE, or VISUAL ART.","children":[{"leaf":false,"text":"Technological changes have and will continue to substantially influence the development and nature of the arts.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED73","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"asn_statementNotation":"1.2.8.A.1","text":"Map historical innovations in dance, music, theatre, and visual art that were caused by the creation of new technologies."}]},{"leaf":false,"text":"Tracing the histories of dance, music, theatre, and visual art in world cultures provides insight into the lives of people and their values.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED74","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"asn_statementNotation":"1.2.8.A.2","text":"Differentiate past and contemporary works of dance, music, theatre, and visual art that represent important ideas, issues, and events that are chronicled in the histories of diverse cultures."}]},{"leaf":false,"text":"The arts reflect cultural morays and personal aesthetics throughout the ages.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED75","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"asn_statementNotation":"1.2.8.A.3","text":"Analyze the social, historical, and political impact of artists on culture and the impact of culture on the arts."}]}]},{"leaf":false,"text":"NOTE: By the end of grade 12, all students demonstrate PROFICIENCY in the following content knowledge and skills for their required area of specialization in DANCE, MUSIC, THEATRE, or VISUAL ART.","children":[{"leaf":false,"text":"Cultural and historical events impact art-making as well as how audiences respond to works of art.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED76","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"1.2.12.A.1","text":"Determine how dance, music, theatre, and visual art have influenced world cultures throughout history."}]},{"leaf":false,"text":"Access to the arts has a positive influence on the quality of an individual's lifelong learning, personal expression, and contributions to community and global citizenship.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED77","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"1.2.12.A.2","text":"Justify the impact of innovations in the arts (e.g., the availability of music online) on societal norms and habits of mind in various historical eras."}]}]}]}]},{"leaf":false,"text":"1.3 Performance: All students will synthesize those skills, media, methods, and technologies appropriate to creating, performing, and/or presenting works of art in dance, music, theatre, and visual art.","children":[{"leaf":false,"text":"A. Dance","children":[{"leaf":false,"text":"NOTE: For those preschool programs that offer appropriate time and frequency of instruction, all students attain foundational skills that later lead to BASIC LITERACY in DANCE.","children":[{"leaf":false,"text":"Creative movement/dance is a means of self-expression.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDB6","dcterms_educationLevel":[{"prefLabel":"Pre-K"}],"asn_statementNotation":"1.3.P.A.1","text":"Move the body in a variety of ways, with and without music."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDB7","dcterms_educationLevel":[{"prefLabel":"Pre-K"}],"asn_statementNotation":"1.3.P.A.2","text":"Respond to changes in tempo and a variety of musical rhythms through body movement."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDB8","dcterms_educationLevel":[{"prefLabel":"Pre-K"}],"asn_statementNotation":"1.3.P.A.3","text":"Participate in simple sequences of movements."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDB9","dcterms_educationLevel":[{"prefLabel":"Pre-K"}],"asn_statementNotation":"1.3.P.A.4","text":"Define and maintain personal space, concentration, and focus during creative movement/dance performances."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDBA","dcterms_educationLevel":[{"prefLabel":"Pre-K"}],"asn_statementNotation":"1.3.P.A.5","text":"Participate in or observe a variety of dance and movement activities accompanied by music and/or props from different cultures and genres."}]}]},{"leaf":false,"text":"NOTE: By the end of grade 2, ALL students progress toward BASIC LITERACY in the following content knowledge and skills in DANCE.","children":[{"leaf":false,"text":"The elements of dance are time, space, and energy. Improvisational structures facilitate movement invention. Musical or non-musical accompaniment is a choice. Dance can communicate meaning around a variety of themes.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDBB","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"asn_statementNotation":"1.3.2.A.1","text":"Create and perform planned and improvised movement sequences using the elements of dance, with and without musical accompaniment, to communicate meaning around a variety of themes."}]},{"leaf":false,"text":"The creation of an original dance composition often begins with improvisation. Movement sequences change when applying the elements of dance.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDBC","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"asn_statementNotation":"1.3.2.A.2","text":"Create and perform planned and improvised movement sequences, alone and in small groups, with variations in tempo, meter, rhythm, spatial level (i.e., low, middle, and high), and spatial pathway."}]},{"leaf":false,"text":"The integrity of choreographed sequences is maintained by personal and group spatial relationships. Dance movement skills also require concentration and the intentional direction of focus during performance.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDBD","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"asn_statementNotation":"1.3.2.A.3","text":"Define and maintain personal space, concentrate, and appropriately direct focus while performing movement skills."}]},{"leaf":false,"text":"Locomotor and non-locomotor movements may contribute equally to the thematic content of solo and ensemble dances.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDBE","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"asn_statementNotation":"1.3.2.A.4","text":"Create and perform original movement sequences alone and with a partner using locomotor and non-locomotor movements at various levels in space."}]}]},{"leaf":false,"text":"NOTE: By the end of grade 5, ALL students demonstrate BASIC LITERACY in the following content knowledge and skills in DANCE.","children":[{"leaf":false,"text":"Fundamental movement structures include a defined beginning, middle, and ending. Planned choreographic and improvised movement sequences manipulate time, space, and energy. Kinesthetic transference of rhythm comes from auditory and visual stimuli.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDBF","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"asn_statementNotation":"1.3.5.A.1","text":"Perform planned and improvised sequences with a distinct beginning, middle, and end that manipulate time, space, and energy, and accurately transfer rhythmic patterns from the auditory to the kinesthetic."}]},{"leaf":false,"text":"The creation of an original dance composition is often reliant on improvisation as a choreographic tool. The essence/character of a movement sequence is also transformed when performed at varying spatial levels (i.e., low, middle, and high), at different tempos, along different spatial pathways, or with different movement qualities.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDC0","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"asn_statementNotation":"1.3.5.A.2","text":"Use improvisation as a tool to create and perform movement sequences incorporating various spatial levels (i.e., low, middle, and high), tempos, and spatial pathways."}]},{"leaf":false,"text":"Works of art, props, and other creative stimuli can be used to inform the thematic content of dances.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDC1","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"asn_statementNotation":"1.3.5.A.3","text":"Create and perform dances alone and in small groups that communicate meaning on a variety of themes, using props or artwork as creative stimuli."}]},{"leaf":false,"text":"Dance requires a fundamental understanding of body alignment and applied kinesthetic principles. Age-appropriate conditioning of the body enhances flexibility, balance, strength, focus, concentration, and performance technique.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDC2","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"asn_statementNotation":"1.3.5.A.4","text":"Demonstrate developmentally appropriate kinesthetic awareness of basic anatomical principles, using flexibility, balance, strength, focus, concentration, and coordination."}]},{"leaf":false,"text":"Various dance styles, traditions, and techniques adhere to basic principles of alignment, balance, focus, and initiation of movement.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDC3","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"asn_statementNotation":"1.3.5.A.5","text":"Perform basic sequences of movement from different styles or traditions accurately, demonstrating proper alignment, balance, initiation of movement, and direction of focus."}]}]},{"leaf":false,"text":"NOTE: By the end of grade 8, those students choosing DANCE as their required area of specialization demonstrate COMPETENCY in the following content knowledge and skills.","children":[{"leaf":false,"text":"Movement dynamics and qualities emphasize time, space, and energy. Movement affinities and effort actions impact dynamic tension and spatial relationships.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDC4","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"asn_statementNotation":"1.3.8.A.1","text":"Incorporate a broad range of dynamics and movement qualities in planned and improvised solo and group works by manipulating aspects of time, space, and energy."}]},{"leaf":false,"text":"Dance may be used as a symbolic language to communicate universal themes and varied points of view about social, political, or historical issues in given eras.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDC5","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"asn_statementNotation":"1.3.8.A.2","text":"Choreograph and perform cohesive dance works that reflect social, historical, and/or political themes."}]},{"leaf":false,"text":"Foundational understanding of anatomical and kinesthetic principles is a contributing factor to dance artistry. Artistry in dance requires rhythmic acuity.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDC6","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"asn_statementNotation":"1.3.8.A.3","text":"Choreograph and perform movement sequences that demonstrate artistic application of anatomical and kinesthetic principles as well as rhythmic acuity."}]},{"leaf":false,"text":"Technology and media arts are often catalysts for creating original choreographic compositions.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDC7","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"asn_statementNotation":"1.3.8.A.4","text":"Use media arts and technology in the creation and performance of short, original choreographic compositions."}]}]},{"leaf":false,"text":"NOTE: By the end of grade 12, those students choosing DANCE as their required area of specialization demonstrate PROFICIENCY in the following content knowledge and skills.","children":[{"leaf":false,"text":"Creating highly integrated improvisational movement sequences develops personal style for solo and ensemble work. Characteristics of style vary broadly across dance genres.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDC8","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"1.3.12.A.1","text":"Integrate and recombine movement vocabulary drawn from a variety of dance genres, using improvisation as a choreographic tool to create solo and ensemble compositions."}]},{"leaf":false,"text":"Aesthetic quality results from conceptual coherence and from understanding and application of the principle unity of form and content.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDC9","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"1.3.12.A.2","text":"Create theme-based solo and ensemble dances that have unity of form and content, conceptual coherence, and aesthetic unity."}]},{"leaf":false,"text":"Dance artistry is achieved through refined technique, musicality, clarity of choreographic intent, stylistic nuance, and application of proper body mechanics.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDCA","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"1.3.12.A.3","text":"Demonstrate dance artistry with technical proficiency, musicality, stylistic nuance, clarity of choreographic intent, and efficiency of movement through the application of proper body mechanics."}]},{"leaf":false,"text":"Dance production is collaborative and requires choreographic, technological, design, and performance skill.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDCB","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"1.3.12.A.4","text":"Collaborate in the design and production of dances that use choreographic structures and incorporate various media and/or technologies."}]}]}]},{"leaf":false,"text":"B. Music","children":[{"leaf":false,"text":"NOTE: For those preschool programs that offer appropriate time and frequency of instruction, all students attain foundational skills that later lead to BASIC LITERACY in MUSIC.","children":[{"leaf":false,"text":"Creating and performing music provides a means of self-expression for very young learners.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED9F","dcterms_educationLevel":[{"prefLabel":"Pre-K"}],"asn_statementNotation":"1.3.P.B.1","text":"Sing a variety of songs with expression, independently and with others."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDA0","dcterms_educationLevel":[{"prefLabel":"Pre-K"}],"asn_statementNotation":"1.3.P.B.2","text":"Use a variety of musical instruments to create music, alone and/or with others, using different beats, tempos, dynamics, and interpretations."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDA1","dcterms_educationLevel":[{"prefLabel":"Pre-K"}],"asn_statementNotation":"1.3.P.B.3","text":"Clap or sing songs with repetitive phrases and rhythmic patterns."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDA2","dcterms_educationLevel":[{"prefLabel":"Pre-K"}],"asn_statementNotation":"1.3.P.B.4","text":"Listen to, imitate, and improvise sounds, patterns, or songs."}]}]},{"leaf":false,"text":"NOTE: By the end of grade 2, ALL students progress toward BASIC LITERACY in the following content knowledge and skills in MUSIC.","children":[{"leaf":false,"text":"The ability to read music notation correlates with musical fluency and literacy. Notation systems are complex symbolic languages that indicate pitch, rhythm, dynamics, and tempo.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDA3","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"asn_statementNotation":"1.3.2.B.1","text":"Clap, sing, or play on pitch from basic notation in the treble clef, with consideration of pitch, rhythm, dynamics, and tempo."}]},{"leaf":false,"text":"Proper vocal production/vocal placement requires an understanding of basic anatomy and the physical properties of sound.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDA4","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"asn_statementNotation":"1.3.2.B.2","text":"Demonstrate developmentally appropriate vocal production/vocal placement and breathing technique."}]},{"leaf":false,"text":"Playing techniques for Orff instruments develop foundational skills used for hand percussion and melodic percussion instruments.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDA5","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"asn_statementNotation":"1.3.2.B.3","text":"Demonstrate correct playing techniques for Orff instruments or equivalent homemade instruments."}]},{"leaf":false,"text":"Proper breathing technique and correct posture improve the timbre of the voice and protect the voice when singing.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDA6","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"asn_statementNotation":"1.3.2.B.4","text":"Vocalize the home tone of familiar and unfamiliar songs, and demonstrate appropriate posture and breathing technique while performing songs, rounds, or canons in unison and with a partner."}]},{"leaf":false,"text":"Improvisation is a foundational skill for music composition.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDA7","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"asn_statementNotation":"1.3.2.B.5","text":"Improvise short tonal and rhythmic patterns over ostinatos, and modify melodic or rhythmic patterns using selected notes and/or scales to create expressive ideas."}]},{"leaf":false,"text":"Prescribed forms and rules govern music composition, rhythmic accompaniment, and the harmonizing of parts.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDA8","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"asn_statementNotation":"1.3.2.B.6","text":"Sing or play simple melodies or rhythmic accompaniments in AB and ABA forms independently and in groups, and sight-read rhythmic and music notation up to and including eighth notes and rests in a major scale."}]},{"leaf":false,"text":"Basic conducting patterns and gestures provide cues about how and when to execute changes in dynamics, timbre, and timing.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDA9","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"asn_statementNotation":"1.3.2.B.7","text":"Blend unison and harmonic parts and vocal or instrumental timbres while matching dynamic levels in response to a conductor's cues."}]}]},{"leaf":false,"text":"NOTE: By the end of grade 5, ALL students demonstrate BASIC LITERACY in the following content knowledge and skills in MUSIC.","children":[{"leaf":false,"text":"Complex scores may include compound meters and the grand staff.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDAA","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"asn_statementNotation":"1.3.5.B.1","text":"Sing or play music from complex notation, using notation systems in treble and bass clef, mixed meter, and compound meter."}]},{"leaf":false,"text":"Proper vocal production and vocal placement improve vocal quality. Harmonizing requires singing ability and active listening skills. Individual voice ranges change with time.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDAB","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"asn_statementNotation":"1.3.5.B.2","text":"Sing melodic and harmonizing parts, independently and in groups, adjusting to the range and timbre of the developing voice."}]},{"leaf":false,"text":"Music composition is governed by prescribed rules and forms that apply to both improvised and scored music.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDAC","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"asn_statementNotation":"1.3.5.B.3","text":"Improvise and score simple melodies over given harmonic structures using traditional instruments and/or computer programs."}]},{"leaf":false,"text":"Decoding musical scores requires understanding of notation systems, the elements of music, and basic compositional concepts.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDAD","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"asn_statementNotation":"1.3.5.B.4","text":"Decode how the elements of music are used to achieve unity and variety, tension and release, and balance in musical compositions."}]}]},{"leaf":false,"text":"NOTE: By the end of grade 8, those students choosing MUSIC as their required area of specialization demonstrate COMPETENCY in the following content knowledge and skills.","children":[{"leaf":false,"text":"Western, non-Western, and avant-garde notation systems have distinctly different characteristics.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDAE","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"asn_statementNotation":"1.3.8.B.1","text":"Perform instrumental or vocal compositions using complex standard and non-standard Western, non-Western, and avant-garde notation."}]},{"leaf":false,"text":"Stylistic considerations vary across genres, cultures, and historical eras.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDAF","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"asn_statementNotation":"1.3.8.B.2","text":"Perform independently and in groups with expressive qualities appropriately aligned with the stylistic characteristics of the genre."}]},{"leaf":false,"text":"Understanding of discipline-specific arts terminology (e.g., crescendo, diminuendo, pianissimo, forte, etc.) is a component of music literacy.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDB0","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"asn_statementNotation":"1.3.8.B.3","text":"Apply theoretical understanding of expressive and dynamic music terminology to the performance of written scores in the grand staff."}]},{"leaf":false,"text":"Improvisation is a compositional skill that is dependent on understanding the elements of music as well as stylistic nuances of historical eras and genres of music.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDB1","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"asn_statementNotation":"1.3.8.B.4","text":"Improvise music in a selected genre or style, using the elements of music that are consistent with basic playing and/or singing techniques in that genre or style."}]}]},{"leaf":false,"text":"NOTE: By the end of grade 12, those students choosing MUSIC as their required area of specialization demonstrate PROFICIENCY in the following content knowledge and skills.","children":[{"leaf":false,"text":"Technical accuracy, musicality, and stylistic considerations vary according to genre, culture, and historical era.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDB2","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"1.3.12.B.1","text":"Analyze compositions from different world cultures and genres with respect to technique, musicality, and stylistic nuance, and/or perform excerpts with technical accuracy, appropriate musicality, and the relevant stylistic nuance."}]},{"leaf":false,"text":"The ability to read and interpret music impacts musical fluency.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDB3","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"1.3.12.B.2","text":"Analyze how the elements of music are manipulated in original or prepared musical scores."}]},{"leaf":false,"text":"Understanding of how to manipulate the elements of music is a contributing factor to musical artistry.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDB4","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"1.3.12.B.3","text":"Improvise works through the conscious manipulation of the elements of music, using a variety of traditional and nontraditional sound sources, including electronic sound-generating equipment and music generation programs."}]},{"leaf":false,"text":"Basic vocal and instrumental arranging skills require theoretical understanding of music composition.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EDB5","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"1.3.12.B.4","text":"Arrange simple pieces for voice or instrument using a variety of traditional and nontraditional sound sources or electronic media, and/or analyze prepared scores using music composition software."}]}]}]},{"leaf":false,"text":"C. Theatre","children":[{"leaf":false,"text":"NOTE: For those preschool programs that offer appropriate time and frequency of instruction, all students attain foundational skills that later lead to BASIC LITERACY in THEATRE.","children":[{"leaf":false,"text":"Dramatic play provides a means of self-expression for very young learners.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED8E","dcterms_educationLevel":[{"prefLabel":"Pre-K"}],"asn_statementNotation":"1.3.P.C.1","text":"Play roles observed through life experiences (e.g., mom/dad, baby, firefighter, police officer, doctor, and mechanic)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED8F","dcterms_educationLevel":[{"prefLabel":"Pre-K"}],"asn_statementNotation":"1.3.P.C.2","text":"Use memory, imagination, creativity, and language to make up new roles and act them out."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED90","dcterms_educationLevel":[{"prefLabel":"Pre-K"}],"asn_statementNotation":"1.3.P.C.3","text":"Participate with others in dramatic play, negotiating roles and setting up scenarios using costumes and props."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED91","dcterms_educationLevel":[{"prefLabel":"Pre-K"}],"asn_statementNotation":"1.3.P.C.4","text":"Differentiate between fantasy/pretend play and real events."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED92","dcterms_educationLevel":[{"prefLabel":"Pre-K"}],"asn_statementNotation":"1.3.P.C.5","text":"Sustain and extend dramatic play interactions (i.e., anticipate what will happen next)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED93","dcterms_educationLevel":[{"prefLabel":"Pre-K"}],"asn_statementNotation":"1.3.P.C.6","text":"Begin to demonstrate appropriate audience skills during storytelling and performances."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED94","dcterms_educationLevel":[{"prefLabel":"Pre-K"}],"asn_statementNotation":"1.3.P.C.7","text":"Describe feelings and reactions and make increasingly informed responses to stories and dramatic performances."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED95","dcterms_educationLevel":[{"prefLabel":"Pre-K"}],"asn_statementNotation":"1.3.P.C.8","text":"Participate in and listen to stories and dramatic performances from a variety of cultures and times."}]}]},{"leaf":false,"text":"NOTE: By the end of grade 2, ALL students progress toward BASIC LITERACY in the following content knowledge and skills in THEATRE.","children":[{"leaf":false,"text":"Plays may use narrative structures to communicate themes.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED96","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"asn_statementNotation":"1.3.2.C.1","text":"Portray characters when given specifics about circumstances, plot, and thematic intent, demonstrating logical story sequence and informed character choices."}]},{"leaf":false,"text":"Actors use voice and movement as tools for storytelling.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED97","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"asn_statementNotation":"1.3.2.C.2","text":"Use voice and movement in solo, paired, and group pantomimes and improvisations."}]},{"leaf":false,"text":"Voice and movement have broad ranges of expressive potential.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED98","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"asn_statementNotation":"1.3.2.C.3","text":"Develop awareness of vocal range, personal space, and character-specific vocal and creative movement choices."}]}]},{"leaf":false,"text":"NOTE: By the end of grade 5, ALL students demonstrate BASIC LITERACY in the following content knowledge and skills in THEATRE.","children":[{"leaf":false,"text":"A play's effectiveness is enhanced by the theatre artists' knowledge of technical theatrical elements and understanding of the elements of theatre.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED99","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"asn_statementNotation":"1.3.5.C.1","text":"Create original plays using script-writing formats that include stage directions and technical theatrical elements, demonstrating comprehension of the elements of theatre and story construction."}]},{"leaf":false,"text":"Performers use active listening skills in scripted and improvised performances to create believable, multidimensional characters. Actors create a sense of truth and believability by applying performance techniques that are appropriate to the circumstances of a scripted or improvised performance.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED9A","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"asn_statementNotation":"1.3.5.C.2","text":"Demonstrate how active listening skills, vocal variety, physical expression, stage business, sensory recall, concentration, and focus affect meaning in scripted and improvised performances."}]}]},{"leaf":false,"text":"NOTE: By the end of grade 8, those students choosing THEATRE as their required area of specialization demonstrate COMPETENCY in the following content knowledge and skills.","children":[{"leaf":false,"text":"Effective scripted and improvisational performances require informed, supported, and sustained choices by actors, directors, and designers. Techniques for communicating a character's intent vary in live performances and recorded venues.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED9B","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"asn_statementNotation":"1.3.8.C.1","text":"Create a method for defining and articulating character objectives, intentions, and subtext, and apply the method to the portrayal of characters in live performances or recorded venues."}]},{"leaf":false,"text":"Dramatic context and active listening skills inform development of believable, multidimensional characters in scripted and improvised performances. Mastery of physical and vocal skills enables actors to create dramatic action that generates a sense of truth and credibility.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED9C","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"asn_statementNotation":"1.3.8.C.2","text":"Create and apply a process for developing believable, multidimensional characters in scripted and improvised performances by combining methods of relaxation, physical and vocal skills, acting techniques, and active listening skills."}]}]},{"leaf":false,"text":"NOTE: By the end of grade 12, those students choosing THEATRE as their required area of specialization demonstrate PROFICIENCY in the following content knowledge and skills.","children":[{"leaf":false,"text":"Effective scripted and improvisational performances require informed, supported, and sustained choices by actors, directors, and designers. Theatre genres are created by combining complex narrative structures, technical theatrical elements, and thematic intent.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED9D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"1.3.12.C.1","text":"Create plays that include well-structured plots and subplots, clear thematic intent, original characters, and technical theatrical elements appropriate to a variety of theatrical genres."}]},{"leaf":false,"text":"Presentation of believable, multidimensional characters in scripted and improvised performances requires application of specific physical choices, sustained vocal technique, and clearly motivated actions.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED9E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"1.3.12.C.2","text":"Create and evaluate performances by citing evidence of specific physical choices, sustained vocal technique, and clearly motivated actions."}]}]}]},{"leaf":false,"text":"D. Visual Art","children":[{"leaf":false,"text":"NOTE: For those preschool programs that offer appropriate time and frequency of instruction, all students attain foundational skills that later lead to BASIC LITERACY in VISUAL ART.","children":[{"leaf":false,"text":"Each art medium has its own materials, processes, skills, and technical application methods.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED78","dcterms_educationLevel":[{"prefLabel":"Pre-K"}],"asn_statementNotation":"1.3.P.D.1","text":"Demonstrate the safe and appropriate use and care of art materials and tools."}]}]},{"leaf":false,"text":"NOTE: By the end of grade 2, ALL students progress toward BASIC LITERACY in the following content knowledge and skills in VISUAL ART.","children":[{"leaf":false,"text":"Visual statements in art are derived from the basic elements of art regardless of the format and medium used to create the art. There are also a wide variety of art media, each having its own materials, processes, and technical application methods for exploring solutions to creative problems.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED79","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"asn_statementNotation":"1.3.2.D.1","text":"Create two- and three-dimensional works of art using the basic elements of color, line, shape, form, texture, and space, as well as a variety of art mediums and application methods."}]},{"leaf":false,"text":"Symbols convey meaning agreed upon by a group or culture. Manipulation of the basic elements of art and principles of design for personal expression results in visual communication that may be relevant in a variety of settings.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED7A","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"asn_statementNotation":"1.3.2.D.2","text":"Use symbols to create personal works of art based on selected age-appropriate themes, using oral stories as a basis for pictorial representation."}]},{"leaf":false,"text":"Each of the visual art forms uses various materials, tools, and techniques that are associated with unique verbal and visual vocabularies.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED7B","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"asn_statementNotation":"1.3.2.D.3","text":"Employ basic verbal and visual art vocabulary to demonstrate knowledge of the materials, tools, and methodologies used to create and tell visual stories."}]},{"leaf":false,"text":"Knowledge of visual art media necessitates an understanding of a variety of traditional and nontraditional tools, applications, possibilities, and limitations.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED7C","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"asn_statementNotation":"1.3.2.D.4","text":"Explore the use of a wide array of art mediums and select tools that are appropriate to the production of works of art in a variety of art media."}]},{"leaf":false,"text":"Visual awareness stems from acute observational skills and interest in visual objects, spaces, and the relationship of objects to the world.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED7D","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"asn_statementNotation":"1.3.2.D.5","text":"Create works of art that are based on observations of the physical world and that illustrate how art is part of everyday life, using a variety of art mediums and art media."}]}]},{"leaf":false,"text":"NOTE: By the end of grade 5, ALL students demonstrate BASIC LITERACY in the following content knowledge and skills in VISUAL ART.","children":[{"leaf":false,"text":"The elements of art and principles of design can be applied in an infinite number of ways to express personal responses to creative problems.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED7E","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"asn_statementNotation":"1.3.5.D.1","text":"Work individually and collaboratively to create two- and three-dimensional works of art that make cohesive visual statements and that employ the elements of art and principles of design."}]},{"leaf":false,"text":"Contextual clues to culturally specific thematic content, symbolism, compositional approach, and stylistic nuance are prevalent in works of art throughout the ages.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED7F","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"asn_statementNotation":"1.3.5.D.2","text":"Identify common and distinctive characteristics of artworks from diverse cultural and historical eras of visual art using age-appropriate stylistic terminology (e.g., cubist, surreal, optic, impressionistic), and experiment with various compositional approaches influenced by these styles."}]},{"leaf":false,"text":"Each of the genres of visual art (e.g., realism, surrealism, abstract/nonobjective art, conceptual art, and others) is associated with appropriate vocabulary and a stylistic approach to art-making.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED80","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"asn_statementNotation":"1.3.5.D.3","text":"Identify common and distinctive characteristics of genres of visual artworks (e.g., realism, surrealism, abstract/nonobjective art, conceptual art, and others) using age-appropriate terminology, and experiment with various compositional approaches influenced by these genres."}]},{"leaf":false,"text":"The characteristics and physical properties of the various materials available for use in art-making present infinite possibilities for potential application.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED81","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"asn_statementNotation":"1.3.5.D.4","text":"Differentiate drawing, painting, ceramics, sculpture, printmaking, textiles, and computer imaging by the physical properties of the resulting artworks, and experiment with various art media and art mediums to create original works of art."}]},{"leaf":false,"text":"There are many types of aesthetic arrangements for the exhibition of art. Creating or assembling gallery exhibitions requires effective time management and creative problem-solving skills.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED82","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"asn_statementNotation":"1.3.5.D.5","text":"Collaborate in the creation of works of art using multiple art media and art mediums, and present the completed works in exhibition areas inside and outside the classroom."}]}]},{"leaf":false,"text":"NOTE: By the end of grade 8, those students choosing VISUAL ART as their required area of specialization demonstrate COMPETENCY in the following content knowledge and skills.","children":[{"leaf":false,"text":"The creation of art is driven by the principles of balance, harmony, unity, emphasis, proportion, and rhythm/movement.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED83","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"asn_statementNotation":"1.3.8.D.1","text":"Incorporate various art elements and the principles of balance, harmony, unity, emphasis, proportion, and rhythm/movement in the creation of two- and three- dimensional artworks, using a broad array of art media and art mediums to enhance the expression of creative ideas (e.g., perspective, implied space, illusionary depth, value, and pattern)."}]},{"leaf":false,"text":"Themes in art are often communicated through symbolism, allegory, or irony. There are a wide variety of art mediums, each having appropriate tools and processes for the production of artwork. Fluency in these mediums, and the use of the appropriate tools associated with working in these mediums, are components of art-making.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED84","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"asn_statementNotation":"1.3.8.D.2","text":"Apply various art media, art mediums, technologies, and processes in the creation of allegorical, theme-based, two- and three-dimensional works of art, using tools and technologies that are appropriate to the theme and goals."}]},{"leaf":false,"text":"The classification of art into various art genres depends on the formal aspects of visual statements (e.g., physical properties, theoretical components, cultural context). Many genres of art are associated with discipline-specific arts terminology.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED85","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"asn_statementNotation":"1.3.8.D.3","text":"Identify genres of art (including realism, abstract/nonobjective art, and conceptual art) within various contexts using appropriate art vocabulary, and solve hands-on visual problems using a variety of genre styles."}]},{"leaf":false,"text":"Universal themes exist in art across historical eras and cultures. Art may embrace multiple solutions to a problem.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED86","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"asn_statementNotation":"1.3.8.D.4","text":"Delineate the thematic content of multicultural artworks, and plan, design, and execute multiple solutions to challenging visual arts problems, expressing similar thematic content."}]},{"leaf":false,"text":"Each of the many genres of art is associated with discipline-specific arts terminology and a stylistic approach to art-making.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED87","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"asn_statementNotation":"1.3.8.D.5","text":"Examine the characteristics, thematic content, and symbolism found in works of art from diverse cultural and historical eras, and use these visual statements as inspiration for original artworks."}]},{"leaf":false,"text":"The visual possibilities and inherent qualities of traditional and contemporary art materials (including digital media) may inform choices about visual communication and art-making techniques.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED88","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"asn_statementNotation":"1.3.8.D.6","text":"Synthesize the physical properties, processes, and techniques for visual communication in multiple art media (including digital media), and apply this knowledge to the creation of original artworks."}]}]},{"leaf":false,"text":"NOTE: By the end of grade 12, those students choosing VISUAL ART as their required area of specialization demonstrate PROFICIENCY in the following content knowledge and skills.","children":[{"leaf":false,"text":"How individuals manipulate the elements of art and principles of design results in original portfolios that reflect choice and personal stylistic nuance.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED89","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"1.3.12.D.1","text":"Synthesize the elements of art and principles of design in an original portfolio of two- and three-dimensional artworks that reflects personal style and a high degree of technical proficiency and expressivity."}]},{"leaf":false,"text":"Culturally and historically diverse art media, art mediums, techniques, and styles impact originality and interpretation of the artistic statement.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED8A","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"1.3.12.D.2","text":"Produce an original body of artwork in one or more art mediums that demonstrates mastery of visual literacy, methods, techniques, and cultural understanding."}]},{"leaf":false,"text":"The artist's understanding of the relationships among art media, methodology, and visual statement allows the artist to use expressionism, abstractionism (nonobjective art), realism/naturalism, impressionism, and other genre styles to convey ideas to an audience.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED8B","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"1.3.12.D.3","text":"Organize an exhibit of personal works of visual art that convey a high level of understanding of how the expression of ideas relates to the art media, art mediums, and techniques used."}]},{"leaf":false,"text":"Artists interpret/render themes using traditional art media and methodologies as well as new art media and methodologies.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED8C","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"1.3.12.D.4","text":"Analyze the syntax and compositional and stylistic principles of two- and three-dimensional artworks in multiple art media (including computer-assisted artwork), and interpret themes and symbols suggested by the artworks."}]},{"leaf":false,"text":"Two- and three-dimensional artworks can be rendered culturally specific by using the tools, techniques, styles, materials, and methodologies that are germane to a particular cultural style.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED8D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"1.3.12.D.5","text":"Identify the styles and artistic processes used in the creation of culturally and historically diverse two- and three-dimensional artworks, and emulate those styles by creating an original body of work."}]}]}]}]},{"leaf":false,"text":"1.4 Aesthetic Responses & Critique Methodologies: All students will demonstrate and apply an understanding of arts philosophies, judgment, and analysis to works of art in dance, music, theatre, and visual art.","children":[{"leaf":false,"text":"A. Aesthetic Responses","children":[{"leaf":false,"text":"NOTE: For those preschool programs that offer appropriate time and frequency of instruction, all students attain foundational skills that later lead to BASIC LITERACY in DANCE, MUSIC, THEATRE, and VISUAL ART.","children":[{"leaf":false,"text":"There is beauty in the everyday world and in works of art.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED55","dcterms_educationLevel":[{"prefLabel":"Pre-K"}],"asn_statementNotation":"1.4.P.A.1","text":"Begin to demonstrate appropriate audience skills during creative movement and dance performances."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED56","dcterms_educationLevel":[{"prefLabel":"Pre-K"}],"asn_statementNotation":"1.4.P.A.2","text":"Describe feelings and reactions in response to a creative movement/dance performance."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED57","dcterms_educationLevel":[{"prefLabel":"Pre-K"}],"asn_statementNotation":"1.4.P.A.3","text":"Begin to demonstrate appropriate audience skills during recordings and music performances."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED58","dcterms_educationLevel":[{"prefLabel":"Pre-K"}],"asn_statementNotation":"1.4.P.A.4","text":"Describe feelings and reactions in response to diverse musical genres and styles."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED59","dcterms_educationLevel":[{"prefLabel":"Pre-K"}],"asn_statementNotation":"1.4.P.A.5","text":"Begin to demonstrate appropriate audience skills during storytelling and performances."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED5A","dcterms_educationLevel":[{"prefLabel":"Pre-K"}],"asn_statementNotation":"1.4.P.A.6","text":"Describe feelings and reactions and respond in an increasingly informed manner to stories and dramatic performances."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED5B","dcterms_educationLevel":[{"prefLabel":"Pre-K"}],"asn_statementNotation":"1.4.P.A.7","text":"Describe feelings and reactions and make increasingly thoughtful observations in response to a variety of culturally diverse works of art and objects in the everyday world."}]}]},{"leaf":false,"text":"NOTE: By the end of grade 2, ALL students progress toward BASIC LITERACY in the following content knowledge and skills in DANCE, MUSIC, THEATRE, and VISUAL ART.","children":[{"leaf":false,"text":"Each arts discipline (dance, music, theatre, and visual art) has distinct characteristics, as do the artists who create them.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED5C","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"asn_statementNotation":"1.4.2.A.1","text":"Identify aesthetic qualities of exemplary works of art in dance, music, theatre, and visual art, and identify characteristics of the artists who created them (e.g., gender, age, absence or presence of training, style, etc.)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED5D","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"asn_statementNotation":"1.4.2.A.2","text":"Compare and contrast culturally and historically diverse works of dance, music, theatre, and visual art that evoke emotion and that communicate cultural meaning."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED5E","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"asn_statementNotation":"1.4.2.A.3","text":"Use imagination to create a story based on an arts experience that communicated an emotion or feeling, and tell the story through each of the four arts disciplines (dance, music, theatre, and visual art)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED5F","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"asn_statementNotation":"1.4.2.A.4","text":"Distinguish patterns in nature found in works of dance, music, theatre, and visual art."}]}]},{"leaf":false,"text":"NOTE: By the end of grade 5, ALL students demonstrate BASIC LITERACY in the following content knowledge and skills in DANCE, MUSIC, THEATRE, and VISUAL ART.","children":[{"leaf":false,"text":"Works of art may be organized according to their functions and artistic purposes (e.g., genres, mediums, messages, themes).","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED60","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"asn_statementNotation":"1.4.5.A.1","text":"Employ basic, discipline-specific arts terminology to categorize works of dance, music, theatre, and visual art according to established classifications."}]},{"leaf":false,"text":"Formalism in dance, music, theatre, and visual art varies according to personal, cultural, and historical contexts.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED61","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"asn_statementNotation":"1.4.5.A.2","text":"Make informed aesthetic responses to artworks based on structural arrangement and personal, cultural, and historical points of view."}]},{"leaf":false,"text":"Criteria for determining the aesthetic merits of artwork vary according to context. Understanding the relationship between compositional design and genre provides the foundation for making value judgments about the arts.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED62","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"asn_statementNotation":"1.4.5.A.3","text":"Demonstrate how art communicates ideas about personal and social values and is inspired by an individual's imagination and frame of reference (e.g., personal, social, political, historical context)."}]}]},{"leaf":false,"text":"NOTE: By the end of grade 8, all students demonstrate COMPETENCY in the following content knowledge and skills for their required area of specialization in DANCE, MUSIC, THEATRE, or VISUAL ART.","children":[{"leaf":false,"text":"Contextual clues to artistic intent are embedded in artworks. Analysis of archetypal or consummate works of art requires knowledge and understanding of culturally specific art within historical contexts.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED63","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"asn_statementNotation":"1.4.8.A.1","text":"Generate observational and emotional responses to diverse culturally and historically specific works of dance, music, theatre, and visual art."}]},{"leaf":false,"text":"Art may be used for utilitarian and non-utilitarian purposes.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED64","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"asn_statementNotation":"1.4.8.A.2","text":"Identify works of dance, music, theatre, and visual art that are used for utilitarian and non-utilitarian purposes."}]},{"leaf":false,"text":"Performance technique in dance, music, theatre, and visual art varies according to historical era and genre.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED65","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"asn_statementNotation":"1.4.8.A.3","text":"Distinguish among artistic styles, trends, and movements in dance, music, theatre, and visual art within diverse cultures and historical eras."}]},{"leaf":false,"text":"Abstract ideas may be expressed in works of dance, music, theatre, and visual art using a genre's stylistic traits.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED66","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"asn_statementNotation":"1.4.8.A.4","text":"Compare and contrast changes in the accepted meanings of known artworks over time, given shifts in societal norms, beliefs, or values."}]},{"leaf":false,"text":"Symbolism and metaphor are characteristics of art and art-making.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED67","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"asn_statementNotation":"1.4.8.A.5","text":"Interpret symbolism and metaphors embedded in works of dance, music, theatre, and visual art."}]},{"leaf":false,"text":"Awareness of basic elements of style and design in dance, music, theatre, and visual art inform the creation of criteria for judging originality.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED68","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"asn_statementNotation":"1.4.8.A.6","text":"Differentiate between \"traditional\" works of art and those that do not use conventional elements of style to express new ideas."}]},{"leaf":false,"text":"Artwork may be both  utilitarian and non-utilitarian. Relative merits of works of art can be assessed through analysis of form, function, craftsmanship, and originality.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED69","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"asn_statementNotation":"1.4.8.A.7","text":"Analyze the form, function, craftsmanship, and originality of representative works of dance, music, theatre, and visual art."}]}]},{"leaf":false,"text":"NOTE: By the end of grade 12, all students demonstrate PROFICIENCY in the following content knowledge and skills for their required area of specialization in DANCE, MUSIC, THEATRE, or VISUAL ART.","children":[{"leaf":false,"text":"Recognition of fundamental elements within various arts disciplines (dance, music, theatre, and visual art) is dependent on the ability to decipher cultural implications embedded in artworks.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED6A","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"1.4.12.A.1","text":"Use contextual clues to differentiate between unique and common properties and to discern the cultural implications of works of dance, music, theatre, and visual art."}]},{"leaf":false,"text":"Contextual clues within artworks often reveal artistic intent, enabling the viewer to hypothesize the artist's concept.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED6B","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"1.4.12.A.2","text":"Speculate on the artist's intent, using discipline-specific arts terminology and citing embedded clues to substantiate the hypothesis."}]},{"leaf":false,"text":"Artistic styles, trends, movements, and historical responses to various genres of art evolve over time.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED6C","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"1.4.12.A.3","text":"Develop informed personal responses to an assortment of artworks across the four arts disciplines (dance, music, theatre, and visual art), using historical significance, craftsmanship, cultural context, and originality as criteria for assigning value to the works."}]},{"leaf":false,"text":"Criteria for assessing the historical significance, craftsmanship, cultural context, and originality of art are often expressed in qualitative, discipline-specific arts terminology.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED6D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"1.4.12.A.4","text":"Evaluate how exposure to various cultures influences individual, emotional, intellectual, and kinesthetic responses to artwork."}]}]}]},{"leaf":false,"text":"B. Critique Methodologies","children":[{"leaf":false,"text":"NOTE: By the end of grade 2, ALL students progress toward BASIC LITERACY in the following content knowledge and skills in DANCE, MUSIC, THEATRE, and VISUAL ART.","children":[{"leaf":false,"text":"Relative merits of works of art can be qualitatively and quantitatively assessed using observable criteria.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED47","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"asn_statementNotation":"1.4.2.B.1","text":"Observe the basic arts elements in performances and exhibitions and use them to formulate objective assessments of artworks in dance, music, theatre, and visual art."}]},{"leaf":false,"text":"Constructive criticism is an important evaluative tool that enables artists to communicate more effectively.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED48","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"asn_statementNotation":"1.4.2.B.2","text":"Apply the principles of positive critique in giving and receiving responses to performances."}]},{"leaf":false,"text":"Contextual clues are embedded in works of art and provide insight into artistic intent.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED49","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"asn_statementNotation":"1.4.2.B.3","text":"Recognize the main subject or theme in works of dance, music, theatre, and visual art."}]}]},{"leaf":false,"text":"NOTE: By the end of grade 5, ALL students demonstrate BASIC LITERACY in the following content knowledge and skills in DANCE, MUSIC, THEATRE, and VISUAL ART.","children":[{"leaf":false,"text":"Identifying criteria for evaluating performances results in deeper understanding of art and art-making.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED4A","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"asn_statementNotation":"1.4.5.B.1","text":"Assess the application of the elements of art and principles of design in dance, music, theatre, and visual artworks using observable, objective criteria."}]},{"leaf":false,"text":"Decoding simple contextual clues requires evaluation mechanisms, such as rubrics, to sort fact from opinion.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED4B","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"asn_statementNotation":"1.4.5.B.2","text":"Use evaluative tools, such as rubrics, for self-assessment and to appraise the objectivity of critiques by peers."}]},{"leaf":false,"text":"While there is shared vocabulary among the four arts disciplines of dance, music, theatre, and visual art, each also has its own discipline-specific arts terminology.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED4C","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"asn_statementNotation":"1.4.5.B.3","text":"Use discipline-specific arts terminology to evaluate the strengths and weaknesses of works of dance, music, theatre, and visual art."}]},{"leaf":false,"text":"Levels of proficiency can be assessed through analyses of how artists apply the elements of art and principles of design.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED4D","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"asn_statementNotation":"1.4.5.B.4","text":"Define technical proficiency, using the elements of the arts and principles of design."}]},{"leaf":false,"text":"Artists and audiences can and do disagree about the relative merits of artwork. When assessing works of dance, music, theatre and visual art, it is important to consider the context for the creation and performance of the work (e.g., Who was the creator? What purpose does the artwork serve? Who is the intended audience?).","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED4E","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"asn_statementNotation":"1.4.5.B.5","text":"Distinguish ways in which individuals may disagree about the relative merits and effectiveness of artistic choices in the creation and performance of works of dance, music, theatre, and visual art."}]}]},{"leaf":false,"text":"NOTE: By the end of grade 8, all students demonstrate COMPETENCY in the following content knowledge and skills for their required area of specialization in DANCE, MUSIC, THEATRE, or VISUAL ART.","children":[{"leaf":false,"text":"Assessing a work of art without critiquing the artist requires objectivity and an understanding of the work's content and form.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED4F","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"asn_statementNotation":"1.4.8.B.1","text":"Evaluate the effectiveness of a work of art by differentiating between the artist's technical proficiency and the work's content or form."}]},{"leaf":false,"text":"Visual fluency is the ability to differentiate formal and informal structures and objectively apply observable criteria to the assessment of artworks, without consideration of the artist.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED50","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"asn_statementNotation":"1.4.8.B.2","text":"Differentiate among basic formal structures and technical proficiency of artists in works of dance, music, theatre, and visual art."}]},{"leaf":false,"text":"Universal elements of art and principles of design apply equally to artwork across cultures and historical eras.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED51","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"asn_statementNotation":"1.4.8.B.3","text":"Compare and contrast examples of archetypal subject matter in works of art from diverse cultural contexts and historical eras by writing critical essays."}]}]},{"leaf":false,"text":"NOTE: By the end of grade 8, all students demonstrate PROFICIENCY in the following content knowledge and skills for their required area of specialization in DANCE, MUSIC, THEATRE, or VISUAL ART.","children":[{"leaf":false,"text":"Archetypal subject matter exists in all cultures and is embodied in the formal and informal aspects of art.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED52","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"1.4.12.B.1","text":"Formulate criteria for arts evaluation using the principles of positive critique and observation of the elements of art and principles of design, and use the criteria to evaluate works of dance, music, theatre, visual, and multimedia artwork from diverse cultural contexts and historical eras."}]},{"leaf":false,"text":"The cohesiveness of a work of art and its ability to communicate a theme or narrative can be directly affected by the artist's technical proficiency as well as by the manner and physical context in which it is performed or shown.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED53","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"1.4.12.B.2","text":"Evaluate how an artist's technical proficiency may affect the creation or presentation of a work of art, as well as how the context in which a work is performed or shown may impact perceptions of its significance/meaning."}]},{"leaf":false,"text":"Art and art-making reflect and affect the role of technology in a global society.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113ED54","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"1.4.12.B.3","text":"Determine the role of art and art-making in a global society by analyzing the influence of technology on the visual, performing, and multimedia arts for consumers, creators, and performers around the world."}]}]}]}]}]