[{"leaf":false,"text":"Word Recognition, Fluency and Vocabulary Development","children":[{"leaf":false,"text":"Phonemic Awareness","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E5C","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"Recognize and name capital and lowercase letters of the alphabet. Distinguish sounds (phonemes) in orally stated words and manipulate and blend sounds to make new words (including rhyming words).<br /><br /> [Standard Indicators: K.1.5, K.1.6, K.1.7, K.1.8, K.1.9, K.1.10, K.1.11, K.1.14, K.1.18]"}]},{"leaf":false,"text":"Word Recognition","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E5D","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"Discriminate among the features of written English, including letters, words and sentences, and read using understanding of conventions for direction (i.e., left to right and top to bottom).<br /><br /> [Standard Indicators: K.1.2, K.1.3, K.1.4, K.1.5, K.1.12, K.1.15, K.1.17]"}]},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E5E","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"Use phonemic awareness skills (e.g., blending, manipulating, and deleting sounds) and basic phonics knowledge (e.g., the spelling of common sound/symbol relationships, word patterns, inflectional endings, digraphs, blends) to aid in decoding and comprehension. Read common sight words.<br /><br /> [Standard Indicators: 1.1.4, 1.1.5, 1.1.6, 1.1.8, 1.1.9, 1.1.10, 1.1.11, 1.1.12, 1.1.13, 1.1.14, 1.1.15]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E5F","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"Use features of words (e.g., common word parts, sound/symbol relationships, spelling patterns) to decode unknown words. Identify common synonyms, antonyms and compound words. Read aloud grade-level-appropriate literary and informational texts with appropriate changes in voice and expression.<br /><br /> [Standard Indicators: 2.1.1, 2.1.2, 2.1.3, 2.1.5, 2.1.6, 2.1.7, 2.1.8, 2.1.11]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E60","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"Use knowledge of common word families, word parts, synonyms and antonyms, context, glossaries, and dictionaries to aid in word comprehension. Read aloud grade-level-appropriate literary and informational texts with appropriate timing and change in voice.<br /><br /> [Standard Indicators: 3.1.1, 3.1.2, 3.1.3, 3.1.4, 3.1.6, 3.1.7, 3.1.8]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E61","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"Use knowledge of root words, context clues, glossaries and dictionaries to determine the meaning of unfamiliar words. Explain the meanings of common idioms and expressions. Read aloud grade-level-appropriate literary and informational texts with appropriate timing and expression.<br /><br /> [Standard Indicators: 4.1.1, 4.1.2, 4.1.3, 4.1.4, 4.1.6, 4.1.7]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E62","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"Use context clues, knowledge of root words and word parts, and dictionaries and glossaries to analyze the meaning of complex words. Explain the meaning and significance of words used in similes and metaphors. Read aloud grade-level-appropriate literary and informational texts with appropriate timing and expression.<br /><br /> [Standard Indicators: 5.1.1, 5.1.4, 5.1.5, 5.1.6]"}]},{"leaf":false,"text":"Vocabulary and Concept Development","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E53","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"Use knowledge of word and context clues to determine the meaning of words in informational and literary texts. Compare and contrast the meanings of closely related words.<br /><br /> [Standard Indicators: 6.1.2, 6.1.4, 6.1.5]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E54","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"Identify and use a variety of types of context clues (e.g., restatement, definition) to determine the meanings of words within particular texts. Use knowledge of Greek, Latin and Anglo-Saxon roots and word parts to understand subject-area vocabulary.<br /><br /> [Standard Indicators: 7.1.2, 7.1.3]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E55","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"Identify the difference between the literal and figurative meanings of words given the context in which they occur. Make connections between the history and etymology of words and their present meanings.<br /><br /> [Standard Indicators: 8.1.1, 8.1.2]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E56","dcterms_educationLevel":[{"prefLabel":"9"}],"text":"Discuss and explain the literal and figurative meanings, nuances, and implications of specific words in and from different genres and contexts.<br /><br /> [Standard Indicators: 9.1.1, 9.1.2, 9.1.3, 9.5.7]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E57","dcterms_educationLevel":[{"prefLabel":"10"}],"text":"Discover and explain the meanings of words from different fields and traditions. Explain the implications and figurative meanings of words in context and correctly use figurative language.<br /><br /> [Standard Indicators: 10.1.1, 10.1.2, 10.1.3, 10.1.4, 10.5.7]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E58","dcterms_educationLevel":[{"prefLabel":"11"}],"text":"Correctly use varied and precise words when analyzing, explaining or creating informational and literary text, descriptions, analogies, or other types of figurative language.<br /><br /> [Standard Indicators: 11.1.1, 11.1.2, 11.1.3, 11.4.6, 11.5.6]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E59","dcterms_educationLevel":[{"prefLabel":"12"}],"text":"Use varied and precise words when analyzing, explaining or creating informational and literary text, descriptions, analogies or other types of figurative language. Use transitional words, appropriate context clues, and specialized vocabulary from different subject areas.<br /><br /> [Standard Indicators: 12.1.1, 12.1.2, 12.1.3, 12.4.6, 12.5.6]"}]},{"leaf":false,"text":"Informational Text: Structure, Comprehension and Analysis","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E63","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"Find the title and author of a text. Use pictures and text to draw conclusions and answer who, what and where questions.<br /><br /> [Standard Indicators: K.1.20, K.1.22, K.2.1, K.2.2, K.2.3]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E64","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"Find the title, author and table of contents of a text. Identify the main idea and answer who, what, when, where, why and how questions with information from the text.<br /><br /> [Standard Indicators: 1.2.1, 1.2.3, 1.2.5, 1.2.7]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E65","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"Use titles, tables of contents, and chapter headings to identify central ideas or topics. Make cause/effect connections and identify common words that indicate when events happened in a sequence (e.g., first, next, last). Ask and respond to questions to aid comprehension.<br /><br /> [Standard Indicators: 2.2.1, 2.2.2, 2.2.4, 2.2.5, 2.2.6, 2.2.10, 2.2.11]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E66","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"Use the features and organization of informational text (e.g., titles, tables of contents, chapter headings, sequences of events, indices) to find basic facts, main ideas, and supporting details. Summarize the main idea and supporting details. Use details from the text to support conclusions.<br /><br /> [Standard Indicators: 3.2.1, 3.2.3, 3.2.4, 3.2.5, 3.2.6]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E67","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"Identify different types of organization of informational texts (e.g., sequential order, compare/contrast, cause/effect) and use them to find and show (e.g., with a graphic organizer, with an outline) the relationship of main ideas and important details presented in the texts. Draw logical conclusions based upon what was read.<br /><br /> [Standard Indicators: 4.2.1, 4.2.3, 4.2.8, 4.2.9]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E68","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"Use the features and organization of informational texts (e.g., diagrams, charts, graphs, illustrations, maps, sidebars, timelines, chapter headings, cause/effect patterns) to aid in understanding the text. Explain how the author uses these to highlight the main idea and supporting points of the text.<br /><br /> [Standard Indicators: 5.2.1, 5.2.3]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E69","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"Compare and contrast the organization and structural features of different types of informational text, including media and online sources. Identify main points and supporting evidence in outlines, summaries and reports that follow a clear organizational pattern.<br /><br /> [Standard Indicators: 6.2.1, 6.2.2, 6.2.4, 6.2.7, 6.4.3, 6.4.6]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E6A","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"Compare and contrast the purposes and features of different types of informational texts. Identify and use the most complete, accurate and appropriate sources for particular purposes. Identify, chart and explain cause/effect connections, including those that are not explicitly stated within the text.<br /><br /> [Standard Indicators: 7.2.1, 7.2.2, 7.2.3, 7.2.4, 7.2.7, 7.2.9]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E6B","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"Analyze different informational documents serving the same purpose to determine the strengths of each (in coherence of structure, development and accuracy of ideas, extent of information) and to find which best fulfill their function.<br /><br /> [Standard Indicators: 8.2.1, 8.2.2, 8.2.3, 8.2.6, 8.2.7, 8.2.9]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E6C","dcterms_educationLevel":[{"prefLabel":"9"}],"text":"Analyze the structure, design and logic of different types of informational documents and texts to determine how well the organization and particular features serve the audience and purpose. Summarize and synthesize the content from several informational documents to demonstrate comprehension of the topic.<br /><br /> [Standard Indicators: 9.2.1, 9.2.4, 9.2.5, 9.2.6, 9.2.7, 9.2.8]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E6D","dcterms_educationLevel":[{"prefLabel":"10"}],"text":"Analyze arguments or defenses of claims, judging which sources are the most reliable. Describe how the author's purpose affects the structure, tone, features and arguments of each. Summarize and synthesize content from reliable sources for writing and speaking.<br /><br /> [Standard Indicators: 10.2.1, 10.2.2, 10.2.4, 10.2.5]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E6E","dcterms_educationLevel":[{"prefLabel":"11"}],"text":"Analyze authors' approaches to positions (e.g., organization and transitions, diction and tone, features, and rhetorical devices), and explain how these affect the presentation of the information. Critique the logic, truthfulness, validity and effectiveness of informational text. Synthesize content from reliable sources for writing and speaking.<br /><br /> [Standard Indicators: 11.2.1, 11.2.2, 11.2.3, 11.2.4, 11.2.5, 11.2.6]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E6F","dcterms_educationLevel":[{"prefLabel":"12"}],"text":"Analyze authors' implicit and explicit assumptions and beliefs, and critique the logic, truthfulness, validity and effectiveness of their presentation of information. Synthesize content from reliable sources for writing and speaking.<br /><br /> [Standard Indicators: 12.2.1, 12.2.2, 12.2.3, 12.2.4, 12.2.5, 12.2.6]"}]},{"leaf":false,"text":"Literary Text: Comprehension and Analysis","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E70","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"Retell familiar stories correctly using vocabulary words and story elements (e.g., setting, characters, main events). Distinguish fantasy from reality.<br /><br /> [Standard Indicators: K.1.22, K.3.1, K.3.2, K.3.3, K.3.5]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E71","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"Identify and describe the plot (e.g., beginning, middle and end), setting and characters of a story. Make and confirm predictions about what will happen next in a story.<br /><br /> [Standard Indicators: 1.3.1, 1.3.3, 1.3.5]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E72","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"Compare different stories and poems, including the meaning or lesson of each text.<br /><br /> [Standard Indicators: 2.3.1, 2.3.3, 2.3.7]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E73","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"Identify and describe the speaker or narrator, main characters, main ideas, and main events in literary texts. Discuss the meanings or lessons of each text. Explain the differences among poems, plays and stories.<br /><br /> [Standard Indicators: 3.3.1, 3.3.2, 3.3.3, 3.3.4, 3.3.6, 3.3.8]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E74","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"Describe the causes and effects of characters' actions within different kinds (genres) of literary texts, using parts of the text to identify a sequence of events, character traits and motivations, and to support conclusions. Explain how this information is related to the main theme of the text.<br /><br /> [Standard Indicators: 4.3.2, 4.3.3, 4.3.6, 4.3.7]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E75","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"Explain how conflicts and character descriptions in specific literary texts support the theme, main ideas, and meaning. Explain how the form of a text contributes to the meaning.<br /><br /> [Standard Indicators: 5.3.1, 5.3.2, 5.3.3, 5.3.4, 5.3.7]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E76","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"Analyze how word choice and figurative language create tone and meaning in literary texts, using evidence from the text to support conclusions. Describe types and purposes of literary devices, find examples of each in texts, and interpret them within their contexts.<br /><br /> [Standard Indicators: 6.3.3, 6.3.4, 6.3.6, 6.3.7, 6.3.9]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E77","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"Analyze and describe the connection of setting, narrative voice, language, mood, and tone to the plot and meaning of literary works of different lengths (e.g., short story, essay, novella, novel) within American, British, and world literature. Compare reviews of literary works, identifying the main points of each.<br /><br /> [Standard Indicators: 7.3.1, 7.3.2, 7.3.3, 7.3.4, 7.3.5, 7.3.6, 7.3.7, 7.3.8, 7.3.9]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E78","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"Describe the characteristics of different forms of poetry and the structural elements of fiction. Chart and analyze the overall structure of plots (including subplots and parallel episodes) within literary texts and connect to the mood, devices, themes, language and ideas within the texts. Discuss the historical context of different works (including those within American, British and world literature).<br /><br /> [Standard Indicators: 8.3.1, 8.3.2, 8.3.5, 8.3.7]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E79","dcterms_educationLevel":[{"prefLabel":"9"}],"text":"Compare and contrast the views, language, and treatments of themes found in literary works of different genres. Describe the characteristics and contributions of major literary movements from specific time periods and places (including those within American, British, and world literature).<br /><br /> [Standard Indicators: 9.3.1, 9.3.2, 9.3.3, 9.3.4, 9.3.5, 9.3.6, 9.3.7, 9.3.8, 9.3.9, 9.3.10, 9.3.11, 9.3.12, 9.3.13]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E7A","dcterms_educationLevel":[{"prefLabel":"10"}],"text":"Identify the purposes and characteristics of different subgenres of literature. Analyze the author's use of different types of characterization, universal themes, narrative voice, and sequence of events to communicate the mood and meaning of the work. Use evidence from the text to support conclusions. Describe the characteristics and contributions of major literary movements from specific time periods and places (including those belonging to American, British and world literature).<br /><br /> [Standard Indicators: 10.3.1, 10.3.2, 10.3.3, 10.3.4, 10.3.5, 10.3.6, 10.3.7, 10.3.8, 10.3.9, 10.3.10, 10.3.11, 10.3.12, 10.3.13]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E7B","dcterms_educationLevel":[{"prefLabel":"11"}],"text":"Identify and discuss the philosophical arguments and historical background associated with specific issues presented in texts of literary or cultural significance from different genres and subgenres including literary movements within America, Britain and other places in the world. Evaluate how the author's treatment of the subject (including the use of characterization) helps to support a position or claim.<br /><br /> [Standard Indicators: 11.3.1, 11.3.2, 11.3.3, 11.3.4, 11.3.5, 11.3.6, 11.3.7, 11.3.8]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E7C","dcterms_educationLevel":[{"prefLabel":"12"}],"text":"Compare and contrast different forms, elements, techniques, ideas and issues within literature from various historical periods and literary movements from America, Britain and other places in the world, with reference to specific authors, perspectives, ideas, influences and works.<br /><br /> [Standard Indicators: 12.3.1, 12.3.2, 12.3.3, 12.3.4, 12.3.5, 12.3.6, 12.3.7, 12.3.8, 12.3.9, 12.3.10]"}]},{"leaf":false,"text":"Writing: Informational, Research and Persuasive Texts","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E8A","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"Ask how and why questions about a topic of interest. Gather information from different sources. Demonstrate that writing has meaning by using pictures, letters and words (phonetically spelled or conventionally spelled) to convey ideas. Write for a specific audience and purpose.<br /><br /> [Standard Indicators: K.4.3, K.4.4, K.4.5, K.4.6, K.4.7, K.4.8, K.5.1, K.5.2, K.6.2]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E8B","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"Discuss ideas and select a focus for writing, asking questions to guide topic selection. Put related information from different sources together for writing. Write for different audiences and purposes, using descriptive words to convey a central idea. Revise writing for others to read.<br /><br /> [Standard Indicators: 1.4.1, 1.4.3, 1.4.4, 1.4.5, 1.4.6, 1.5.4, 1.5.5, 1.6.2]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E8C","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"Create a list of ideas for writing. Write brief pieces and reports that focus on one topic and contain relevant details with related ideas grouped together. Include information from several different types of sources in reports. Use appropriate word choice to address the intended audience. Review writing, improving clarity of words and ideas.<br /><br /> [Standard Indicators: 2.4.1, 2.4.2, 2.4.4, 2.4.6, 2.5.6, 2.5.8]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E8D","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"Keep a list of ideas for writing and use graphic organizers to create a topic sentence and ideas for details. Write informational and persuasive pieces that contain appropriate word choices for the purpose and the intended audience. Include relevant information from a variety of resources as well as paragraphs with supporting details. Revise writing, improving clarity and organization.<br /><br /> [Standard Indicators: 3.4.1, 3.4.2, 3.4.3, 3.4.6, 3.4.8, 3.4.9, 3.5.5, 3.5.6, 3.5.8]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E8E","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"Use a notebook of ideas and graphic organizers to plan writing. Write pieces with multiple paragraphs that follow an appropriate structure and display knowledge of purpose, audience and format. Within reports, refer to and cite relevant ideas and details from a variety of sources. Revise writing, improving clarity and organization.<br /><br /> [Standard Indicators: 4.2.9, 4.4.1, 4.4.2, 4.4.3, 4.4.4, 4.4.5, 4.4.6, 4.4.7, 4.4.8, 4.5.2, 4.5.3]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E8F","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"Use a notebook of ideas and graphic organizers to develop questions for research and writing. Choose and develop the most appropriate organizational structure and language for the purpose and audience. Use reading and note-taking skills to find and summarize relevant information from sources to be cited. Write pieces with multiple paragraphs that have a topic sentence and supporting evidence leading to logical conclusions. Revise writing, improving clarity and organization.<br /><br /> [Standard Indicators: 5.2.3, 5.2.4, 5.2.5, 5.4.1, 5.4.3, 5.4.5, 5.4.11, 5.5.2, 5.5.3, 5.5.4]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E90","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"Use a variety of strategies to develop ideas for topic sentences for research and determine the purpose, audience and appropriate organization for each piece of writing. Use reading and note-taking skills to find and summarize relevant information from sources to be interpreted and/or cited. Include a topic sentence and multiple paragraphs with supporting evidence leading to logical conclusions. Revise writing, improving clarity and organization. Edit writing, correctly crediting all ideas and wording from sources.<br /><br /> [Standard Indicators: 6.2.3, 6.2.4, 6.4.1, 6.4.2, 6.4.3, 6.4.4, 6.4.5, 6.4.8, 6.4.9, 6.4.10, 6.5.2, 6.5.3, 6.5.4, 6.5.5, 6.5.6, 6.5.7, 6.5.8]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E91","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"Use a variety of strategies to develop topic sentences. Determine the purpose, audience and organization for the piece of writing. Use reading and note-taking skills to find and summarize relevant information from sources selected for accuracy, appropriateness and reliability. Write pieces with a well-defined thesis and a variety of types of supporting evidence leading to logical conclusions. Revise writing, improving clarity and organization. Edit writing, correctly crediting all ideas and wording from sources.<br /><br /> [Standard Indicators: 7.2.4, 7.2.6, 7.2.7, 7.2.8, 7.4.1, 7.4.2, 7.4.3, 7.4.4, 7.4.5, 7.4.6, 7.4.8, 7.4.9, 7.4.10, 7.5.2, 7.5.3, 7.5.5, 7.5.6, 7.5.7]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E92","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"Use a variety of strategies to develop topics, and display knowledge of how to organize pieces for different purposes, topics and audiences. Use notetaking skills to summarize relevant information from carefully evaluated paper and online sources. Write pieces with a well-defined thesis, a balance of original ideas and evidence, and a clear and well-supported conclusion. Revise writing, improving clarity and organization. Edit writing, correctly crediting all ideas and wording from sources.<br /><br /> [Standard Indicators: 8.2.6, 8.2.9, 8.4.1, 8.4.2, 8.4.3, 8.4.4, 8.4.5, 8.4.7, 8.4.8, 8.4.9, 8.4.10, 8.4.11, 8.5.2, 8.5.3, 8.5.6, 8.5.7, 8.7.12]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E93","dcterms_educationLevel":[{"prefLabel":"9"}],"text":"Use a variety of strategies to develop topics and display knowledge of how to organize pieces for different purposes, topics and audiences. Synthesize relevant information from carefully evaluated paper and online sources. Write pieces with a well-defined thesis, supporting evidence that is integrated without disturbing the flow of ideas, and a clear and well-supported conclusion. Revise writing, improving clarity and organization. Edit writing, correctly crediting all ideas and wording from sources.<br /><br /> [Standard Indicators: 9.2.2, 9.2.3, 9.2.7, 9.4.1, 9.4.2, 9.4.3, 9.4.4, 9.4.5, 9.4.6, 9.4.7, 9.4.8, 9.4.9, 9.4.10, 9.4.11, 9.4.12, 9.4.13, 9.5.2, 9.5.3, 9.5.4, 9.5.7, 9.5.8, 9.5.9]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E94","dcterms_educationLevel":[{"prefLabel":"10"}],"text":"Use a variety of strategies to develop topics and display knowledge of how to organize pieces for different purposes, topics, and audiences. Synthesize relevant information from carefully evaluated sources. Write pieces with a well-defined thesis, supporting evidence that is presented creatively, coherently and convincingly, and a clear and well-supported conclusion. Revise writing, improving organization, word choice, and clarity. Edit writing, correctly crediting all ideas and wording from sources.<br /><br /> [Standard Indicators: 10.2.1, 10.2.2, 10.2.4, 10.2.5, 10.4.1, 10.4.2, 10.4.3, 10.4.4, 10.4.5, 10.4.6, 10.4.7, 10.4.8, 10.4.9, 10.4.10, 10.4.11, 10.4.12, 10.4.13, 10.5.2, 10.5.3, 10.5.4, 10.5.7, 10.5.8, 10.5.9]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E95","dcterms_educationLevel":[{"prefLabel":"11"}],"text":"Use a variety of strategies to develop topics and display knowledge of how to organize pieces for different purposes, topics and audiences. Synthesize relevant information from carefully evaluated primary and/or secondary sources. Write pieces with a well-defined thesis, supporting evidence that is presented creatively, coherently and convincingly, and a clear and well-supported conclusion. Anticipate and answer possible counterarguments. Revise writing, improving organization, word choice, and clarity. Edit writing, correctly crediting all ideas and wording from sources.<br /><br /> [Standard Indicators: 11.2.3, 11.2.4, 11.2.5, 11.2.6, 11.4.1, 11.4.2, 11.4.4, 11.4.5, 11.4.6, 11.4.7, 11.4.8, 11.4.9, 11.4.10, 11.4.11, 11.4.12, 11.4.13, 11.5.2, 11.5.4, 11.5.6, 11.5.7, 11.5.8, 11.5.9, 11.5.10]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E96","dcterms_educationLevel":[{"prefLabel":"12"}],"text":"Use a variety of strategies to develop topics and display knowledge of how to organize pieces for different purposes, topics and audiences. Synthesize relevant information from primary and/or secondary sources. Write pieces with a well-defined thesis, clear and convincing supporting evidence, appropriate transitions from one paragraph to another, and a clear and well-supported conclusion. Extend ideas to provide suggestions for further discussion and research. Revise writing, improving organization, word choice, voice and clarity. Edit writing, correctly crediting all ideas and wording from sources.<br /><br /> [Standard Indicators: 12.2.3, 12.2.4, 12.2.5, 12.2.6, 12.4.1, 12.4.2, 12.4.4, 12.4.5, 12.4.6, 12.4.7, 12.4.8, 12.4.9, 12.4.13, 12.5.2, 12.5.4, 12.5.6, 12.5.7, 12.5.8, 12.5.9, 12.5.10]"}]},{"leaf":false,"text":"Writing: Literary Text","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E98","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"Discuss ideas to include in a story. Dictate a story to someone else. Demonstrate that writing has meaning by using pictures, letters and words (phonetically spelled or conventionally spelled) to convey ideas.<br /><br /> [Standard Indicators: K.4.1, K.4.2, K.4.3, K.4.4, K.6.2]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E99","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"Discuss ideas for writing. Write brief narratives and descriptions, using varied words to convey a central idea. Revise writing for others to read.<br /><br /> [Standard Indicators: 1.4.1, 1.4.3, 1.5.1, 1.5.2, 1.5.4, 1.5.5]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E9B","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"Create a list of ideas for writing. Write brief narratives, poems and descriptions that follow a recognizable sequence and contain descriptive details. Revise writing to improve sequence, to add descriptive detail, and to make language clearer.<br /><br /> [Standard Indicators: 2.4.1, 2.4.2, 2.4.6, 2.4.8, 2.5.1, 2.5.2, 2.5.4, 2.5.5, 2.5.6]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E9D","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"Use a list of ideas to plan writing. Write narrative and descriptive pieces that include important literary elements (e.g., plot or sequence of events, characters, setting, main idea) and contain varied word choices. Revise writing for meaning and clarity.<br /><br /> [Standard Indicators: 3.3.8, 3.4.1, 3.4.2, 3.4.6, 3.5.1, 3.5.2, 3.5.4, 3.5.5]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E9F","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"Keep a notebook of ideas to use in planning writing. Write narrative and descriptive pieces that provide a well-developed setting and sequence of events, and that incorporate ideas and observations. Revise writing for meaning and clarity, including moving sentences to improve the progression of ideas.<br /><br /> [Standard Indicators: 4.3.2, 4.4.1, 4.4.2, 4.4.10, 4.4.12, 4.5.1, 4.5.5, 4.5.6]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133EA1","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"Use graphic organizers and a list or notebook of ideas to plan writing. Write narratives that contain a beginning, middle and end (e.g., a main conflict and resolution) and which show, with descriptive details and action, rather than tell the events of the story. Revise writing for clarity, organization and meaning.<br /><br /> [Standard Indicators: 5.3.2, 5.4.1, 5.4.2, 5.4.8, 5.4.9, 5.4.10, 5.5.1, 5.5.5, 5.5.6]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133EA3","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"Use graphic organizers and a list or notebook of ideas to plan writing. Choose a literary form (e.g., story, poem) that best suits the purpose. Include a developed plot or main idea, sensory details, varied word choices, and character development. Revise writing for clarity, organization and meaning. Proofread and edit writing.<br /><br /> [Standard Indicators: 6.3.1, 6.3.8, 6.3.9, 6.4.1, 6.4.2, 6.4.8, 6.4.9, 6.4.10, 6.5.1, 6.5.6, 6.5.7]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133EA5","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"Use graphic organizers, a list or notebook of ideas, and various strategies to plan writing. Write biographical and literary texts that contain conflicts and resolutions, major and minor characters, meaningful settings, and/or expressive language. Display a command of basic narrative strategies (e.g., timing, dialogue, detailed description) to advance the plot and develop characters. Review, revise and edit writing.<br /><br /> [Standard Indicators: 7.3.3, 7.3.9, 7.4.1, 7.4.2, 7.4.8, 7.4.9, 7.4.10, 7.5.1, 7.5.6, 7.5.7]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133EA7","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"Use graphic organizers, a list or notebook of ideas, and various strategies to plan writing. Write biographical, descriptive, and literary text that is told from a distinct point of view, follows a clear organizational pattern, contains necessary elements of the chosen form (e.g., plot, setting, rhythm, rhyme), incorporates precise and varied vocabulary, and shows a command of basic literary devices (e.g., symbolism, alliteration, personification). Review, revise and edit writing.<br /><br /> [Standard Indicators: 8.3.2, 8.3.6, 8.3.8, 8.4.1, 8.4.2, 8.4.7, 8.4.8, 8.4.9, 8.4.10, 8.5.1, 8.5.6, 8.5.7]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133EA9","dcterms_educationLevel":[{"prefLabel":"9"}],"text":"Use a variety of strategies to plan writing. Write literary text of different genres that follows a clear organizational pattern; has an identifiable tone; contains varied and meaningful details for development of plot, character and setting within narrative pieces; and shows a command of basic literary devices. Review, revise and edit writing.<br /><br /> [Standard Indicators: 9.3.7, 9.3.9, 9.3.10, 9.3.11, 9.4.1, 9.4.3, 9.4.9, 9.4.10, 9.4.11, 9.4.12, 9.4.13, 9.5.1, 9.5.7, 9.5.8]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133EAB","dcterms_educationLevel":[{"prefLabel":"10"}],"text":"Use a variety of strategies to plan writing and choose an appropriate genre. Write literary text that has a clear and developed narrative voice or persona, contains varied and meaningful details, and shows a command of literary devices to structure the text and advance the plot, define character, and set the tone. Review, revise and edit writing.<br /><br /> [Standard Indicators: 10.3.3, 10.3.7, 10.3.9, 10.3.11, 10.4.1, 10.4.3, 10.4.9, 10.4.10, 10.4.11, 10.4.12, 10.4.13, 10.5.1, 10.5.7, 10.5.8]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133EAD","dcterms_educationLevel":[{"prefLabel":"11"}],"text":"Use a variety of strategies to plan writing and choose an appropriate genre. Write literary text that has a clear and developed narrative voice or persona, contains varied and meaningful details, and shows a command of literary devices to structure the text and advance the plot, define character, and/or set the tone. Explain the connection of the form and devices used to the purpose and audience for the piece. Review, revise and edit writing.<br /><br /> [Standard Indicators: 11.3.2, 11.3.3, 11.3.4, 11.4.1, 11.4.2, 11.4.3, 11.4.6, 11.4.9, 11.4.10, 11.4.11, 11.4.12, 11.5.1, 11.5.3, 11.5.6]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133EAF","dcterms_educationLevel":[{"prefLabel":"12"}],"text":"Use a variety of strategies to plan writing and choose an appropriate genre. Write literary text that has a clear and developed narrative voice or persona, contains varied and meaningful details, and shows a command of literary devices to structure the text and advance the plot, define character, and/or set the tone. Explain the connection of the form and devices used to the purpose and audience for the piece. Review, revise and edit writing.<br /><br /> [Standard Indicators: 12.3.2, 12.3.3, 12.3.4, 12.4.1, 12.4.2, 12.4.3, 12.4.6, 12.4.9, 12.4.10, 12.4.11, 12.4.12, 12.5.1, 12.5.3, 12.5.6]"}]},{"leaf":false,"text":"English Language Conventions","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E97","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"Write capital and lowercase letters of the alphabet, correctly shaping and spacing the letters. Spell independently using the sounds of letters of the alphabet.<br /><br /> [Standard Indicators: K.1.5, K.1.6, K.6.1, K.6.2]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E9A","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"Write complete simple sentences, using knowledge of spacing, plurals, contractions and end punctuation (i.e., periods, exclamation points, question marks). Capitalize the first words of sentences, names and the pronoun I.<br /><br /> [Standard Indicators: 1.6.1, 1.6.2, 1.6.3, 1.6.6, 1.6.7]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E9C","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"Write and identify nouns and verbs in complete sentences, including the correct use of commas and quotation marks, capitalization of proper nouns, and spelling of frequently used words that do not fit common spelling patterns (e.g., why, says, who).<br /><br /> [Standard Indicators: 2.6.1, 2.6.2, 2.6.3, 2.6.4, 2.6.5, 2.6.6, 2.6.7, 2.6.8]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E9E","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"Write sentences of a variety of types (e.g., statements, commands, questions, exclamations), displaying the correct use of verb tenses, pronouns, and correct spelling of contractions and plural forms.<br /><br /> [Standard Indicators: 3.6.2, 3.6.3, 3.6.4, 3.6.5, 3.6.8]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133EA0","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"Write simple and compound sentences, using descriptive words and different types of phrases for added interest. Use correct punctuation (e.g., parentheses, commas) and prepositions in phrases that add information.<br /><br /> [Standard Indicators: 4.6.2, 4.6.3, 4.6.5]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133EA2","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"Know and use words that connect ideas within sentences (e.g., however, therefore, and, but, or) and write and edit sentences so that the parts (e.g., phrases and clauses, modifiers) are clear and correct.<br /><br /> [Standard Indicators: 5.6.1, 5.6.2, 5.6.4, 5.6.8]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133EA4","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"Write sentences that show clear relationships between main and supporting ideas. Check and edit parts of sentences for correct subject/verb agreement with indefinite pronouns (e.g., each, all).<br /><br /> [Standard Indicators: 6.6.1, 6.6.2, 6.6.6]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133EA6","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"Write sentences and paragraphs that show clear relationships between main and supporting ideas. Edit parts of sentences to correct pronoun antecedents, punctuation, and verb tense agreement.<br /><br /> [Standard Indicators: 7.6.1, 7.6.2, 7.6.5, 7.6.6, 7.6.7, 7.6.10]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133EA8","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"Write paragraphs that display varied sentence constructions and clear and meaningful connections of ideas within sentences. Edit pieces of writing to correct spelling, grammar and punctuation.<br /><br /> [Standard Indicators: 8.6.1, 8.6.3, 8.6.4, 8.6.5, 8.6.6, 8.6.7]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133EAA","dcterms_educationLevel":[{"prefLabel":"9"}],"text":"Write paragraphs that display clear and meaningful connections between ideas, varied word choice, effective structures, and correct spelling, grammar and punctuation. Use appropriate manuscript form.<br /><br /> [Standard Indicators: 9.4.8, 9.6.1, 9.6.2, 9.6.3, 9.6.4]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133EAC","dcterms_educationLevel":[{"prefLabel":"10"}],"text":"Write paragraphs that display clear and meaningful connections between ideas; varied word choice and sentence structures; and correct spelling, grammar and punctuation. Use appropriate manuscript form.<br /><br /> [Standard Indicators: 10.4.8, 10.6.1, 10.6.2, 10.6.3, 10.6.4]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133EAE","dcterms_educationLevel":[{"prefLabel":"11"}],"text":"Write paragraphs that include a variety of sentence and paragraph constructions and that communicate ideas clearly and effectively. Edit writing to correct grammar, spelling and punctuation. Use appropriate manuscript conventions and integration of quotations and ideas from sources.<br /><br /> [Standard Indicators: 11.4.13, 11.6.1, 11.6.2, 11.6.3, 11.6.4]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133EB0","dcterms_educationLevel":[{"prefLabel":"12"}],"text":"Write and revise writing to include a variety of sentences and paragraphs that communicate ideas clearly and effectively. Use a wide range of words appropriate to the purpose of the piece. Use correct grammar, spelling, punctuation, manuscript conventions, and integration of quotations and ideas from sources.<br /><br /> [Standard Indicators: 12.4.13, 12.6.1, 12.6.2, 12.6.3, 12.6.4]"}]},{"leaf":false,"text":"Listening and Speaking","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E7D","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"Follow simple oral directions, share information and ideas in complete sentences, recite short pieces, and respond to questions with clear and coherent statements.<br /><br /> [Standard Indicators: K.7.1, K.7.2, K.7.3, K.7.4, K.7.5]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E7E","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"Listen attentively to form relevant questions, follow directions, or retell what is spoken. Recite short pieces, and stay on the topic when relating information or story events.<br /><br /> [Standard Indicators: 1.7.1, 1.7.2, 1.7.3, 1.7.4, 1.7.6, 1.7.7, 1.7.8]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E7F","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"Recite poems and/or sing songs, tell stories, and report on topics, putting events and facts into a clear order or sequence. Determine purposes for listening, and ask questions to aid in understanding what was said.<br /><br /> [Standard Indicators: 2.7.1, 2.7.2, 2.7.5, 2.7.7, 2.7.8, 2.7.9, 2.7.10, 2.7.11, 2.7.13]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E80","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"Deliver narrative presentations that have a beginning, middle and end; develop a central idea; and include sensory details. Retell or paraphrase what a speaker has said and connect it to personal experiences.<br /><br /> [Standard Indicators: 3.7.1, 3.7.2, 3.7.5, 3.7.6, 3.7.7, 3.7.12, 3.7.13, 3.7.14]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E81","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"Deliver narrative and informational presentations that include a context for the story or issue and relevant details, and follow a recognizable organizational pattern. Summarize the major ideas of a presentation, ask relevant questions, and provide complete answers to questions.<br /><br /> [Standard Indicators: 4.7.1, 4.7.2, 4.7.5, 4.7.6, 4.7.7, 4.7.11, 4.7.12, 4.7.13]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E82","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"Deliver narrative, descriptive, and informational presentations that contain a focus, a structure appropriate to the purpose, and supporting details or evidence. Use gestures and phrasing to emphasize main points and enhance meaning. Ask relevant questions that extend ideas and seek new information.<br /><br /> [Standard Indicators: 5.7.1, 5.7.2, 5.7.3, 5.7.4, 5.7.5, 5.7.6, 5.7.9, 5.7.10, 5.7.11, 5.7.13, 5.7.15]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E83","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"Deliver oral presentations that are logically organized, provide context and relevant details, and include strategies, such as visual and media displays, to engage listeners. Identify persuasive techniques used within speeches and presentations. Analyze how these techniques, along with language choices and physical cues, affect the tone and meaning of a presentation.<br /><br /> [Standard Indicators: 6.7.1, 6.7.2, 6.7.4, 6.7.5, 6.7.7, 6.7.8, 6.7.9, 6.7.10, 6.7.11, 6.7.12, 6.7.13, 6.7.14, 6.7.16]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E84","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"Develop persuasive speeches, oral summaries, and research presentations that are organized to achieve particular purposes, and are supported with relevant details, reasons and examples. Deliver presentations with effective speaking techniques. Analyze oral and media communications, evaluating the credibility of details and sources.<br /><br /> [Standard Indicators: 7.7.1, 7.7.3, 7.7.4, 7.7.5, 7.7.7, 7.7.9, 7.7.10, 7.7.11]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E85","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"Outline the organization of speeches and deliver presentations that are well-organized and supported with details, language, and speech techniques appropriate to a particular purpose and audience. Analyze and evaluate speeches to determine the validity of a speaker's conclusions. Identify the impact of visual images on listeners' opinions.<br /><br /> [Standard Indicators: 8.7.1, 8.7.2, 8.7.3, 8.7.8, 8.7.9, 8.7.10, 8.7.11, 8.7.12, 8.7.13, 8.7.15]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E86","dcterms_educationLevel":[{"prefLabel":"9"}],"text":"Analyze the language, organization, evidence, and delivery of oral communications, including historically significant speeches. Develop and deliver well-organized and well-supported presentations that incorporate the use of visual aids, electronic media, and effective verbal and nonverbal elements (e.g., voice control, gestures, eye contact).<br /><br /> [Standard Indicators: 9.7.1, 9.7.2, 9.7.3, 9.7.4, 9.7.6, 9.7.7, 9.7.9, 9.7.10, 9.7.11, 9.7.12, 9.7.14, 9.7.15, 9.7.17, 9.7.18, 9.7.19]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E87","dcterms_educationLevel":[{"prefLabel":"10"}],"text":"Develop, clarify and defend positions using classical speech form and precise and relevant evidence. Use effective delivery techniques and multimedia aids to enhance presentations. Evaluate the coherence, clarity, arguments and evidence of speeches and media communications.<br /><br /> [Standard Indicators: 10.7.1, 10.7.2, 10.7.3, 10.7.4, 10.7.6, 10.7.7, 10.7.8, 10.7.10, 10.7.11, 10.7.12, 10.7.13, 10.7.14, 10.7.15, 10.7.18, 10.7.19]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E88","dcterms_educationLevel":[{"prefLabel":"11"}],"text":"Analyze, formulate and support judgments about the ways in which information is presented in oral and media communications. Deliver well-organized and well-supported presentations that display a command of various types of appeals, reasoning, language and/or rhetorical devices to achieve desired effects for various audiences and purposes.<br /><br /> [Standard Indicators: 11.7.1, 11.7.2, 11.7.3, 11.7.4, 11.7.5, 11.7.6, 11.7.7, 11.7.8, 11.7.9, 11.7.11, 11.7.12, 11.7.15, 11.7.17, 11.7.18, 11.7.19]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E89","dcterms_educationLevel":[{"prefLabel":"12"}],"text":"Analyze, formulate and support judgments about the ways in which information is presented in oral and media communications. Deliver well-organized and well-supported presentations that display a command of various types of appeals, reasoning, language and/or rhetorical devices to achieve desired effects for various audiences and purposes. Evaluate when to use different kinds of effects to support presentations.<br /><br /> [Standard Indicators: 12.7.1, 12.7.2, 12.7.3, 12.7.4, 12.7.5, 12.7.6, 12.7.7, 12.7.8, 12.7.9, 12.7.11, 12.7.12, 12.7.15, 12.7.17, 12.7.18, 12.7.19]"}]},{"leaf":false,"text":"Workplace Skills","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E4F","dcterms_educationLevel":[{"prefLabel":"9"}],"text":"Ask relevant questions of a speaker and make notes of responses. Clarify the purpose and audience for writing and/or speaking and choose an appropriate format (e.g., business letter, list of procedures, proposal, product description, guidelines). Use a computer to design and publish documents that are clearly worded and organized.<br /><br /> [Standard Indicators: 9.4.1, 9.4.2, 9.4.3, 9.4.4, 9.4.8, 9.4.9, 9.4.10, 9.4.11, 9.4.12, 9.4.13, 9.5.5, 9.5.6, 9.5.9, 9.7.1, 9.7.6, 9.7.7, 9.7.15, 9.7.16]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E50","dcterms_educationLevel":[{"prefLabel":"10"}],"text":"Summarize a speaker's message, ask questions to clarify the message, and make relevant statements about ideas under discussion. Develop documents and presentations collaboratively, adjusting the approach for different purposes and audiences and including visual aids in presentations to increase understanding. Use a computer to design, edit and publish documents.<br /><br /> [Standard Indicators: 10.4.1, 10.4.2, 10.4.3, 10.4.8, 10.4.9, 10.4.10, 10.4.11, 10.4.12, 10.5.5, 10.5.6, 10.5.7, 10.5.8, 10.5.9, 10.7.1, 10.7.4, 10.7.6, 10.7.7, 10.7.9, 10.7.15, 10.7.16]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E51","dcterms_educationLevel":[{"prefLabel":"11"}],"text":"Demonstrate interviewing techniques, summarizing a speaker's statements and asking questions to understand the speaker's position. Write résumés, cover letters, reports and documents (e.g., advertisements, brochures, agendas) for different audiences within acceptable formatting conventions using word-processing, presentation and graphics software.<br /><br /> [Standard Indicators: 11.4.2, 11.4.4, 11.4.9, 11.4.10, 11.4.11, 11.4.12, 11.5.5, 11.5.6, 11.5.8, 11.6.3, 11.7.1, 11.7.8, 11.7.12, 11.7.16, 11.7.19]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E52","dcterms_educationLevel":[{"prefLabel":"12"}],"text":"Create and evaluate résumés, cover letters, interview questions and responses; matching tone, form and presentation to the audience and purpose and displaying knowledge of the business and the available position. Create typical workplace documents and proposals with word-processing, spreadsheet, presentation and graphics software, evaluating when to use different types of effects.<br /><br /> [Standard Indicators: 12.4.2, 12.4.4, 12.4.9, 12.4.10, 12.4.11, 12.4.12, 12.5.5, 12.5.6, 12.5.8, 12.7.1, 12.7.8, 12.7.12, 12.7.16, 12.7.19]"}]}]