[{"leaf":false,"text":"The Nature of Science","children":[{"leaf":false,"text":"Asking Questions and Making Observations","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133DDD","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"Ask open-ended questions about events and processes in the natural world and make careful observations in an effort to answer these questions.<br /><br /> [Standard Indicators: K.1.1, K.1.2, K.2.2]"}]},{"leaf":false,"text":"Making and Recording Observations","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133DDE","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"Make observations about the natural world through the use of tools. Draw pictures and write descriptions of the features of the objects or phenomena being studied.<br /><br /> [Standard Indicators: 1.1.1, 1.1.4, 1.2.6, 1.2.7, 1.6.1]"}]},{"leaf":false,"text":"Comparing Observations","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133DDF","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"Observe and measure properties of objects and substances using appropriate tools. Compare observations in terms of shape, size, weight, color and number.<br /><br /> [Standard Indicators: 2.1.1, 2.1.2, 2.1.3, 2.1.4, 2.2.2, 2.2.3]"}]},{"leaf":false,"text":"Reproducibility","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133DE0","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"Work cooperatively to identify and investigate questions that can be examined using a fair test. Confirm that if an investigation is repeated, similar results are expected.<br /><br /> [Standard Indicators: 3.1.1, 3.1.2, 3.1.3, 3.1.5, 3.2.3, 3.2.6, 3.2.7]"}]},{"leaf":false,"text":"Supporting Evidence","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133DE1","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"Recognize that the results of repeated experiments may be different and be able to identify possible reasons for the differences. Support findings and conclusions with data from investigations and print resources.<br /><br /> [Standard Indicators: 4.1.1, 4.1.2, 4.2.1, 4.2.4, 4.2.5, 4.2.6]"}]},{"leaf":false,"text":"Collecting Data and Making Conclusions","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133DE2","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"Make inferences and draw conclusions based on data collected. Examine conclusions from past scientific investigations and determine how and why scientists were able to draw those conclusions. Give examples of how scientists make predictions about the future based on what is known about the past.<br /><br /> [Standard Indicators: 5.1.1, 5.1.2, 5.2.8, 5.5.1, 5.5.7, 5.5.8, 5.5.9, 5.5.10]"}]},{"leaf":false,"text":"Formulating Hypotheses","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133DE3","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"Formulate a hypothesis that can lead to a fair investigation. Examine different ways in which scientists investigate their hypotheses and draw conclusions from their data.<br /><br /> [Standard Indicators: 6.1.2, 6.1.3, 6.2.1, 6.2.5, 6.2.6, 6.2.7, 6.2.8, 6.5.2, 6.5.4, 6.5.5]"}]},{"leaf":false,"text":"Formulating Conclusions","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133DE4","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"Carry out simple investigations and formulate appropriate conclusions. Give examples of different explanations for the same evidence. Explain why one might wait until an investigation is repeated before accepting the results as correct. Give ideas for extending the investigation in order to refine the conclusion.<br /><br /> [Standard Indicators: 7.1.1, 7.1.2, 7.1.3, 7.1.4, 7.2.7, 7.2.8]"}]},{"leaf":false,"text":"Evaluating Conclusions","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133DE5","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"Critically evaluate data from a simple experiment and form a logical statement about the cause-and-effect relationship. Compare this information against prevailing theories. Identify when further studies of the question being investigated may be necessary.<br /><br /> [Standard Indicators: 8.1.1, 8.1.3, 8.2.7, 8.2.8, 8.5.6]"}]}]},{"leaf":false,"text":"The Nature of Technology","children":[{"leaf":false,"text":"Construction","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133DF7","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"Create structures using natural or human-made materials and simple tools. Examine how component parts of the structures can be disassembled and reassembled into new and different strucures. Describe the physical properties of these structures in words and pictures.<br /><br /> [Standard Indicators: K.2.2, K.5.1]"}]},{"leaf":false,"text":"Machines","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133DF6","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"Use tools to make a simple machine (e.g., a ramp) out of common objects such as paper, cardboard, wood or plastic. Put together parts and demonstrate that these can be used to do things that could not be done with the individual parts alone. Explain how tools are used to complete specific tasks every day.<br /><br /> [Standard Indicators: 1.1.4 and Forthcoming]"}]},{"leaf":false,"text":"Design Process","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133DF5","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"Understand that tools, such as paper, pencils or computer programs, are used to gain more information about objects and/or to design and build things.<br /><br /> [Standard Indicators: 2.1.2, 2.1.6]"}]},{"leaf":false,"text":"Significance of Inventions","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133DF4","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"Identify ways in which people use technology and tools in their daily life and work. Describe how recent inventions have significantly changed the way people live.<br /><br /> [Standard Indicators: 3.1.6, 3.1.7]"}]},{"leaf":false,"text":"Engineering and Society","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133DF3","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"Identify differences between the disciplines of science and engineering, and give reasons why clear communication is essential between scientists and engineers who work together. Describe situations in which engineering designs have failed despite steps having been taken to minimize the chances of failure.<br /><br /> [Standard Indicators: 4.1.3, 4.1.5, 4.1.6, 4.1.7]"}]},{"leaf":false,"text":"Effects of New Technology","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133DF2","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"Describe how the interaction between science and technology makes available scientific instruments and materials that are integral to modern science and/or daily life. Give examples of situations in which new technology had unexpected positive and negative effects on the world. Explain how the solution to one problem may create other problems.<br /><br /> [Standard Indicators: 5.1.3, 5.1.4, 5.1.5, 5.1.6, 5.1.7]"}]},{"leaf":false,"text":"Limits","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133DF1","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"Describe how technology is used for transportation, data collection and analysis, and communication. Give examples of problems that cannot be solved with technology.<br /><br /> [Standard Indicators: 6.1.6, 6.1.7, 6.1.8, 6.1.9]"}]},{"leaf":false,"text":"History","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133DF0","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"Describe and give examples of how the needs, attitudes, resources and values of a time period influence the direction of technological development in a variety of cultures and societies.<br /><br /> [Standard Indicators: 7.1.7, 7.1.8, 7.1.9, 7.1.10]"}]},{"leaf":false,"text":"Constraints, Values and the Future","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133DEF","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"Analyze how technological developments are constrained by the laws of the physical world and by the values and priorities of diverse groups of people.<br /><br /> [Standard Indicators: 8.1.6, 8.1.7, 8.1.8]"}]}]},{"leaf":false,"text":"Physical Science","children":[{"leaf":false,"text":"Properties of Matter","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E09","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"Describe objects in terms of the materials that compose them and of their physical properties. Draw pictures that portray the features of each object described.<br /><br /> [Standard Indicators: K.2.2, K.3.1, K.5.1, K.6.1, 1.1.1]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E0F","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"Identify materials as solids or liquids and describe the observable properties of each. Observe a variety of objects and identify their components. Use magnifiers to show that not all objects can be seen with the naked eye and that variations can exist within objects.<br /><br /> [Standard Indicators: 1.1.1, 1.1.4, 1.2.4, 1.2.5, 1.2.6, 1.6.2, 2.6.1]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E15","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"Describe ways in which materials can change form without being lost. Describe different types of earth materials that are useful, in either natural or modified form, in meeting human needs. Identify some resources that can be used over and over again, and others that have a limited life span.<br /><br /> [Standard Indicators: 2.1.7, 2.2.5, 2.4.5]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E1C","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"Give examples of solids, liquids and gases and identify the characteristics of each. Describe ways in which the properties of solids, liquids and gases can be measured.<br /><br /> [Standard Indicators: 3.2.4, 3.4.2, 3.5.2, 3.6.1, 4.3.10]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E23","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"Identify matter as anything that takes up space and has mass. Identify that all matter is made up of parts too small to be seen without magnification. Demonstrate that regardless of how parts of an object are assembled, the weight of the whole object is identical to the sum of the masses of the parts.<br /><br /> [Standard Indicator: 4.3.10]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E3A","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"Give examples of chemical changes such that when a new material is made by combining two or more materials, it has properties that are different from the original materials. Describe how physical properties are not dependent on size or volume of a material.<br /><br /> [Standard Indicators: 6.3.18, 6.3.20]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E3E","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"Explain that all matter is composed of atoms and describe the basic composition and characteristics of an atom. Explain that all forms of matter are composed of one or more of approximately 100 elements and give examples of specific elements.<br /><br /> [Standard Indicators: 8.3.11 and Forthcoming]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E40","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"Describe how atoms of any given element are mostly alike, but are unlike atoms of other elements. Give examples of how two or more different elements can come together to form a compound.<br /><br /> [Standard Indicators: Forthcoming]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E42","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"Describe how the chemical properties of a substance are defined by the arrangement of atoms and molecules. Draw diagrams to show that atoms may come together as well-defined molecules and also that they may be packed together in large arrays.<br /><br /> [Standard Indicators: 8.3.8, 8.3.9, and Forthcoming]"}]},{"leaf":false,"text":"Changes in Matter","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E0A","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"Experiment with ways in which objects can be physically changed. Describe, and draw pictures to show, how changing the object makes it the same or different from a similar unchanged object of the same materials.<br /><br /> [Standard Indicators: K.2.2, K.3.1, K.6.1, 1.1.1]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E10","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"Observe and describe that water and other materials can change from liquid to solid and back again. Observe that liquids left in an open container decrease in amount over time, but the amount of liquid in a closed container does not change.<br /><br /> [Standard Indicator: 1.3.1]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E16","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"Observe and describe the ways in which the properties of a sample of water (including amount) change or stay the same as it is heated and cooled and enters different states (i.e., liquid, solid, gas). Observe the properties of liquids other than water and describe how the liquids behave in response to changes.<br /><br /> [Standard Indicators: 1.3.1, 2.1.1, 2.3.5, 2.5.3, 2.6.3]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E1D","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"Demonstrate that the properties of materials can change, but not all materials respond in the same way to the same action. Observe and explain that when objects gain heat, evaporation and melting can occur; and that when objects lose heat, condensation and freezing can occur.<br /><br /> [Standard Indicators: 2.3.5 and Forthcoming]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E24","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"Identify ways in which the properties of naturally occurring materials may be changed irreversibly. Observe and explain what causes liquid water to enter different states. Compare the freezing and melting properties of other materials to those of water. Use tables and graphs to show changes.<br /><br /> [Standard Indicators: 2.6.3, 3.1.3, 3.5.3, 4.5.4, 5.3.4, 5.3.8, 5.6.4]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E3B","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"Identify heat as the energy of moving particles too small to be seen. Describe how the properties and phases of materials change as the materials gain or lose heat energy.<br /><br /> [Standard Indicators: 5.3.8, 5.6.4]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E44","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"Describe the change in movement of atoms and molecules in solids, liquids and gases that occurs with a change in state. Recognize that although such a change in state may occur, atoms and molecules are in constant motion and do not change their internal structure.<br /><br /> [Standard Indicators: 8.3.9, 8.3.10]"}]},{"leaf":false,"text":"Motion","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E0B","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"Experiment with ways in which different objects can move and compare their movement.<br /><br /> [Standard Indicator: K.3.2]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E11","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"Change how an object is moving by giving it a push or a pull. Investigate and explain how objects move at different rates and in different ways. Observe and show that objects near earth fall to the ground unless something holds them up.<br /><br /> [Standard Indicators: 1.1.1, 1.2.6, 1.2.7, 1.3.4, 1.3.5]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E17","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"Change the motion of objects by applying contact forces and forces that act at a distance. Determine how different types of materials respond to magnetic and electrical forces.<br /><br /> [Standard Indicators: 2.3.7, 2.3.8]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E1E","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"Explain that an object is in motion when its position is changing. Demonstrate that objects move in different ways. Demonstrate that the earth pulls any object toward it without touching it by means of its gravitational attraction. Observe that wind is air in motion.<br /><br /> [Standard Indicators: 4.3.2 and Forthcoming]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E3C","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"Explain that objects move at different rates, dependent on the distance traveled and the amount of time it took to travel a given distance. Demonstrate that changes in speed are caused by forces: the greater the force exerted on a particular object, the greater the change in speed.<br /><br /> [Standard Indicator: 5.3.11]"}]},{"leaf":false,"text":"Energy","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E0C","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"Observe that the sun warms the soil, air and water and raise questions about the differences in their warmth.<br /><br /> [Standard Indicators: K.1.1, 1.3.3]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E18","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"Describe ways in which people use different energy sources in daily life and work.<br /><br /> [Standard Indicator: 2.3.6]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E1F","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"Identify magnetism, light and sound as forms of energy. Measure the force of attraction between magnets as the distance between them changes. Demonstrate that light travels in a straight line until it strikes an object, thus making a shadow. Show how a vibrating object makes the surrounding air vibrate and thus produces sound.<br /><br /> [Standard Indicators: 3.3.9, 3.6.5, 4.3.15]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E25","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"Identify heat as a form of energy. Describe that heat (thermal) energy can come from different sources and is produced in different ways.<br /><br /> [Standard Indicators: 4.3.11, 4.3.12, 4.3.13]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E3D","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"Demonstrate how a warmer object transfers heat to a cooler one by contact or by radiation at a distance, so that the cooler object gets warmer and the warmer object gets cooler. Demonstrate that when heat is made to flow into an object by putting it in contact with a hotter object, its temperature increases.<br /><br /> [Standard Indicator: 5.3.9]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E3F","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"Compare and contrast the two different types of mechanical energy: potential and kinetic. Identify the three common forms of potential energy: gravitational, chemical and elastic.<br /><br /> [Standard Indicators: 6.3.17, 8.3.15]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E41","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"Describe how energy is transferred from place to place through radiation, convection and conduction. Identify the mechanism by which energy is transferred from one system to another: thermally, mechanically, electrically and/or electromagnetically.<br /><br /> [Standard Indicators: 7.3.11, 7.3.14, 7.3.15, 7.3.16]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E45","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"Use examples to explain that when the transfer of energy occurs from one system to another, the total energy before the transfer equals the total energy after the transfer. Describe the transfer of heat energy across space or through a material, and how it involves the collision of atoms within the material.<br /><br /> [Standard Indicators: 8.3.13, 8.3.14]"}]},{"leaf":false,"text":"Chemical Changes","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E43","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"Diagram or describe a simple chemical change that occurs when two substances, elements or compounds react and produce one or more different substances. Use examples to explain that when a chemical change occurs in a closed system, the total mass of the system remains unchanged. Explain how chemical reactions involve the exchange and sharing of electrons between the atoms of the reactants.<br /><br /> [Standard Indicators: 8.3.12 and Forthcoming]"}]}]},{"leaf":false,"text":"Earth and Space Science","children":[{"leaf":false,"text":"Earth Systems","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E0D","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"Observe light and dark in a day-night cycle and identify the changes as a pattern. Observe that weather changes occur from day to day and weather patterns occur from season to season.<br /><br /> [Standard Indicators: Forthcoming]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E26","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"Use models and draw diagrams to show the relationship between the earth's day-night cycle and the rotation of the earth on its axis in a 24-hour period.<br /><br /> [Standard Indicators: 4.3.1, 4.3.8, 4.3.9]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E32","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"Observe and describe the pattern of weather changes throughout the year and explain how weather can be forecasted by examining air masses that move across the surface of the earth. Describe how different aspects of weather can be measured.<br /><br /> [Standard Indicators: 4.3.2, 5.3.5, and Forthcoming]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E35","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"Describe with models or drawings how the earth's tilt on its axis relative to the plane of the earth's yearly orbit around the sun is responsible for seasonal weather changes. Explain how global patterns of air movement are caused by differential heating of air, land and oceans, and how these patterns affect weather and climate patterns.<br /><br /> [Standard Indicators: 6.3.5, 6.3.9, 6.3.11]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E37","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"Describe how water in its different forms cycles through the structures of the earth and its atmosphere. Describe how the oceans' effects on climate are the result of water's high heat capacity, the circulation of water, and the large volume of water in the oceans.<br /><br /> [Standard Indicators: 5.3.4, 5.3.5, 6.3.9, 6.3.11, 7.3.5]"}]},{"leaf":false,"text":"Earth and Space Systems","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E12","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"Observe that the sun and moon are objects in the sky that have patterns of movement. Recognize that the sun and moon appear to rise and set in a regular pattern.<br /><br /> [Standard Indicators: Forthcoming]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E19","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"Observe and describe events in nature that have repeating patterns. Chart their occurrences and predict their recurrence.<br /><br /> [Standard Indicators: 2.3.1, 2.3.2, 2.5.5]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E20","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"Explain that the earth is part of a larger system that includes the sun, planets, various moons and other smaller objects. Observe that the sun appears in different locations in the sky during the day. Observe that the shape of the moon appears a little different each day, but looks the same again about every four weeks.<br /><br /> [Standard Indicators: 3.3.1, 3.3.3, 3.3.4, 3.6.3, 3.6.4, 3.6.5]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E33","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"Describe how the appearance of the sky is affected by the daily rotation of the earth on its axis. Draw diagrams depicting the motion of the earth around the sun in a year's time. Describe the cycle of the moon, including how the shape of the moon changes. Observe and explain the uses of telescopes.<br /><br /> [Standard Indicators: 5.1.4, 5.3.1, 6.3.6, and Forthcoming]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E34","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"Explain how the sun's gravitational pull keeps objects in our solar system in regular and predictable motion. Use models to demonstrate how earth's gravity pulls all objects near earth toward the center of the earth. Create models of the major bodies in our solar system, showing their relative sizes and their relative distances from the sun.<br /><br /> [Standard Indicators: 5.3.6, 5.3.13, 6.3.1, 6.3.2, 6.3.3, 8.3.5, 8.3.17]"}]},{"leaf":false,"text":"Earth Structures","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E13","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"Observe that the sun provides warmth and light to the earth and is necessary for life.<br /><br /> [Standard Indicators: 1.3.3, 1.4.4]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E1A","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"Identify ways in which humans depend on their natural and constructed environments. Describe how humans have found ways to make some limited resources last longer or have replaced them with other resources. Classify human-caused changes to environments as either harmful or helpful, depending on the circumstances.<br /><br /> [Standard Indicators: 2.1.7, 2.3.4]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E27","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"Compare and contrast the different ways in which wind, heat, water and ice constantly reshape the earth's surface. Provide examples of reshaping processes, including events that occur slowly and those that occur quickly. Differentiate among sedimentary, metamorphic and igneous rocks by their properties and methods of formation.<br /><br /> [Standard Indicators: 4.3.2, 4.3.5, 4.3.6, 4.3.7, 4.6.4]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E36","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"Explain and give examples of the way in which soil is formed. Compare and contrast the compositions and textures of the layers of different soils. Explain how the metabolic processes of bacteria and fungi affect soil and how the behaviors of larger organisms, including humans, affect soil composition and fertility.<br /><br /> [Standard Indicators: 4.3.7, 4.3.14, 6.3.7, 6.3.15, 6.4.8]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E38","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"Compare and contrast the features of different rock types and rock formations (including evidence of the minerals, materials, and temperature/ pressure conditions that created them). Explain how earth processes going on today have operated over large expanses of geological time to produce the geological record. Explain how fossils and other relative dating methods can be used to infer the order of geologic events and describe how environmental conditions and life have changed over time.<br /><br /> [Standard Indicators: 7.3.7, 7.3.10]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E39","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"Describe the cause and history of the movement of earth's lithospheric plates and how these movements shape earth's surface. Predict which geologic events and features present will be present at plate boundaries.<br /><br /> [Standard Indicators: 8.3.2, 8.3.3, 8.3.4]"}]}]},{"leaf":false,"text":"Life Science","children":[{"leaf":false,"text":"Structures and Functions of Living Systems","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E0E","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"Examine and classify living and nonliving organisms in order to compare and contrast their characteristics. Observe plants and animals and describe their similarities and differences.<br /><br /> [Standard Indicators: K.2.2, K.4.1, K.4.2, K.6.1]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E14","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"Describe the different resources that living organisms need for survival. Identify natural earth materials, such as rocks, and give examples of how these help to sustain plant and animal life. Explain that animals and plants obtain food in different ways.<br /><br /> [Standard Indicators: 1.1.3, 1.4.3, 1.4.4]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E1B","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"Give examples of adaptations that plants and animals have that allow them to thrive in specific environments. Describe ways in which animals are dependent on plants for shelter, nesting and food.<br /><br /> [Standard Indicators: 2.4.1, 2.4.2, 2.4.3, 2.4.4]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E21","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"Investigate and diagram the life cycles of a plant and of an animal. Identify stages that are similar within the life cycles of organisms from the same group. Identify differences in the life cycles of organisms from different subgroups.<br /><br /> [Standard Indicators: 3.4.1, 3.4.2, 3.4.3]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E28","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"Compare and contrast how plants and animals meet their energy needs. Describe how all animals are directly or indirectly dependent upon plants for their food.<br /><br /> [Standard Indicators: 3.4.4, 4.4.2, 4.4.3, 4.4.4, 4.4.9 ]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E29","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"Identify that living organisms are composed of cells and that a single cell is the smallest unit of life. Describe similarities and differences between cells in plants and animals. Observe and explain that cells can come together to form tissues and that tissues can form organs.<br /><br /> [Standard Indicators: 4.4.1, 5.4.2, 5.4.3, 6.4.5, 6.4.6, 6.4.7, 6.4.11]"}]},{"leaf":false,"text":"Changes in Living Systems","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E22","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"Give examples of characteristics in plants and animals that could be advantageous for survival and reproduction. Describe the fossil evidence that shows some kinds of plants and animals that once lived on the earth have disappeared but resemble plants and animals alive today.<br /><br /> [Standard Indicators: 3.4.3, 3.4.5]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E2A","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"Describe that the features of each organism are inherited from its parents. Explain why small differences in features between parents and off spring can result in descendents generations later who are quite different from their ancestors. Explain why individual organisms may have an advantage in surviving and reproducing in a particular environment due to certain features.<br /><br /> [Standard Indicators: 5.4.1, 5.4.4, 5.4.5, 5.4.7, 5.4.8]"}]},{"leaf":false,"text":"Structures and Functions of Living Systems: Interdependence","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E2B","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"Describe specific interactions between organisms and categorize the effects on the organisms as beneficial, harmful, neither or both. Explain how dead plants and animals are broken down by scavengers and decomposers and how this process contributes to the system as a whole.<br /><br /> [Standard Indicators: 6.4.8, 6.4.9]"}]},{"leaf":false,"text":"Structures and Functions of Living Systems: Matter and Energy Transformations","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E2C","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"Describe how energy from the sun is transformed by plants into sugar and transferred within a food chain from producers to consumers and decomposers. Trace the one-way path energy takes through producers, consumers and decomposers. Compare and contrast organisms at each level of a food chain with regard to how they obtain and use energy. Describe the criteria by which organisms are classified and how their identifying characteristics are related to their role in the food chain.<br /><br /> [Standard Indicators: 6.4.1, 6.4.10, 7.4.5, 7.4.6]"}]},{"leaf":false,"text":"Structures and Functions of Living Systems: Organization and Development","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E2D","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"Compare and contrast the major organelles within plant and animal cells. Investigate the differences between single-celled and mulitcellular organisms. Give examples of single-celled and multicellular organisms. Explain that many cells continually divide to make more cells for growth and repair of a multicellular organism. Describe the hierarchical organization of multicellular organisms from cells to tissues to organs to systems within organisms.<br /><br /> [Standard Indicators: 6.4.5, 6.4.6, 7.4.4, 7.4.5]"}]},{"leaf":false,"text":"Changes in Living Systems: Evolution and Diversity","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E2E","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"Infer the degree of relatedness among different organisms by analyzing similarities in internal and external structures. Explain why similarity in structural features is a better indicator of relatedness than similarity in behavior.<br /><br /> [Standard Indicators: 5.4.8, 7.4.1, 8.4.9]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E31","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"Differentiate between traits that are acquired and those that are inherited. Explain how a particular environment selects for traits that increase survival and production of off spring by individuals bearing those traits. Explain how not all traits that are selected for are necessarily beneficial for long-term survival of the species.<br /><br /> [Standard Indicators: 8.4.1, 8.4.3]"}]},{"leaf":false,"text":"Changes in Living Systems: Heredity and Reproduction","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E2F","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"Explain why asexual reproduction usually results in offspring with genes identical (or nearly so) to those of the single parent. Give examples of organisms that undergo asexual reproduction. Compare asexual reproduction with sexual reproduction. Explain how specialized cells are formed as a result of cell division in a fertilized egg.<br /><br /> [Standard Indicators: 6.4.4, 7.4.3, 8.4.2]"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133E30","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"Identify that instructions specifying the traits of an organism are found in the DNA packaged as chromosomes inside its cells. Recognize that DNA is the same in every cell of an organism. Describe how traits are inherited by the passage of chromosomes from one generation to another.<br /><br /> [Standard Indicators: Forthcoming]"}]}]},{"leaf":false,"text":"Earth and Space Science I","children":[{"leaf":false,"text":"Nature of Science","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133DC5","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Understand that scientific knowledge is gained from observation and experimentation, by designing and conducting investigations guided by theory, and by evaluating and communicating the results of those investigations according to accepted procedures. Construct conclusions from inquiries based on data from investigations and scientific principles. Describe how the validity of a model, explanation or hypothesis can be supported, revised or rejected based on experiments performed by the community of scientists.<br /><br /> [Standard Indicators: Forthcoming]"}]},{"leaf":false,"text":"Space","children":[{"leaf":false,"text":"History of Exploration","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133DC8","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Give examples of technology that has been used over the last 2,000 years to gather evidence and increase our understanding of the universe. Explain how this understanding has undergone major changes due to the use of important instruments, such as refracting and reflecting telescopes, space telescopes (Hubble), spectrometers, and robotic and human explorers.<br /><br /> [Standard Indicators: ES.1.6, ES.1.8, ES.2.1, ES.2.2, ES.2.3, ES.2.4]"}]},{"leaf":false,"text":"Origin and Evolution of the Universe, Galaxies and Stars","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133DC9","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Recognize that the origin of the universe remains one of the biggest questions in science. Describe why scientists place the beginning of the universe at 14-15 billion years ago and support the big bang theory with evidence that the universe is still expanding. Describe how, following the formation of the universe, gravitational attraction clumped together matter to form stars and galaxies.<br /><br /> [Standard Indicators: ES.1.2, ES.1.3, ES.1.4, ES.1.5, ES.1.7]"}]}]},{"leaf":false,"text":"Earth Structures","children":[{"leaf":false,"text":"Origin of the Solar System and History of the Earth","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133DCC","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Describe the role that gravity played in the formation of the solar system, its star and its planets, and how they continue to move under its influence. Describe geological evidence that early earth was very different from present-day earth. Explain how scientists have determined the age of the earth and its geologic history by first using relative dating methods and then more specifically by using radioactive dating methods.<br /><br /> [Standard Indicators: ES.1.1, ES.1.7, ES.1.28, ES.1.29, ES.2.5]"}]},{"leaf":false,"text":"Dynamic Earth","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133DCD","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Use the theory of plate tectonics to describe how the earth's surface has been shaped over time. Explain how information on continental drift, the fossil record, and paleomagnetic records of seafloor spreading support the theory of plate tectonics. Explain how the rock cycle enables us to understand the creation, breakdown and transformation of the various materials that make up the crust of the earth.<br /><br /> [Standard Indicators: ES.1.23, ES.1.24, ES.1.26, ES.1.27, ES.2.6, ES.2.7]"}]}]},{"leaf":false,"text":"Earth Systems","children":[{"leaf":false,"text":"Energy Transfer","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133DD1","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Recognize that the sun is the main source of external energy for the earth. Describe how the sun's energy is absorbed differently by the earth's water, atmosphere and surface, and how this creates wind and ocean currents that influence weather patterns. Explain how these processes can be affected by natural and human factors.<br /><br /> [Standard Indicators: ES.1.10, ES.1.12, ES.1.13, ES.1.14, ES.1.18]"}]},{"leaf":false,"text":"The Atmosphere, Weather and Climate","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133DD2","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Recognize that climate is the average of all weather events for an area and describe how climate is affected by the topography and geography of a region. Understand that both weather and climate involve the transfer of energy throughout the atmosphere. Describe the processes that drive climate change, and how climate changes affect plants, people and other animals. Explain how changes in weather can be forecasted from knowledge of how weather systems develop.<br /><br /> [Standard Indicators: ES.1.11, ES.1.14, ES.1.15, ES.1.16]"}]},{"leaf":false,"text":"Biogeochemical Cycles","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133DD3","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Trace how elements move through the solid earth, atmosphere, and oceans in cycles such as the water cycle, carbon cycle and nitrogen cycle. Describe how solar heating and other thermal processes lead to the distribution of Earth's water in liquid, vapor and solid phases. Describe the contribution of earth's rotation, gravity, climate distributions, and weather systems to the distribution of water over the earth.<br /><br /> [Standard Indicators: ES.1.11, ES.1.19, ES.1.20, ES.1.21]"}]}]}]},{"leaf":false,"text":"Biology I","children":[{"leaf":false,"text":"Nature of Science","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133DB2","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Understand that scientific knowledge is gained from observation and experimentation, by designing and conducting investigations guided by theory, and by evaluating and communicating the results of those investigations according to accepted procedures. Construct conclusions from inquiries based on data from investigations and scientific principles. Describe how the validity of a model, explanation or hypothesis can be supported, revised or rejected based on experiments performed by the community of scientists.<br /><br /> [Standard Indicators: Forthcoming]"}]},{"leaf":false,"text":"Structures and Functions of Living Systems","children":[{"leaf":false,"text":"Cellular Chemistry","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133DB8","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Recognize that cellular processes are based on the interactions of organic molecules composed mostly of a few elements (e.g., carbon, hydrogen, oxygen, nitrogen, phosphorus, sulfur). Describe the basic molecular structure and function of the four major categories of biomolecules (i.e., carbohydrates, lipids, proteins, and nucleic acids). Describe how the majority of the chemical processes essential to the function of the cell is performed by proteins whose function depends on the amino acid sequence and subsequent shape of the molecule.<br /><br /> [Standard Indicators: B.1.4, B.1.5, B.1.6, B.1.7, B.1.15]"}]},{"leaf":false,"text":"Cellular Structure","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133DB9","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Describe features that all cells have in common and contrast those with distinctive features that allow them to carry out specific functions. Relate organelles and other distinctive cellular structures (e.g., plasma membranes, ribosomes) with their functions.<br /><br /> [Standard Indicators: B.1.1, B.1.2, B.1.3, B.1.12, B.1.15]"}]},{"leaf":false,"text":"Matter and Energy Transformations","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133DBA","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Describe how the sun's energy is captured by photosynthetic pigments in chloroplasts and used by plant cells to transform carbon dioxide and water into sugar molecules. Compare and contrast how all producers and consumers transform energy stored in sugar molecules into high energy bonds in adenosine triphosphate (ATP) molecules. Explain that sugar molecules can also be transformed into a variety of other biologically important molecules, such as proteins, nucleic acids, lipids and carbohydrates.<br /><br /> [Standard Indicators: B.1.9, B.1.10, B.1.19, B.1.44, and Forthcoming]"}]},{"leaf":false,"text":"Matter Cycles and Energy Transfer","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133DBB","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Diagram how matter is conserved and cycles within the global ecosystem, while energy flows through all living organisms and is eventually dissipated as heat. Explain that a continuous input of energy from the sun is required to sustain life. Describe how at each level organic molecules can be broken down to use as energy or stored in newly made structures.<br /><br /> [Standard Indicators: B.1.44 and Forthcoming]"}]},{"leaf":false,"text":"Interdependence","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133DBC","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Describe the living and nonliving components of ecosystems and how they interact to create a balanced system. Describe how the relationship between these components is constantly in flux and how natural changes and changes caused by humans can upset the balance.<br /><br /> [Standard Indicators: B.1.37, B.1.38, B.1.39, B.1.40, B.1.41, B.1.42, B.1.43, B.1.45, B.1.46]"}]}]},{"leaf":false,"text":"Changes in Living Systems","children":[{"leaf":false,"text":"Molecular Basis of Heredity","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133DC4","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Describe the living and nonliving components of ecosystems and how they interact to create a balanced system. Describe how the relationship between these components is constantly in flux and how natural changes and changes caused by humans can upset the balance.<br /><br /> [Standard Indicators: B.1.37, B.1.38, B.1.39, B.1.40, B.1.41, B.1.42, B.1.43, B.1.45, B.1.46]"}]},{"leaf":false,"text":"Gene Expression","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133DC3","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Recognize that control of gene expression is necessary because all cells in an individual are derived by mitotic division from the fertilized egg and therefore have identical genes. Explain how alterations in DNA sequences result in mutations in genes that produce new versions of the affected genes.<br /><br /> [Standard Indicators: B.1.8, B.1.23, B.1.24]"}]},{"leaf":false,"text":"Heredity and Reproduction","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133DC2","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Describe how biological traits are passed from parents to offspring, producing variations that may not be obvious for generations. Explain how genetic variation within a population (a species) can be attributed to mutation and gene recombination. Recognize the process of meiosis and explain how the process creates a great variety of gene combinations to be passed to offspring during sexual reproduction. Demonstrate the utility of the Punnett square in predicting the likelihood of specific combinations of alleles in the offspring. Describe how pedigrees may be used to illustrate phenotypic relationships over multiple generations.<br /><br /> [Standard Indicators: B.1.8, B.1.22, B.1.28, B.1.29, B.2.1]"}]},{"leaf":false,"text":"Evidence for Evolution","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133DC1","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Describe how biochemical, fossil, anatomical and genetic findings are used to determine relationships of organisms, producing modern classification systems. Describe how the combined evidence can be explained by genetic evolution, and describe the different mechanisms by which evolution can occur. Explain how natural selection occurs through differences in the reproductive success of specific organisms within a particular environment.<br /><br /> [Standard Indicators: B.1.21, B.1.22, B.1.27, B.1.29, B.1.30, B.1.31, B.1.32, B.1.36, B.2.2, B.2.3, B.2.4]"}]}]}]},{"leaf":false,"text":"Chemistry I","children":[{"leaf":false,"text":"Nature of Science","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133DA8","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Understand that scientific knowledge is gained from observation and experimentation, by designing and conducting investigations guided by theory, and by evaluating and communicating the results of those investigations according to accepted procedures. Construct conclusions from inquiries based on data from investigations and scientific principles. Describe how the validity of a model, explanation or hypothesis can be supported, revised or rejected based on experiments performed by the community of scientists.<br /><br /> [Standard Indicators: Forthcoming]"}]},{"leaf":false,"text":"Properties of Matter and Energy","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133DA9","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Describe how the nature of the interactions between atoms and molecules are reflected in physical and chemical properties of matter. Distinguish between diff erent forms of matter. Compare and contrast chemical and physical changes and be able to predict when a chemical or physical change will occur.<br /><br /> [Standard Indicators: C.1.1, C.1.2, C.1.3, C.1.26, C.1.27, C.1.35, C.1.39]"}]},{"leaf":false,"text":"Atomic and Molecular Structure","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133DAA","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Describe the numbers and types of subatomic particulates and how they contribute to the structure of an atom. Describe the arrangement of the elements in the periodic table and use it to identify repeating patterns of physical and chemical properties of the atoms within it. Explain how these properties reflect the electronic structure of the atoms that make up the elements. Describe the process of radioactive decay and explain the concept of half-life for an isotope.<br /><br /> [Standard Indicators: C.1.32, C.1.33, C.1.34, C.1.43]"}]},{"leaf":false,"text":"Bonding","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133DAB","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Describe how electronic structure determines the nature and extent of bonds between atoms and interactions between molecules. Compare and contrast formation of covalent, ionic and hydrogen bonds. Name and write chemical formulas for ionic and molecular compounds, and draw structural formulas for simple molecules and ionic compounds.<br /><br /> [Standard Indicators: C.1.6, C.1.7, C.1.28, C.1.36]"}]},{"leaf":false,"text":"Reactions and Stoichiometry","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133DAC","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Recognize and classify various types of chemical reactions. Interpret, write and balance chemical equations. Apply the law of conservation of mass in balancing chemical equations. Use the balanced chemical equation and the mole concept to determine the numbers of atoms, moles and molecules of the reactants and products. Determine empirical and molecular formulas and percent compositions.<br /><br /> [Standard Indicators: C.1.9, C.1.10, C.1.11, C.1.12, C.1.13, C.1.14, C.1.15, C.1.16, C.1.22]"}]},{"leaf":false,"text":"Kinetic Molecular Theory and States of Matter","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133DAD","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Using the kinetic molecular theory, model the behavior of ideal gas molecules and describe what happens when matter in one phase undergoes transition into another phase. Use the ideal gas law to calculate measurable properties of gases, such as pressure and temperature. Use examples to describe how the speed at which gas particles move is proportional to the square root of the absolute temperature of the gas.<br /><br /> [Standard Indicators: C.1.30, C.1.31]"}]},{"leaf":false,"text":"Thermochemistry","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133DAE","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Recognize that the reorganization of atoms in chemical reactions results in either the release (exothermic) or absorption (endothermic) of heat energy. Apply the law of conservation of energy by performing specific heat calculations and explaining heats of reaction, formation, combustion and enthalpy. Explain the importance of energy and entropy in chemical reactions and why systems tend to move in the direction of disorder or entropy.<br /><br /> [Standard Indicators: C.1.38, C.1.39, C.1.40]"}]},{"leaf":false,"text":"Solutions","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133DAF","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Define the terms solution, solute and solvent and recognize that solids, liquids and gases can dissolve to form solutions. Explain how the energy of constant random motion causes dissolution of the solute. Identify the factors that affect solubility and reaction rates and describe the dynamic nature of equilibrium.<br /><br /> [Standard Indicators: C.1.4, C.1.5, C.1.17, C.1.18, C.1.19, C.1.29]"}]},{"leaf":false,"text":"Acids, Bases and Salts","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133DB0","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Compare and contrast the dissociation of acids, bases and salts in solution. Explain that when acids dissociate they donate hydrogen ions, and when bases dissociate they accept hydrogen ions or form hydroxide ions. Explain how the pH scale indicates the hydrogen ion concentration in a solution.<br /><br /> [Standard Indicators: C.1.8, C.1.17, C.1.18, C.1.19, C.2.5]"}]},{"leaf":false,"text":"Organic Chemistry and Biochemistry","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133DB1","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Use structural formulas to show that carbon atoms are unique due to their ability to bond to one another and to form up to four stable covalent bonds. Describe how this feature allows carbon to bond with a variety of atoms to form different molecules, ranging from simple hydrocarbons to complex polymers, which provide the biochemical basis of life.<br /><br /> [Standard Indicators: C.1.36, C.1.44, C.1.45]"}]}]},{"leaf":false,"text":"Physics I","children":[{"leaf":false,"text":"Nature of Science","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133DA0","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Understand that scientific knowledge is gained from observation and experimentation, by designing and conducting investigations guided by theory, and by evaluating and communicating the results of those investigations according to accepted procedures. Construct conclusions from inquiries based on data from investigations and scientific principles. Describe how the validity of a model, explanation or hypothesis can be supported, revised or rejected based on experiments performed by the community of scientists.<br /><br /> [Standard Indicators: Forthcoming]"}]},{"leaf":false,"text":"Motion and Forces","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133DA1","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Use measurements to develop an understanding of the concepts of speed, velocity and acceleration; distinguish translation from rotation. Use the concept of force as described by Newton's laws to predict how these quantities are influenced. Describe the gravitational force and its role in the motion of terrestrial and celestial objects. Describe forces by fluids, including the concepts of pressure and buoyancy.<br /><br /> [Standard Indicators: P.1.5, P.1.6, P.1.7, P.1.8, P.1.10]"}]},{"leaf":false,"text":"Conservation Principles:  Momentum, Energy and Mass","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133DA2","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Analyze experiments that illustrate the law of conservation of energy and the law of conservation of momentum. Describe qualitatively and quantitatively the concepts of energy, work and power to describe the exchange of energy in systems. Know the circumstances under which mass is conserved.<br /><br /> [Standard Indicators: P.1.9, P.1.11, P.1.12, P.1.14, P.1.15, P.1.16]"}]},{"leaf":false,"text":"Temperature and Thermal Energy Transfer","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133DA3","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Distinguish thermal energy from temperature. Describe thermal energy transfer from one object to another by conduction, convection and radiation. Use the molecular kinetic theory of matter to describe the properties of gases and to describe the exchange of energy during phase changes. Apply the concepts of conservation of energy to include thermal energy.<br /><br /> [Standard Indicators: P.1.3, P.1.13, P.1.27, P.1.28]"}]},{"leaf":false,"text":"Vibrations, Waves and Sound","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133DA4","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Describe the fundamental characteristics of mechanical vibrations and waves, and understand the relationships between frequency, period, amplitude, wavelength and wave speed. Distinguish longitudinal from transverse waves. Recognize that wave speed depends on the properties of the medium through which the wave travels.<br /><br /> [Standard Indicators: P.1.22, P.1.23]"}]},{"leaf":false,"text":"Electricity and Magnetism","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133DA5","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Describe the electrical forces between charged objects. Use the concept of the electric field to explain the interaction between charged particles. Develop a working model, through experiments with electrical circuits, of patterns of current flow, and of resistance, voltage and power. Describe the relationship between magnetism and electric current, and distinguish AC from DC electricity.<br /><br /> [Standard Indicators P.1.10, P.1.17, P.1.18, P.1.19, P.1.20, P.1.21]"}]},{"leaf":false,"text":"Wave Nature of Light","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133DA6","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Describe the wave nature of light and the parts of the electromagnetic spectrum, as well as diffraction and polarization. Explain the formation of shadows, specular and diff use reflection, and refraction and image formation by lens and mirrors.<br /><br /> [Standard Indicators: P.1.22, P.1.23, P.1.24, P.1.25, P.1.26]"}]},{"leaf":false,"text":"Atomic and Subatomic Particles","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1133DA7","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Describe the structure of the atom using Bohr's theory. Describe the parts of the nucleus and the basis for fission, fusion and nuclear energy. Explain that sub-atomic particles constitute the limit of our knowledge of matter and energy.<br /><br /> [Standard Indicators P.1.29, P.1.30, P.1.31, P.1.32, P.1.33, P.1.34, P.1.35, P.2.8, P.2.9, P.2.10]"}]}]}]