[{"leaf":false,"text":"Content Standard 1: A physically educated person demonstrates competency in motor skills and movement patterns needed to perform a variety of physical activities","children":[{"leaf":false,"text":"K-2 Student expectations (by the end of grade 2)<br /> Young children are very active and enjoy learning and mastering new ways to move and be active. Students achieve mature forms in the basic locomotor skills and vary the manner in which these skills are performed in relationship to changing conditions and expectations. They demonstrate smooth transitions between sequential locomotor skills. Students show progress toward achieving mature form in the more complex manipulative skills (e.g., foot dribble) and achieve mature form in the less complex manipulative skills (e.g., underhand throw). They demonstrate control in traveling, weight-bearing, and balance activities on a variety of body parts.","children":[{"leaf":false,"text":"Demonstrates Level 2 performance in the following:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E74D","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"A. Selected movement concepts in the following: spatial awareness, effort, and relationships."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E74E","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"B. Using selected movement concepts with non-manipulative skills including the following: balance, bending, stretching, rocking, rolling, curling, twisting, turning, pushing, pulling, swinging, swaying, and landing."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E74F","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"C. Movement concepts including the following locomotor skills: walk, run, leap, jump, skip, hop, gallop, slide, chase, flee, and dodge."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E750","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"D. Movement concepts in the following manipulative skills: overhand throw, underhand throw, and roll."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E751","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"E. Movement concepts in the following manipulative skills: catch, kick, hand and foot dribble, and strike."}]},{"leaf":false,"text":"Demonstrates Level 1 performance in the following:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E752","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"F. Basic front float, back float, and recovery. Uses a combination of arms and legs to swim. Demonstrates ability to enter and exit pool safely and use a life jacket (American Red Cross/Whales Tales)."}]}]},{"leaf":false,"text":"3-5 Student expectations (by the end of grade 5)<br /> Older children develop maturity and versatility in the use of fundamental motor skills for more pleasurable movement experiences. Students achieve mature forms in the basic nonlocomotor and manipulative skills. They demonstrate locomotor, nonlocomotor, and manipulative skills for performance outcomes (e.g., hitting targets). They use these skills in dynamic and complex environments (e.g., rhythmic movement to music) and in combination with each other. Students also acquire some specialized skills basic to a movement form (i.e., basketball chest pass, softball fielding with a glove).","children":[{"leaf":false,"text":"Demonstrates Level 3 performance in the following:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E745","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"A. Selected movement concepts with non-manipulative skills in at least the following: balance, bending, stretching, rocking, rolling, curling, twisting, turning, pushing, pulling, swinging, swaying, and landing."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E746","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"B. Selected movement concepts of walking, running, leaping, jumping, skipping, hopping, galloping, sliding, chasing, fleeing, and dodging."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E747","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"C. Selected movement concepts of the following manipulative skills: roll, underhand throw, and overhand throw."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E748","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"D. Three element movement sequence (e.g., simple rhythmic, aerobic, or tumbling activities) with flow."}]},{"leaf":false,"text":"Demonstrates Level 2 performance in the following:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E749","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"E. Movement concepts in the following manipulative skills: catch, kick, foot dribble, and strike with an implement and with the hand."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E74A","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"F. Basic front float, back float, and recovery. Uses a combination of arms and legs to swim. Demonstrates ability to enter and exit pool independently by jumping or stepping from the side safely and uses a life jacket. Demonstrates how to get help (American Red Cross)."}]},{"leaf":false,"text":"Demonstrates Level 1 performance in the following:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E74B","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"G. Movement concepts in the following manipulative skills: chest pass, bounce pass, hand dribble, volley, overhead pass, and punt."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E74C","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"H. Using tactics during modified game play."}]}]},{"leaf":false,"text":"6-8 Student expectations (at the end of grade 8)<br /> Adolescents are able to participate with skill in a variety of modified sports, rhythmic movement, gymnastics, and outdoor activities. Students achieve mature forms in the basic skills of the more specialized sports, rhythmic movement, gymnastics activities. They use the skills successfully in modified games or activities of increasing complexity and in combination with other basic skills. Students demonstrate use of tactics within sport activities.","children":[{"leaf":false,"text":"Demonstrates Level 3 performance in the following:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E741","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"A. Locomotor, selected manipulative and non-manipulative skills during participation in each of the following categories: target, net/wall, invasion, and field/run modified games, and outdoor activities."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E742","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"B. Basic front crawl, back stroke, and breast stroke. Maintains basic treading or floating. Demonstrates ability to enter and exit pool independently by jumping into deep water. Demonstrates how to get help and how to assist a distressed swimmer and a choking victim (American Red Cross)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E743","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"C. Five element movement sequence (e.g., rhythmic, aerobic, or gymnastics activities) with flow."}]},{"leaf":false,"text":"Demonstrates Level 2 performance in the following:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E744","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"D. Using tactics during modified game play."}]}]},{"leaf":false,"text":"9-12 Student expectations (at the end of grade 12)<br /> High school students possess motor skills and movement patterns allowing them to perform a variety of physical activities and to achieve a degree of success that make the activities enjoyable. Students demonstrate the ability to perform basic and advanced skills and tactics to participate in at least one activity from each of three of the following categories: aquatics, team sports, dual sports, individual sports, outdoor pursuits, self defense, rhythmic movement, and gymnastics. They also demonstrate the ability to perform basic skills and tactics to participate in at least five additional activities (from at least three of the categories listed above).","children":[{"leaf":false,"text":"Demonstrates Level 4 performance in the following:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E73E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"A. Use of skills and tactics while participating in three activities. (Activities must be selected from 3 distinct categories: target, net/wall, invasion and field/run modified games, outdoor activities, and martial arts)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E73F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"B. Front crawl, back stroke, and breast stroke. Maintains basic treading or floating. Demonstrates ability to enter and exit pool independently by diving into deep water. Demonstrates how to get help and how to assist a distressed swimmer and a choking victim (American Red Cross)."}]},{"leaf":false,"text":"Demonstrates Level 3 performance in the following:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E740","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"C. Use of skills and tactics while participating in three activities. (Activities must be selected from 3 distinct categories: target, net/wall, invasion and field/run modified games, outdoor activities, and martial arts)."}]}]}]},{"leaf":false,"text":"Content Standard 2: A physically educated person demonstrates understanding of movement concepts, principles, strategies, and tactics as they apply to the learning and performance of physical activities","children":[{"leaf":false,"text":"K-2 Student expectations (by the end of grade 2)<br /> Young children are rapidly maturing in their basic cognitive abilities. They learn and apply concepts such as actions, planes, and personal/general space. They identify and perform concepts of effort and relationships that vary the quality of movement. Students identify elements of correct form for fundamental skills and use them in performance. They use feedback to improve motor performance.","children":[{"leaf":false,"text":"Demonstrates Level 1 performance in the following:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E71A","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"A. Limited identification of the critical elements of manipulative skills: catch, kick, hand and foot dribble, and strike."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E71B","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"B. Limited identification of front float, back float, and recovery. Identifies how to enter and exit the pool safely, water safety rules, use of a life jacket, and how to get help (American Red Cross/Whales Tales)."}]},{"leaf":false,"text":"Demonstrates Level 2 performance in the following:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E71C","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"C. Distinguishes among selected movement concepts."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E71D","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"D. Distinguishes among the critical elements of the following manipulative skills: roll, under hand throw, and overhand throw."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E71E","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"E. Distinguishes among the critical elements of the following locomotor skills: walk, run, leap, jump, skip, hop, gallop, slide, chase, flee, and dodge."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E71F","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"F. Distinguishes among the critical elements of the following non-manipulative skills: balance, bending, stretching, rocking, rolling, curling, twisting, turning, pushing, pulling, swinging, swaying, and landing."}]}]},{"leaf":false,"text":"3-5 Student expectations (by the end of grade 5)<br /> Older children are able to comprehend more complex concepts and principles and apply them in structured settings. They use performance feedback to increase their cognitive understanding of a skill as well as to improve performance. They also use their knowledge of critical elements of form, or simple biomechanical, or motor development principles to provide feedback to others. As they learn more complex motor skills, they transfer concepts learned in other skills/games for performance of the new skill/game (e.g., bending the knees lowers the center of gravity and increases stability).","children":[{"leaf":false,"text":"Demonstrates Level 3 performance in the following:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E720","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"A. Applies knowledge of critical elements of movement concepts while performing non-manipulative, locomotor, and selected manipulative skills (roll, underhand throw, and overhand throw)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E721","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"B. Applies knowledge of movement concepts and skills to design a three element movement sequence (e.g., simple rhythmic, aerobic, or tumbling activities) with flow."}]},{"leaf":false,"text":"Demonstrates Level 2 performance in the following:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E722","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"C. Uses knowledge of critical elements of movement concepts while performing the following manipulative skills: catch, kick, foot dribble, strike with an implement and with the hand, chest pass, bounce pass, hand dribble, volley, overhead pass and punt."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E723","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"D. Uses knowledge of front float, back float, and recovery. Knows how to enter and exit the pool safely, basic water safety rules, use of a life jacket, and how to get help (American Red Cross/Whales Tales)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E724","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"E. Uses internal (prior knowledge) and external feedback to improve performance."}]},{"leaf":false,"text":"Demonstrates Level 1 performance in the following:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E725","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"F. Identifies basic game strategies used during modified game play."}]}]},{"leaf":false,"text":"6-8 Student expectations (at the end of grade 8)<br /> Adolescents exhibit an increasingly complex discipline-specific knowledge. They can identify principles of practice and conditioning that enhance movement performance. They have higher levels of understanding and application of movement concepts/principles and game strategies, critical elements of activity-specific movement skills and characteristics representing highly skilled performance. Students know when, why, and how to use strategies and tactics within game play. They use information from a variety of sources, both internal and external, to guide and improve performance.","children":[{"leaf":false,"text":"Demonstrates Level 3 performance in the following:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E726","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"A. Applies knowledge of critical elements of movement concepts while performing non-manipulative, locomotor, and manipulative skills during participation in target, net/wall, invasion and field/run modified games, and outdoor activities."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E727","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"B. Applies knowledge of selected aquatic skills (American Red Cross). <ol type=\"1\"> <li>Front crawl, back stroke, breast stroke, and treading.</li> <li>Entering and exiting the pool safely, water safety rules, assisting a distressed swimmer and a choking victim.</li></ol>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E72A","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"C. Uses internal (prior knowledge) and external feedback to improve performance."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E72B","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"D. Applies knowledge of movement concepts and skills to design a five element movement sequence (e.g., simple rhythmic or aerobic activities) with flow."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E72C","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"E. Applies knowledge of selected skills to design games."}]},{"leaf":false,"text":"Demonstrates Level 2 performance in the following:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E72D","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"F. Applies knowledge of tactics during modified game play."}]}]},{"leaf":false,"text":"9-12 Student expectations (at the end of grade 12)<br /> High school students demonstrate knowledge and understanding necessary to develop scientifically based personal activity plans that include selected sports and activities. They use complex movement concepts and principles to independently refine their skills and apply them to the learning of new skills. Advanced activity related to discipline-specific knowledge is integrated so that students develop the ability to learn, self-assess, and improve movement skills independently. They also can recognize elite-level performance.","children":[{"leaf":false,"text":"Demonstrates Level 4 performance in the following:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E72E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"A. Applies knowledge of critical elements of movement concepts, motor skills and tactics while participating in three activities. (Activities must be selected from three distinct categories: target, net/wall, invasion and field/run modified games, outdoor activities, and martial arts)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E72F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"B. Analyzes and evaluates performance of skills and tactics drawn separately from three distinct categories: net/wall, field/run, invasion, target, rhythmic, strength and conditioning, aquatics, outdoor pursuits, and self defense."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E730","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"C. Applies knowledge of selected aquatic skills (American Red Cross).<ol type=\"1\"> <li>Front crawl, back stroke, breast stroke, and treading.</li> <li>Entering and exiting the pool safely, water safety rules, assisting a distressed swimmer and a choking victim.</li></ol>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E733","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"D. Uses internal (prior knowledge) and external feedback to improve performance."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E734","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"E. Applies knowledge of movement concepts and skills to design a five element movement sequence (e.g., simple rhythmic or aerobic activities) with flow."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E735","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"F. Applies knowledge of selected skills to design games."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E736","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"G. Applies knowledge of fitness to develop a personal fitness program."}]},{"leaf":false,"text":"Demonstrates Level 3 performance in the following:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E737","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"H. Applies knowledge of tactics during game play."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E738","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"I. Applies knowledge of critical elements of movement concepts, motor skills, and tactics while participating in five activities. (Activities must be selected from three distinct categories: target, net/wall, invasion and field/run modified games, outdoor activities, or martial arts)."}]}]}]},{"leaf":false,"text":"Content Standard 3: A physically educated person participates regularly in lifelong physical activity","children":[{"leaf":false,"text":"K-2 Student expectations (by the end of grade 2)<br /> Young children participate in physical activities largely because of the pleasure they experience. They engage primarily in non-structured physical activities, on an intermittent basis, outside of physical education class and have fun while doing so. They participate in a wide variety of gross motor activities that involve locomotion, non-locomotion, and manipulation of objects. Students knowingly select and participate in activities during their leisure time that are moderate to vigorous in nature and that they find enjoyable. They recognize that participation in moderate to vigorous physical activity has both temporary and lasting effects on the body and voluntarily chose to engage in activities that contribute to improved health. Students begin to utilize the skills and knowledge acquired in physical education class during their leisure-time physical activity.","children":[{"leaf":false,"text":"Intermittently engages in physical activities that are moderate to vigorous in intensity while:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E700","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"A. Participating primarily in physical activities that focus on skill building rather than on formal game structure."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E701","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"B. Participating in a variety of locomotor activities in and outside of physical education."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E702","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"C. Participating in a variety of developmentally-appropriate physical activities that incorporate manipulative skills in and outside of physical education."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E703","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"D. Participating in chasing and fleeing activities in and outside of physical education."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E704","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"E. Participating daily in a variety of non-structured and minimally-organized physical activities outside of physical education."}]}]},{"leaf":false,"text":"3-5 Student expectations (by the end of grade 5)<br /> Older children develop an awareness of participation in physical activity as a conscious personal decision, choosing activities for both the enjoyment and the health benefits they derive. They voluntarily participate in moderate to vigorous physical activity for longer periods of time outside of physical education class. Students are able to identify and make use of opportunities at school and within the community for regular participation in physical activity. They begin to recognize and use critical elements and movement concepts to sustain their own participation in activities they enjoy. They are capable of using information from a variety of sources (internal and external) to regulate their activity participation.","children":[{"leaf":false,"text":"Consciously chooses to participate in physical activities that are moderate to vigorous in intensity while:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E705","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"A. Participating in a variety of locomotor activities in and outside of physical education."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E706","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"B. Participating in a variety of developmentally-appropriate physical activities that incorporate manipulative skills in and outside of physical education."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E707","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"C. Participating in chasing, dodging, and fleeing activities in and outside of physical education."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E708","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"D. Participating primarily in physical activities that focus on combining locomotor and manipulative skills into modified games."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E709","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"E. Participating daily in a variety of non-structured and minimally-organized physical activities outside of physical education."}]}]},{"leaf":false,"text":"6-8 Student expectations (by the end of grade 8)<br /> Adolescents are able to independently set physical activity goals and participate in individualized programs of physical activity and exercise based on personal goals and interests, as well as on the results of fitness assessments. They select and utilize practice procedures and training principles appropriate for the activity goals they set. Students have an increasing awareness of the opportunities for participation in a broad range of activities that may meet their needs and interests. They participate regularly in moderate to vigorous physical activities in both school and non-school settings.","children":[{"leaf":false,"text":"Accumulates time in physical activities that are moderate to vigorous in intensity while:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E70A","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"A. Exploring a wide variety of target, net/wall, invasion, striking/fielding/running games; rhythmic activities; outdoor pursuits; and fitness-related activities in and outside of physical education."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E70B","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"B. Participating primarily in physical activities that focus on combining locomotor and manipulative skills and applying strategies in modified game play."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E70C","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"C. Participating most days of the week in a variety of health-enhancing physical activities outside of physical education."}]}]},{"leaf":false,"text":"9-12 Student expectations (by the end of grade 12)<br /> High school students fully recognize and understand the significance of physical activity in the maintenance of a healthy lifestyle and possess the skills, knowledge, interest, and desire to maintain an active lifestyle. They willingly participate in physical activities on a regular basis that contribute to the attainment of and maintenance of personal physical activity goals. Students at this age make conscious decisions regarding their physical activity participation and assume a mature role in managing their participation based on needs, personal interests, capabilities and resources. They possess adequate movement capabilities and behavioral skills that provide a basis for continued learning and regular physical activity participation. They can independently apply appropriate training principles to their own physical activity and can utilize pertinent scientific principles to enhance their participation in a specific activity or sport. In addition, students demonstrate an understanding of how and why adult patterns of physical activity participation change throughout life and are capable of implementing meaningful strategies to deal with those changes.","children":[{"leaf":false,"text":"Self-regulates participation in physical activities that are moderate to vigorous in intensity while:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E70D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"A. Participating in self-selected lifespan activities that may include target, net/wall, invasion, striking/fielding/running games; rhythmic activities; outdoor pursuits; and fitness-related activities in and outside of physical education."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E70E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"B. Participating in physical activities that focus on applying skills and strategies in mature game play."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E70F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"C. Participating most days of the week in a variety of health-enhancing physical activities outside of physical education."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E710","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"D. Choosing physical activities to meet lifestyle needs."}]}]}]},{"leaf":false,"text":"Content Standard 4: A physically educated person achieves and maintains a health-enhancing level of physical fitness","children":[{"leaf":false,"text":"K-2 Student expectations (by the end of grade 2)<br /> Young children engage in a variety of activities that serve to promote health-related physical fitness. They enjoy physical activities for the pleasure experienced from simply moving and may not associate the activity with the development of physical fitness. They participate in physical activity intermittently for short periods of time, will accumulate a relatively high volume of total activity, and have fun while doing so. They recognize physiological signs associated with participation in moderate to vigorous physical activity (e.g., sweating, fast heart rate, and heavy breathing). Students at this level possess basic knowledge of the components of health-related fitness (e.g., cardiorespiratory endurance, muscular strength and endurance, flexibility, and body composition).","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E6E4","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"A. Recognizes that there are five components of health-related fitness."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E6E5","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"B. Sustains moderate to vigorous levels of physical activity that cause increased heart rate, breathing rate, perspiration, etc., (e.g., running, galloping, skipping, and hopping)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E6E6","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"C. Supports own body weight in selected activities to develop muscular strength and endurance (e.g., climbing, hanging, hopping, jumping, animal walks, and stunts)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E6E7","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"D. Demonstrates flexibility through a full range of motion of the major joints."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E6E8","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"E. Identifies that the body is made up of lean body mass and body fat."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E6E9","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"F. Meets criterion-referenced age- and gender-specific, health-related fitness standards (e.g., Fitnessgram, President's Challenge, and Brockport Physical Fitness Test)."}]},{"leaf":false,"text":"3-5 Student expectations (by the end of grade 5)<br /> Older children regularly participate in physical activity for the purpose of improving physical fitness. Students participate in moderate to vigorous physical activity for longer periods of time without tiring. They begin to engage in physical activities specifically related to each component of physical fitness, are capable of monitoring the physiological indicators that accompany moderate to vigorous physical activity, and adjust their own activity accordingly. Students complete standardized fitness testing and achieve desired levels consistent with contemporary health-related recommendations. With teacher assistance, students interpret the results and understand the significance of information provided by formal measure of physical fitness.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E6EA","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"A. Meets criterion-referenced age- and gender-specific, health-related fitness standards for cardiorespiratory, muscular strength and endurance, flexibility, and body composition (e.g., Fitnessgram, President's Challenge, and Brockport Physical Fitness Test)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E6EB","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"B. Describe the effects of physical activity and nutrition on the body."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E6EC","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"C. Measure the physiological indicators associated with moderate to vigorous physical activity to monitor and/or adjust participation/effort (e.g., palpitating pulse, using pedometers and/or heart rate monitors)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E6ED","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"D. Support one's own body weight while participating in activities that improve physical fitness."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E6EE","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"E. Participates in activities that promote healthy joint flexibility."}]},{"leaf":false,"text":"6-8 Student expectations (by the end of grade 8)<br /> Adolescents participate in moderate to vigorous physical activities on a regular basis without undue fatigue. They participate in physical activities that address each component of health-related fitness, including cardiorespiratory endurance, muscular strength and endurance, flexibility, and body composition. Students know the components of fitness and how these relate to their overall fitness status. Students monitor their own heart rate, breathing rate, perceived exertion, and recovery rate during and following strenuous physical activity. They assess their personal fitness status for each component and use this information to assist in development of individualized physical fitness goals, with little help from the teacher. Students show progress towards knowing the various principles of training (e.g., threshold, overload, specificity) and how these principles can be utilized in improving one's level of physical fitness.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E6EF","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"A. Meets criterion-referenced age- and gender-specific, health-related fitness standards for cardiorespiratory, muscular strength and endurance, flexibility, and body composition (e.g., Fitnessgram, President's Challenge, and Brockport Physical Fitness Test)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E6F0","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"B. Self-assesses health-related fitness status."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E6F1","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"C. Recognizes the principles of training (e.g., Frequency, Intensity, Type, Time (F.I.T.T.), overload, specificity)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E6F2","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"D. Applies the physiological indicators associated with moderate to vigorous physical activity to monitor and/or adjust participation/effort (e.g., palpitating pulse, using pedometers and/or heart rate monitors to train in target heart rate zones)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E6F3","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"E. Develops and implements a plan for improving or maintaining their health-related fitness status, with assistance from the teacher."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E6F4","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"F. Monitors the effects of physical activity and nutrition on the body."}]},{"leaf":false,"text":"9-12 Student expectations (by the end of grade 12)<br /> Young adults assume greater self-responsibility in their lives and display greater autonomy in their personal behaviors. They demonstrate responsibility for their own health-related fitness status by participating in appropriate physical activities on a regular basis. They engage in activities in a variety of settings (e.g., school, home, workplace, and community) for the purpose of achieving and maintaining health-related fitness. They are largely independent in assessing their personal fitness status, and they can interpret information from fitness tests and use this information to plan and design their own programs to achieve and maintain personal fitness goals that encompass all components of fitness.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E6F5","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"A. Meets criterion-referenced age- and gender-specific, health-related fitness standards for cardiorespiratory, muscular strength and endurance, flexibility, and body composition (e.g., Fitnessgram, President's Challenge, and Brockport Physical Fitness Test)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E6F6","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"B. Self-assesses health-related fitness status for the purpose of developing individual goals."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E6F7","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"C. Uses training principles when participating in physical activities (e.g., Frequency, Intensity, Type, Time (F.I.T.T.), overload, specificity)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E6F8","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"D. Analyzes the physiological indicators associated with moderate to vigorous physical activity to monitor and/or adjust participation/effort (e.g., palpitating pulse, using pedometers and/or heart rate monitors to train in target heart rate zones)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E6F9","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"E. Independently develops and implements a plan for improving or maintaining their health-related fitness status."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E6FA","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"F. Demonstrates responsibility for achieving personal fitness goals."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E6FB","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"G. Participates in activities in a variety of settings (e.g., school, home, workplace, and community) in order to meet fitness needs."}]}]},{"leaf":false,"text":"Content Standard 5: A physically educated person exhibits responsible personal and social behavior that respects self and others in physical activity settings","children":[{"leaf":false,"text":"K-2 Student expectations (by the end of grade 2)<br /> Young children discover the joy of playing with friends and experience how social interaction can make activities more fun. They know safe practices and physical education class rules and procedures, and they are able to apply them with little or no reinforcement. Children know how to utilize acceptable behaviors for physical activity settings and are building a foundation for successful interpersonal communication during group activity. By improving motor skills, children have gained a basis and appreciation for working with others in cooperative movement, sharing, working together to solve a problem, and/or tackling a challenge.","children":[{"leaf":false,"text":"Demonstrates Level 2 performance in the following:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E6CC","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"A. Identifies key behaviors which exemplify each of the following personal/social character traits: responsibility, best effort, cooperation, and compassion."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E6CD","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"B. Exhibits behaviors which exemplify each of the following personal/social character traits: responsibility, best effort, cooperation, and compassion."}]},{"leaf":false,"text":"Demonstrates Level 1 performance in the following:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E6CE","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"C. Recognizes the benefits of possessing each of the following personal/social character traits: responsibility, best effort, cooperation, and compassion."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E6CF","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"D. Exhibits behaviors which exemplify each of the following personal/social character traits: constructive competition and initiative."}]}]},{"leaf":false,"text":"3-5 Student expectations (by the end of grade 5)<br /> Older children are active participants and learn to work independently and with small groups, enjoying the diversity of those around them. Students identify the purposes for and follow activity-specific safe practices, rules, procedures, and etiquette. They continue to develop cooperation and communication skills to facilitate completion of a common goal while working with a partner and/or small diverse groups. Older children work independently and productively for short as well as progressively longer periods of time. Building on the foundation laid in the early grades, students continue to develop cultural/ethnic self-awareness, appreciate their own heritage, and appreciate the differences in others.","children":[{"leaf":false,"text":"Demonstrates Level 3 performance in the following:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E6D2","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"A. Identifies key behaviors which exemplify each of the following personal/social character traits: responsibility, best effort, cooperation, and compassion."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E6D3","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"B. Exhibits behaviors which exemplify each of the following personal/social character traits: responsibility, best effort, cooperation, and compassion."}]},{"leaf":false,"text":"Demonstrates Level 2 performance in the following:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E6D4","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"C. Recognizes the benefits of possessing each of the following personal/social character traits: responsibility, best effort, cooperation, compassion, and leadership."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E6D5","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"D. Exhibits behaviors which exemplify each of the following personal/social character traits: constructive competition, initiative, and leadership."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E6D6","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"E. Identifies key behaviors which exemplify the personal/social character traits of leadership."}]}]},{"leaf":false,"text":"6-8 Student expectations (by the end of grade 8)<br /> Adolescents begin to understand the concept of physical activity as a microcosm of modern culture and society. They recognize the role of physical activity in understanding diversity and continue to include and support each other, respecting the limitations and strengths of group members. Students move from merely identifying and following rules, procedures, safe practices, ethical behavior, and positive forms of social interaction to reflecting upon their role in physical activity settings and the benefits of physical activity. They have well-developed cooperation skills and are able to accomplish group/team goals in both cooperative and competitive activities. Adolescents seek greater independence from adults and effectively work independently and in groups to complete assigned tasks. They make appropriate decisions to resolve conflicts arising from the powerful influence of peers, and they practice appropriate problem-solving techniques to resolve conflicts, when necessary, in competitive activities.","children":[{"leaf":false,"text":"Demonstrates Level 4 performance in the following:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E6D9","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"A. Identifies key behaviors which exemplify each of the following personal/social character traits: responsibility, best effort, cooperation, and compassion."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E6DA","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"B. Exhibits behaviors which exemplify each of the following personal/social character traits: responsibility, best effort, cooperation, and compassion."}]},{"leaf":false,"text":"Demonstrates Level 3 performance in the following:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E6DB","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"C. Analyzes the benefits of possessing each of the following personal/social character traits: responsibility, best effort, cooperation, compassion, and leadership."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E6DC","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"D. Exhibits behaviors which exemplify each of the following personal/social character traits: constructive competition, initiative, and leadership."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E6DD","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"E. Identifies key behaviors which exemplify the personal/social character traits of leadership."}]}]},{"leaf":false,"text":"9-12 Student expectations (by the end of grade 12)<br /> Young adults demonstrate the ability to initiate responsible personal and social behavior, function independently, and positively influence the behavior of others in a physical activity setting. They demonstrate leadership by holding themselves and others responsible for following safe practices, rules, procedures, and etiquette in all physical activity settings. They are able to respond to potentially explosive interactions with others by mediating and settling conflicts. Students synthesize and evaluate knowledge regarding the role of physical activity in a culturally diverse society. They make enlightened personal choices for engaging in physical activity over the life span, recognizing the influence of age, disability, gender, race, ethnicity, socioeconomic status, and culture. They develop a personal philosophy of participation, reflecting inclusive practices in physical activity settings.","children":[{"leaf":false,"text":"Demonstrates Level 4 performance in the following:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E6DF","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"A. Identifies key behaviors which exemplify each of the following personal/social character traits: responsibility, best effort, cooperation, and compassion."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E6E0","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"B. Exhibits behaviors which exemplify each of the following personal/social character traits: responsibility, best effort, cooperation and compassion."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E6E1","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"C. Evaluates the benefits of possessing each of the following personal/social character traits: responsibility, best effort, cooperation, compassion, and leadership."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E6E2","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"D. Exhibits behaviors which exemplify each of the following personal/social character traits: constructive competition, initiative, and leadership."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E6E3","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"E. Identifies key behaviors which exemplify the personal/social character traits of leadership."}]}]}]},{"leaf":false,"text":"Content Standard 6: A physically educated person values physical activity for health, enjoyment, challenge, self-expression, and/or social interaction","children":[{"leaf":false,"text":"K-2 Student expectations (by the end of grade 2)<br /> Young children are the most active segment of our population. They are physically active because they enjoy merely participating. Students like the challenge of experiencing new movements and learning new skills. They feel joy as they gain competence in them. They begin to function as members of a group and to work cooperatively for brief periods of time.","children":[{"leaf":false,"text":"Demonstrates Level 2 performance in the following:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E6B0","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"A. Expresses verbal and nonverbal indicators of enjoyment while participating in physical activities."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E6B1","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"B. Chooses to participate in physical activities alone and with others."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E6B2","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"C. Chooses to participate in a physical activity for enjoyment."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E6B3","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"D. Chooses to participate in a physical activity for novelty and challenge."}]},{"leaf":false,"text":"Demonstrates Level 1 performance in the following:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E6B4","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"E. Identifies the emotions they are feeling while participating in a variety of physical activities."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E6B5","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"F. Identifies the differences between idealized body images and elite performance levels portrayed by the media and their own personal characteristics and skills."}]}]},{"leaf":false,"text":"3-5 Student expectations (by the end of grade 5)<br /> Older children can identify activities they consider to be fun. Enjoyment is directly related to competence in a particular activity. They are challenged by learning a new skill or activity and enjoy broadening their repertoire of movement skills. Success and improvement are attributed to effort and practice. They choose an appropriate level of challenge in an activity so as to experience success and engage in activity with students of different and similar skill levels.","children":[{"leaf":false,"text":"Demonstrates Level 3 performance in the following:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E6B8","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"A. Identifies positive feelings associated with regular participation in physical activities."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E6B9","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"B. Chooses to practice skills for which improvement is needed."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E6BA","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"C. Identifies benefits of social interaction as part of participation in physical activities."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E6BB","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"D. Participates willingly with students of varied skill and fitness levels."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E6BC","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"E. Identifies the emotions they are feeling while participating in a variety of physical activities."}]},{"leaf":false,"text":"Demonstrates Level 2 performance in the following:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E6BD","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"F. Identifies the differences between idealized body images and elite performance levels portrayed by the media and their own personal characteristics and skills."}]}]},{"leaf":false,"text":"6-8 Student expectations (by the end of grade 8)<br /> Adolescents seek physical activity experiences for group membership and positive social interaction. They recognize and appreciate skilled performance. Physical activities provide a positive outlet for competition with peers and a means of gaining the respect and recognition of others. Physical activity can increase self-confidence and self-esteem as students discover renewed enjoyment in participation. Physical activity can provide confidence as students start to take steps toward independence. Challenge is found both in experiencing high levels of competition and in learning new and/or different activities. As students experience a greater awareness of feelings, the avenues of self-expression, provided by rhythmic movement, gymnastics, and other sport activities, become increasingly important.","children":[{"leaf":false,"text":"Demonstrates Level 4 performance in the following:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E6C0","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"A. Chooses to exercise regularly outside of physical education for personal enjoyment and benefit."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E6C1","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"B. Chooses to participate in activities that are personally challenging."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E6C2","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"C. Chooses to participate in activities that allow for self-expression."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E6C3","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"D. Recognizes physical activity as a positive opportunity for social interaction."}]},{"leaf":false,"text":"Demonstrates Level 3 performance in the following:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E6C4","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"E. Exhibits indicators of enjoyment for the aesthetic and creative aspects of skilled performance."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E6C5","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"F. Accepts differences between idealized body images and elite performance levels portrayed by the media and their own personal characteristics and skills."}]}]},{"leaf":false,"text":"9-12 Student expectations (by the end of grade 12)<br /> High school students are more comfortable with their new interests and their physiques, thus, once again, enjoying movement for the sheer pleasure of moving. They enjoy the challenge of working hard to better their skills, and they feel satisfaction when they are successful in improving, especially while pursuing personal goals. They enjoy regular participation in selected activities, either alone or with friends. They can explain why participation in these activities is enjoyable and desirable.","children":[{"leaf":false,"text":"Demonstrates Level 4 performance in the following:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E6C7","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"A. Makes a commitment to include physical activity as an important part of a healthy lifestyle."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E6C8","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"B. Accepts the differences between the idealized body images and elite performance levels portrayed by the media and their own personal characteristics and skills."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113E6C9","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"C. Exhibits and indicates enjoyment for aesthetic and creative aspects of skilled performance."}]}]}]}]