[{"leaf":false,"text":"Strand 1:  Writing, Speaking, and Visual Expression","children":[{"leaf":false,"text":"Standard 1.1 Understand and practice writing as a recursive process.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0ED","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 1.1.1","text":"Demonstrate flexibility in using independent and collaborative strategies for planning, drafting, revising, and editing complex texts."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0EE","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 1.1.2","text":"Know and use a variety of prewriting strategies to generate, focus, and organize ideas (e.g., free writing, clustering/mapping, talking with others, brainstorming, outlining, developing graphic organizers, taking notes, summarizing, paraphrasing)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0EF","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 1.1.3","text":"Select and use language that is appropriate (e.g., formal, informal, literary, or technical) for the purpose, audience, and context of the text, speech, or visual representation (e.g., letter to editor, proposal, poem, or digital story)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0F0","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 1.1.4","text":"Compose drafts that convey an impression, express an opinion, raise a question, argue a position, explore a topic, tell a story, or serve another purpose, while simultaneously considering the constraints and possibilities (e.g., structure, language, use of conventions of grammar, usage, and mechanics) of the selected form or genre."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0F1","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 1.1.5","text":"Revise drafts to more fully and/or precisely convey meaning—drawing on response from others, self-reflection, and reading one's own work with the eye of a reader; then refine the text— deleting and/or reorganizing ideas, and addressing potential readers' questions."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0F2","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 1.1.6","text":"Reorganize sentence elements as needed and choose grammatical and stylistic options that provide sentence variety, fluency, and flow."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0F3","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 1.1.7","text":"Edit for style, tone, and word choice (specificity, variety, accuracy, appropriateness, conciseness) and for conventions of grammar, usage and mechanics that are appropriate for audience."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0F4","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 1.1.8","text":"Proofread to check spelling, layout, and font; and prepare selected pieces for a public audience."}]},{"leaf":false,"text":"Standard 1.2 Use writing, speaking, and visual expression for personal understanding and growth.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0E9","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 1.2.1","text":"Write, speak, and use images and graphs to understand and discover complex ideas."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0EA","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 1.2.2","text":"Write, speak, and visually represent to develop self-awareness and insight (e.g., diary, journal writing, portfolio self-assessment)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0EB","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 1.2.3","text":"Write, speak, and create artistic representations to express personal experience and perspective (e.g., personal narrative, poetry, imaginative writing, slam poetry, blogs, webpages)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0EC","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 1.2.4","text":"Assess strengths, weaknesses, and development as a writer by examining a collection of own writing."}]},{"leaf":false,"text":"Standard 1.3 Communicate in speech, writing, and multimedia using content, form, voice, and style appropriate to the audience and purpose (e.g., to reflect, persuade, inform, analyze, entertain, inspire).","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0E0","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 1.3.1","text":"Compose written, spoken, and/or multimedia compositions in a range of genres (e.g., personal narrative, biography, poem, fiction, drama, creative nonfiction, summary, literary analysis essay, research report, or work-related text): pieces that serve a variety of purposes (e.g., expressive, informative, creative, and persuasive) and that use a variety of organizational patterns (e.g., autobiography, free verse, dialogue, comparison/contrast, definition, or cause and effect)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0E1","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 1.3.2","text":"Compose written and spoken essays or work-related text that demonstrate logical thinking and the development of ideas for academic, creative, and personal purposes: essays that convey the author's message by using an engaging introduction (with a clear thesis as appropriate), well-constructed paragraphs, transition sentences, and a powerful conclusion."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0E2","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 1.3.3","text":"Compose essays with well-crafted and varied sentences demonstrating a precise, flexible, and creative use of language."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0E3","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 1.3.4","text":"Develop and extend a thesis, argument, or exploration of a topic by analyzing differing perspectives and employing a structure that effectively conveys the ideas in writing (e.g. resolve inconsistencies in logic; use a range of strategies to persuade, clarify, and defend a position with precise and relevant evidence; anticipate and address concerns and counterclaims; provide a clear and effective conclusion)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0E4","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 1.3.5","text":"From the outset, identify and assess audience expectations and needs; consider the rhetorical effects of style, form, and content based on that assessment; and adapt communication strategies appropriately and effectively."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0E5","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 1.3.6","text":"Use speaking, writing, and visual presentations to appeal to audiences of different social, economic, and cultural backgrounds and experiences (e.g., include explanations and definitions according to the audience's background, age, or knowledge of the topic; adjust formality of style; consider interests of potential readers)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0E6","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 1.3.7","text":"Participate collaboratively and productively in groups (e.g., response groups, work teams, discussion groups, and committees)—fulfilling roles and responsibilities, posing relevant questions, giving and following instructions, acknowledging and building on ideas and contributions of others to answer questions or to solve problems, and offering dissent courteously."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0E7","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 1.3.8","text":"Evaluate own and others' effectiveness in group discussions and formal presentations (e.g., considering accuracy, relevance, clarity, and delivery; types of arguments used; and relationships among purpose, audience, and content)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0E8","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 1.3.9","text":"Use the formal, stylistic, content, and mechanical conventions of a variety of genres in speaking, writing, and multimedia presentations."}]},{"leaf":false,"text":"Standard 1.4 Develop and use the tools and practices of inquiry and research—generating, exploring, and refining important questions; creating a hypothesis or thesis; gathering and studying evidence; drawing conclusions; and composing a report.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0D9","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 1.4.1","text":"Identify, explore, and refine topics and questions appropriate for research."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0DA","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 1.4.2","text":"Develop a system for gathering, organizing, paraphrasing, and summarizing information; select, evaluate, synthesize, and use multiple primary and secondary (print and electronic) resources."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0DB","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 1.4.3","text":"Develop and refine a position, claim, thesis, or hypothesis that will be explored and supported by analyzing different perspectives, resolving inconsistencies, and writing about those differences in a structure appropriate for the audience (e.g., argumentative essay that avoids inconsistencies in logic and develops a single thesis; exploratory essay that explains differences and similarities and raises additional questions)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0DC","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 1.4.4","text":"Interpret, synthesize, and evaluate information/findings in various print sources and media (e.g., fact and opinion, comprehensiveness of the evidence, bias, varied perspectives, motives and credibility of the author, date of publication) to draw conclusions and implications."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0DD","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 1.4.5","text":"Develop organizational structures appropriate to the purpose and message, and use transitions that produce a sequential or logical flow of ideas."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0DE","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 1.4.6","text":"Use appropriate conventions of textual citation in different contexts (e.g., different academic disciplines and workplace writing situations)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0DF","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 1.4.7","text":"Recognize the role of research, including student research, as a contribution to collective knowledge, selecting an appropriate method or genre through which research findings will be shared and evaluated, keeping in mind the needs of the prospective audience. (e.g., presentations, online sharing, written products such as a research report, a research brief, a multi-genre report, I-Search, literary analysis, news article)."}]},{"leaf":false,"text":"Standard 1.5 Produce a variety of written, spoken, multigenre, and multimedia works, making conscious choices about language, form, style, and/or visual representation for each work (e.g., poetry, fiction and creative nonfiction stories, academic and literary essays, proposals, memos, manifestos, business letters, advertisements, prepared speeches, group and dramatic performances, poetry slams, and digital stories).","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0D4","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 1.5.1","text":"Use writing, speaking, and visual expression to develop powerful, creative and critical messages."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0D5","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 1.5.2","text":"Prepare spoken and multimedia presentations that effectively address audiences by careful use of voice, pacing, gestures, eye contact, visual aids, audio and video technology."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0D6","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 1.5.3","text":"Select format and tone based on the desired effect and audience, using effective written and spoken language, sound, and/or visual representations (e.g., focus, transitions, facts, detail and evidence to support judgments, skillful use of rhetorical devices, and a coherent conclusion)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0D7","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 1.5.4","text":"Use technology tools (e.g, word processing, presentation and multimedia software) to produce polished written and multimedia work (e.g., literary and expository works, proposals, business presentations, advertisements)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0D8","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 1.5.5","text":"Respond to and use feedback to strengthen written and multimedia presentations (e.g., clarify and defend ideas, expand on a topic, use logical arguments, modify organization, evaluate effectiveness of images, set goals for future presentations)."}]}]},{"leaf":false,"text":"Strand 2:  Reading, Listening, and Viewing","children":[{"leaf":false,"text":"Standard 2.1 Develop critical reading, listening, and viewing strategies.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0C8","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 2.1.1","text":"Use a variety of pre-reading and previewing strategies (e.g., acknowledge own prior knowledge, make connections, generate questions, make predictions, scan a text for a particular purpose or audience, analyze text structure and features) to make conscious choices about how to approach the reading based on purpose, genre, level of difficulty, text demands and features."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0C9","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 2.1.2","text":"Make supported inferences and draw conclusions based on informational print and multimedia features (e.g., prefaces, appendices, marginal notes, illustrations, bibliographies, author's pages, footnotes, diagrams, tables, charts, maps, timelines, graphs, and other visual and special effects) and explain how authors and speakers use them to infer the organization of text and enhance understanding, convey meaning, and inspire or mislead audiences."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0CA","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 2.1.3","text":"Determine the meaning of unfamiliar words, specialized vocabulary, figurative language, idiomatic expressions, and technical meanings of terms through context clues, word roots and affixes, and the use of appropriate resource materials such as print and electronic dictionaries."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0CB","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 2.1.4","text":"Identify and evaluate the primary focus, logical argument, structure, and style of a text or speech and the ways in which these elements support or confound meaning or purpose."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0CC","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 2.1.5","text":"Analyze and evaluate the components of multiple organizational patterns (e.g., compare/contrast, cause/effect, problem/solution, fact/opinion, theory/evidence)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0CD","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 2.1.6","text":"Recognize the defining characteristics of informational texts, speeches, and multimedia presentations (e.g., documentaries and research presentations) and elements of expository texts (e.g., thesis, supporting ideas, and statistical evidence); critically examine the argumentation and conclusions of multiple informational texts."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0CE","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 2.1.7","text":"Demonstrate understanding of written, spoken, or visual information by restating, paraphrasing, summarizing, critiquing, or composing a personal response; distinguish between a summary and a critique."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0CF","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 2.1.8","text":"Recognize the conventions of visual and multimedia presentations (e.g., lighting, camera angle, special effects, color, and soundtrack) and how they carry or influence messages."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0D0","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 2.1.9","text":"Examine the intersections and distinctions between visual (media images, painting, film, and graphic arts) and verbal communication."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0D1","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 2.1.10","text":"Listen to and view speeches, presentations, and multimedia works to identify and respond thoughtfully to key ideas, significant details, logical organization, fact and opinion, and propaganda."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0D2","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 2.1.11","text":"Demonstrate appropriate social skills of audience, group discussion, or work team behavior by listening attentively and with civility to the ideas of others, gaining the floor in respectful ways, posing appropriate questions, and tolerating ambiguity and lack of consensus."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0D3","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 2.1.12","text":"Use a variety of strategies to enhance listening comprehension (e.g., monitor message for clarity and understanding, ask relevant questions, provide verbal and nonverbal feedback, notice cues such as change of pace or emphasis that indicate a new point is about to be made; and take notes to organize essential information)."}]},{"leaf":false,"text":"Standard 2.2 Use a variety of reading, listening, and viewing strategies to construct meaning beyond the literal level (e.g., drawing inferences; confirming and correcting; making comparisons, connections, and generalizations; and drawing conclusions).","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0C5","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 2.2.1","text":"Recognize literary and persuasive strategies as ways by which authors convey ideas and readers make meaning (e.g., imagery, irony, satire, parody, propaganda, overstatement/understatement, omission, and multiple points of view)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0C6","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 2.2.2","text":"Examine the ways in which prior knowledge and personal experience affect the understanding of written, spoken, or multimedia text."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0C7","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 2.2.3","text":"Interpret the meaning of written, spoken, and visual texts by drawing on different cultural, theoretical, and critical perspectives."}]},{"leaf":false,"text":"Standard 2.3 Develop as a reader, listener, and viewer for personal, social, and political purposes, through independent and collaborative reading.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0BD","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 2.3.1","text":"Read, listen to, and view diverse texts for multiple purposes such as learning complex procedures, making work-place decisions, or pursuing in-depth studies."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0BE","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 2.3.2","text":"Read, view, and/or listen independently to a variety of fiction, nonfiction, and multimedia genres based on student interest and curiosity."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0BF","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 2.3.3","text":"Critically read and interpret instructions for a variety of tasks (e.g., completing assignments, using software, writing college and job applications)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0C0","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 2.3.4","text":"Critically interpret primary and secondary research-related documents (e.g., historical and government documents, newspapers, critical and technical articles, and subject-specific books)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0C1","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 2.3.5","text":"Engage in self-assessment as a reader, listener, and viewer, while monitoring comprehension and using a variety of strategies to overcome difficulties when constructing and conveying meaning."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0C2","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 2.3.6","text":"Reflect on personal understanding of reading, listening, and viewing; set personal learning goals; and take responsibility for personal growth."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0C3","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 2.3.7","text":"Participate as an active member of a reading, listening, and viewing community, collaboratively selecting materials to read or events to view and enjoy (e.g., book talks, literature circles, film clubs)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0C4","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 2.3.8","text":"Develop and apply personal, shared, and academic criteria to evaluate own and others' oral, written, and visual texts."}]}]},{"leaf":false,"text":"Strand 3:  Literature and Culture","children":[{"leaf":false,"text":"Standard 3.1 Develop the skills of close and contextual literary reading.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0B3","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 3.1.1","text":"Interpret literary language (e.g., imagery, allusions, symbolism, metaphor) while reading literary and expository works."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0B4","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 3.1.2","text":"Demonstrate an understanding of literary characterization, character development, the function of major and minor characters, motives and causes for action, and moral dilemmas that characters encounter by describing their function in specific works."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0B5","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 3.1.3","text":"Recognize a variety of plot structures and elements (e.g., story within a story, rising action, foreshadowing, flash backs, cause-and-effect relationships, conflicts, resolutions) and describe their impact on the reader in specific literary works."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0B6","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 3.1.4","text":"Analyze characteristics of specific works and authors (e.g., voice, mood, time sequence, author vs. narrator, stated vs. implied author, intended audience and purpose, irony, parody, satire, propaganda, use of archetypes and symbols) and identify basic beliefs, perspectives, and philosophical assumptions underlying an author's work."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0B7","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 3.1.5","text":"Comparatively analyze two or more literary or expository texts, comparing how and why similar themes are treated differently, by different authors, in different types of text, in different historical periods, and/or from different cultural perspectives."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0B8","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 3.1.6","text":"Examine differing and diverse interpretations of literary and expository works and explain how and why interpretation may vary from reader to reader."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0B9","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 3.1.7","text":"Analyze and evaluate the portrayal of various groups, societies, and cultures in literature and other texts."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0BA","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 3.1.8","text":"Demonstrate an understanding of historical, political, cultural, and philosophical themes and questions raised by literary and expository works."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0BB","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 3.1.9","text":"Analyze how the tensions among characters, communities, themes, and issues in literature and other texts reflect human experience."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0BC","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 3.1.10","text":"Demonstrate an understanding of the connections between literary and expository works, themes, and historical and contemporary contexts."}]},{"leaf":false,"text":"Standard 3.2 Read and respond to classic and contemporary fiction, literary nonfiction, and expository text, from a variety of literary genres representing many time periods and authors (e.g., myth, epic, folklore, drama, poetry, autobiography, novels, short stories, philosophical pieces, science fiction, fantasy, young adult literature, creative non-fiction, hypertext fiction).","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0AE","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 3.2.1","text":"Recognize a variety of literary genres and forms (e.g., poetry, drama, novels, short stories, autobiographies, biographies, multi-genre texts, satire, parody, allegory) and demonstrate an understanding of the way in which genre and form influence meaning."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0AF","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 3.2.2","text":"Identify different types of poetry (e.g., epic, lyric, sonnet, free verse) and explain how specific features (e.g., figurative language, imagery, rhythm, alliteration, etc.) influence meaning."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0B0","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 3.2.3","text":"Identify how elements of dramatic literature (e.g., dramatic irony, soliloquy, stage direction, and dialogue) illuminate the meaning of the text."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0B1","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 3.2.4","text":"Respond by participating actively and appropriately in small and large group discussions about literature (e.g., posing questions, listening to others, contributing ideas, reflecting on and revising initial responses)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0B2","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 3.2.5","text":"Respond to literature in a variety of ways (e.g., dramatic interpretation, reader's theatre, literature circles, illustration, writing in a character's voice, engaging in social action, writing an analytic essay) providing examples of how texts affect their lives, connect them with the contemporary world, and communicate across time."}]},{"leaf":false,"text":"Standard 3.3 Use knowledge of literary history, traditions, and theory to respond to and analyze the meaning of texts.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0A8","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 3.3.1","text":"Explore the relationships among individual works, authors, and literary movements in English and American literature (e.g., Romanticism, Puritanism, the Harlem Renaissance, Postcolonial), and consider the historical, cultural, and societal contexts in which works were produced."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0A9","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 3.3.2","text":"Read and analyze classic and contemporary works of literature (American, British, world) representing a variety of genres and traditions and consider their significance in their own time period as well as how they may be relevant to contemporary society."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0AA","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 3.3.3","text":"Draw on a variety of critical perspectives to respond to and analyze works of literature (e.g., religious, biographical, feminist, multicultural, political)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0AB","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 3.3.4","text":"Demonstrate knowledge of American minority literature and the contributions of minority writers."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0AC","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 3.3.5","text":"Demonstrate familiarity with world literature, including authors beyond American and British literary traditions."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0AD","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 3.3.6","text":"Critically examine standards of literary judgment (e.g., aesthetic value, quality of writing, literary merit, social significance) and questions regarding the inclusion and/or exclusion of literary works in the curriculum (e.g., canon formation, \"classic\" vs. \"popular\" texts, traditional vs. non-traditional literature, the place of literature by women and/or minority writers)."}]},{"leaf":false,"text":"Standard 3.4 Examine mass media, film, series fiction, and other texts from popular culture.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0A4","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 3.4.1","text":"Use methods of close and contextualized reading and viewing to examine, interpret, and evaluate print and visual media and other works from popular culture."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0A5","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 3.4.2","text":"Understand that media and popular texts are produced within a social context and have economic, political, social, and aesthetic purposes."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0A6","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 3.4.3","text":"Understand the ways people use media in their personal and public lives."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0A7","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 3.4.4","text":"Understand how the commercial and political purposes of producers and publishers influence not only the nature of advertisements and the selection of media content, but the slant of news articles in newspapers, magazines, and the visual media."}]}]},{"leaf":false,"text":"Strand 4:  Language","children":[{"leaf":false,"text":"Standard 4.1 Understand and use the English language effectively in a variety of contexts and settings.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F09F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 4.1.1","text":"Use sentence structures and vocabulary effectively within different modes (oral and written, formal and informal) and for various rhetorical purposes."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0A0","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 4.1.2","text":"Use resources to determine word meanings, pronunciations, and word etymologies (e.g., context, print and electronic dictionaries, thesauruses, glossaries, and others)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0A1","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 4.1.3","text":"Use a range of linguistic applications and styles for accomplishing different rhetorical purposes (e.g., persuading others to change opinions, conducting business transactions, speaking in a public forum, discussing issues informally with peers)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0A2","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 4.1.4","text":"Control standard English structures in a variety of contexts (e.g., formal speaking, academic prose, business, and public writing) using language carefully and precisely."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F0A3","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 4.1.5","text":"Demonstrate use of conventions of grammar, usage, and mechanics in written texts, including parts of speech, sentence structure and variety, spelling, capitalization, and punctuation."}]},{"leaf":false,"text":"Standard 4.2 Understand how language variety reflects and shapes experience.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F09A","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 4.2.1","text":"Understand how languages and dialects are used to communicate effectively in different roles, under different circumstances, and among speakers of different speech communities (e.g., ethnic communities, social groups, professional organizations)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F09B","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 4.2.2","text":"Understand the implications and potential consequences of language use (e.g., appropriate professional speech; sexist, racist, homophobic language)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F09C","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 4.2.3","text":"Recognize and appreciate language variety, understand that all dialects are rule-governed, and respect the linguistic differences of other speech communities."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F09D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 4.2.4","text":"Understand the appropriate uses and implications of casual or informal versus professional language; understand, as well, the implications of language designed to control others and the detrimental effects of its use on targeted individuals or groups (e.g., propaganda, homophobic language, and racial, ethnic, or gender epithets)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103F09E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"CE 4.2.5","text":"Recognize language bias in one's community, school, textbooks, the public press, and in one's own use of language."}]}]}]