[{"leaf":false,"text":"Number and Operations","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307C2","dcterms_educationLevel":[{"prefLabel":"K"}],"asn_statementNotation":"M(N&O)–K–1","text":"Demonstrates conceptual understanding of rational numbers with respect to: whole numbers from 0 to 12 through investigations that apply the concepts of equivalency in composing or decomposing numbers using models, explanations, or other representations; and positive fractional numbers (1/2) as \"fair share\" (i.e., equal sized parts or sets) using models, explanations, or other representations. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307C3","dcterms_educationLevel":[{"prefLabel":"K"}],"asn_statementNotation":"M(N&O)–K–2","text":"Demonstrates understanding of the relative magnitude of numbers from 0 to 20 through investigations that demonstrate one-to-one correspondence; that compare whole numbers to each other or to benchmark whole numbers (5, 10); that demonstrate an understanding of the relation of inequality when comparing whole numbers by using \"1 more\" or \"1 less\"; that connect numbers orally and written as numerals to the quantities that they represent using models, representations, or number lines. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307C4","dcterms_educationLevel":[{"prefLabel":"K"}],"asn_statementNotation":"M(N&O)–K–3","text":"Demonstrates conceptual understanding of mathematical operations through investigations involving addition and subtraction of whole numbers (from 0 to 10) by solving problems involving joining actions, separating actions, part-part whole relationships, and comparison situations; and addition of multiple one-digit whole numbers. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307C5","dcterms_educationLevel":[{"prefLabel":"K"}],"asn_statementNotation":"M(N&O)–K–5","text":"Demonstrates understanding of monetary value through investigation involving knowing the names and values for coins (penny, nickel and dime). (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307C6","dcterms_educationLevel":[{"prefLabel":"K"}],"asn_statementNotation":"M(N&O)–K–6","text":"Mentally adds and subtracts whole numbers by naming the number that is one more or one less than the original number. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307C7","dcterms_educationLevel":[{"prefLabel":"K"}],"asn_statementNotation":"M(N&O)–K–7","text":"Makes estimates of the number of objects in a set (up to 20) by making and revising estimates as objects are counted (e.g., A student estimates the number of pennies in a jar as 20. Then the student counts the first 10 and makes another estimate based on those that have been counted and those that remain in the jar.). (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307C8","dcterms_educationLevel":[{"prefLabel":"1"}],"asn_statementNotation":"M(N&O)–1–1","text":"Demonstrates conceptual understanding of rational numbers with respect to: whole numbers from 0 to 100 using place value, by applying the concepts of equivalency in composing or decomposing numbers; and in expanded notation using models, explanations, or other representations; and positive fractional numbers (benchmark fractions: a/2, a/3, or a/4, where a is a whole number greater than 0 and less than or equal to the denominator) as a part to whole relationship in area models where the denominator is equal to the number of parts in the whole using models, explanations, or other representations. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307C9","dcterms_educationLevel":[{"prefLabel":"1"}],"asn_statementNotation":"M(N&O)–1–2","text":"Demonstrates understanding of the relative magnitude of numbers from 0 to 100 by ordering whole numbers; by comparing whole numbers to each other or to benchmark whole numbers (5, 10, 25, 50, 75, 100); by demonstrating an understanding of the relation of inequality when comparing whole numbers by using \"1 more\", \"1 less\", \"5 more\", \"5 less\", \"10 more\", \"10 less\"; and by connecting number words (from 0 to 20) and numerals (from 0 to 100) to the quantities and positions that they represent using investigations, models, representations, or number lines. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307CA","dcterms_educationLevel":[{"prefLabel":"1"}],"asn_statementNotation":"M(N&O)–1–3","text":"Demonstrates conceptual understanding of mathematical operations involving addition and subtraction of whole numbers (from 0 to 30) by solving problems involving joining actions, separating actions, part-part whole relationships, and comparison situations; and addition of multiple one-digit whole numbers. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307CB","dcterms_educationLevel":[{"prefLabel":"1"}],"asn_statementNotation":"M(N&O)–1–5","text":"Demonstrates understanding of monetary value by knowing the names and values for coins (penny, nickel, dime, and quarter); and by adding collections of like coins together to a sum no greater than $1.00. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307CC","dcterms_educationLevel":[{"prefLabel":"1"}],"asn_statementNotation":"M(N&O)–1–6","text":"Mentally adds and subtracts whole numbers by naming the number that is one or two more or less than the original number; and adds and subtracts whole number facts to ten (e.g., 5 + 3 = 8; 8 – 5 = 3). (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307CD","dcterms_educationLevel":[{"prefLabel":"1"}],"asn_statementNotation":"M(N&O)–1–7","text":"Makes estimates of the number of objects in a set (up to 30 ) and revises estimates as objects are counted (e.g., A student estimates the number of pennies in a jar as 28. Then the student counts the first 10 and makes another estimate based on those that have been counted and those that remain in the jar.). (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307CE","dcterms_educationLevel":[{"prefLabel":"1"}],"asn_statementNotation":"M(N&O)–1–8","text":"Applies properties of numbers (odd, even, composition, and decomposition [e.g., 5 is the same as 2 + 3]) and field properties (commutative and identity for addition) to solve problems and to simplify computations involving whole numbers. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307CF","dcterms_educationLevel":[{"prefLabel":"2"}],"asn_statementNotation":"M(N&O)–2–1","text":"Demonstrates conceptual understanding of rational numbers with respect to: whole numbers from 0 to 199 using place value, by applying the concepts of equivalency in composing or decomposing numbers (e.g., 34 = 17 + 17; 34 = 29 + 5); and in expanded notation (e.g., 141 = 1 hundred + 4 tens + 1 one or 141 = 100 + 40 + 1) using models, explanations, or other representations; and positive fractional numbers (benchmark fractions: a/2, a/3, or a/4, where a is a whole number greater than 0 and less than or equal to the denominator) as a part to whole relationship in area and set models where the denominator is equal to the number of parts in the whole using models, explanations, or other representations. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307D0","dcterms_educationLevel":[{"prefLabel":"2"}],"asn_statementNotation":"M(N&O)–2–2","text":"Demonstrates understanding of the relative magnitude of numbers from 0 to 199 by ordering whole numbers; by comparing whole numbers to each other or to benchmark whole numbers (10, 25, 50, 75, 100, 125, 150, or 175); by demonstrating an understanding of the relation of inequality when comparing whole numbers by using \"1 more\", \"1 less\", \"10 more\", \"10 less\", \"100 more\", or \"100 less\"; or by connecting number words and numerals to the quantities they represent using models, number lines, or explanations. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307D1","dcterms_educationLevel":[{"prefLabel":"2"}],"asn_statementNotation":"M(N&O)–2–3","text":"Demonstrates conceptual understanding of mathematical operations involving addition and subtraction of whole numbers by solving problems involving joining actions, separating actions, part-part whole relationships, and comparison situations; and addition of multiple one-digit whole numbers. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307D2","dcterms_educationLevel":[{"prefLabel":"2"}],"asn_statementNotation":"M(N&O)–2–5","text":"Demonstrates understanding of monetary value by adding coins together to a value no greater than $1.99 and representing the result in dollar notation; making change from $1.00 or less, or recognizing equivalent coin representations of the same value (values up to $1.99). (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307D3","dcterms_educationLevel":[{"prefLabel":"2"}],"asn_statementNotation":"M(N&O)–2–6","text":"Mentally adds and subtracts whole number facts to a sum of 20; names the number that is 10 more or less than the original number, and mentally adds and subtracts twodigit multiplies of ten (e.g., 60 + 80, 90 – 30). (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307D4","dcterms_educationLevel":[{"prefLabel":"2"}],"asn_statementNotation":"M(N&O)–2–7","text":"Makes estimates of the number of objects in a set (up to 50) by selecting an appropriate method of estimation. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307D5","dcterms_educationLevel":[{"prefLabel":"2"}],"asn_statementNotation":"M(N&O)–2–8","text":"Applies properties of numbers (odd and even) and field properties (commutative for addition, identity for addition, and associative for addition) to solve problems and to simplify computations involving whole numbers. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307D6","dcterms_educationLevel":[{"prefLabel":"3"}],"asn_statementNotation":"M(N&O)–3–1","text":"Demonstrates conceptual understanding of rational numbers with respect to: whole numbers from 0 to 999 through equivalency, composition, decomposition, or place value using models, explanations, or other representations; and positive fractional numbers (benchmark fractions: a/2, a/3, a/4, a/6, or a/8, where a is a whole number greater than 0 and less than or equal to the denominator) as a part to whole relationship in area and set models where the number of parts in the whole is equal to the denominator; and decimals (within a context of money) as a part of 100 using models, explanations, or other representations. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307D7","dcterms_educationLevel":[{"prefLabel":"3"}],"asn_statementNotation":"M(N&O)–3–2","text":"Demonstrates understanding of the relative magnitude of numbers from 0 to 999 by ordering whole numbers; by comparing whole numbers to benchmark whole numbers (100, 250, 500, 750); or by comparing whole numbers to each other; and comparing or identifying equivalent positive fractional numbers (a/2, a/3, a/4 where a is a whole number greater than 0 and less than or equal to the denominator) using models, number lines, or explanations. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307D8","dcterms_educationLevel":[{"prefLabel":"3"}],"asn_statementNotation":"M(N&O)–3–3","text":"Demonstrates conceptual understanding of mathematical operations by describing or illustrating the inverse relationship between addition and subtraction of whole numbers; and the relationship between repeated addition and multiplication using models, number lines, or explanations. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307D9","dcterms_educationLevel":[{"prefLabel":"3"}],"asn_statementNotation":"M(N&O)–3–4","text":"Accurately solves problems involving addition and subtraction with regrouping; the concept of multiplication; and addition or subtraction of decimals (in the context of money). (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307DA","dcterms_educationLevel":[{"prefLabel":"3"}],"asn_statementNotation":"M(N&O)–3–6","text":"Mentally adds and subtracts whole number facts through 20; adds two-digit and one-digit whole numbers; adds combinations of two-digit and three-digit whole numbers that are multiples of ten (e.g., 60 +50, 300 + 400, 320 + 90); subtracts a one-digit whole number from a two-digit whole number (e.g., 37 – 5); and subtracts two-digit whole numbers that are multiples of ten and three-digit whole numbers that are multiples one hundred (e.g., 50 – 20, 500 – 200). (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307DB","dcterms_educationLevel":[{"prefLabel":"3"}],"asn_statementNotation":"M(N&O)–3–7","text":"Makes estimates in a given situation by identifying when estimation is appropriate, selecting the appropriate method of estimation, and evaluating the reasonableness of solutions appropriate to grade level GLEs across content strands. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307DC","dcterms_educationLevel":[{"prefLabel":"3"}],"asn_statementNotation":"M(N&O)–3–8","text":"Applies properties of numbers (odd, even, and multiplicative property of zero for single-digit whole numbers [6 x 0 = 0]) and field properties (commutative for addition, associative for addition, identity for multiplication, and commutative for multiplication for single-digit whole numbers [e.g., 3 x 4 = 4 x 3]) to solve problems and to simplify computations involving whole numbers. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307DD","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"M(N&O)–4–1","text":"Demonstrates conceptual understanding of rational numbers with respect to: whole numbers from 0 to 999,999 through equivalency, composition, decomposition, or place value using models, explanations, or other representations; and positive fractional numbers (benchmark fractions: a/2, a/3, a/4, a/5, a/6, a/8, or a/10, where a is a whole number greater than 0 and less than or equal to the denominator) as a part to whole relationship in area, set, or linear models where the number of parts in the whole are equal to, and a multiple or factor of the denominator; and decimals as hundredths within the context of money, or tenths within the context of metric measurements (e.g., 2.3 cm) using models, explanations, or other representations. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307DE","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"M(N&O)–4–2","text":"Demonstrates understanding of the relative magnitude of numbers from 0 to 999,999 by ordering or comparing whole numbers; and ordering, comparing, or identifying equivalent proper positive fractional numbers; or decimals using models, number lines, or explanations. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307DF","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"M(N&O)–4–3","text":"Demonstrates conceptual understanding of mathematical operations by describing or illustrating the relationship between repeated subtraction and division (no remainders); the inverse relationship between multiplication and division of whole numbers; or the addition or subtraction of positive fractional numbers with like denominators using models, number lines, or explanations. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307E0","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"M(N&O)–4–4","text":"Accurately solves problems involving multiple operations on whole numbers or the use of the properties of factors and multiples; and addition or subtraction of decimals and positive proper fractions with like denominators. (Multiplication limited to 2 digits by 2 digits, and division limited to 1 digit divisors.) (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307E1","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"M(N&O)–4–6","text":"Mentally adds and subtracts whole number facts through 20; multiplies whole number facts to a product of 100, and calculates related division facts; adds two-digit whole numbers, combinations of two-digit and 3-digit whole numbers that are multiples of ten, and 4-digit whole numbers that are multiples of 100 (limited to two addends) (e.g., 67 + 24; 320 + 430; 320 + 90; 1,300 + 1,400); and subtracts a one-digit whole number from a two-digit whole number (e.g., 67 – 9); and subtracts combinations of two-digit and three-digit whole numbers that are multiples of ten (e.g., 50 – 20, 230 – 80, 520 – 200). (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307E2","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"M(N&O)–4–7","text":"Makes estimates in a given situation by identifying when estimation is appropriate, selecting the appropriate method of estimation, and evaluating the reasonableness of solutions appropriate to grade level GLEs across content strands. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307E3","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"M(N&O)–4–8","text":"Applies properties of numbers (odd, even, multiplicative property of zero, and remainders) and field properties (commutative, associative, and identity) to solve problems and to simplify computations. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307E4","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"M(N&O)–5–1","text":"Demonstrates conceptual understanding of rational numbers with respect to: whole numbers from 0 to 9,999,999 through equivalency, composition, decomposition, or place value using models, explanations, or other representations; and positive fractional numbers (proper, mixed number, and improper) (halves, fourths, eighths, thirds, sixths, twelfths, fifths, or powers of ten (10, 100, 1000)), decimals (to thousandths), or benchmark percents (10%, 25%, 50%, 75% or 100%) as a part to whole relationship in area, set, or linear models using models, explanations, or other representations. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307E5","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"M(N&O)–5–2","text":"Demonstrates understanding of the relative magnitude of numbers by ordering, comparing, or identifying equivalent positive fractional numbers, decimals, or benchmark percents within number formats (fractions to fractions, decimals to decimals, or percents to percents); or integers in context using models or number lines. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307E6","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"M(N&O)–5–3","text":"Demonstrates conceptual understanding of mathematical operations by adding and subtracting decimals and positive proper fractions with unlike denominators. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307E7","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"M(N&O)–5–3","text":"Demonstrates conceptual understanding of mathematical operations by describing or illustrating the meaning of a remainder with respect to division of whole numbers using models, explanations, or solving problems. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307E8","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"M(N&O)–5–4","text":"Accurately solves problems involving multiple operations on whole numbers or the use of the properties of factors, multiples, prime, or composite numbers; and addition or subtraction of fractions (proper) and decimals to the hundredths place. (Division of whole numbers by up to a two-digit divisor.) (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307E9","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"M(N&O)–5–6","text":"Mentally calculates change back from $1.00, $5.00, and $10.00; calculates multiplication and related division facts to a product of 144; multiplies a two-digit whole number by a one-digit whole number (e.g., 45 x 5), two-digit whole numbers that are multiples of ten (e.g., 50 x 60), a threedigit whole number that is a multiple of 100 by a two- or threedigit number which is a multiple of 10 or 100, respectively (e.g., 400 x 50, 400 x 600); and divides 3- and 4-digit multiples of powers of ten by their compatible factors (e.g., 360 ÷ 6; 360 ÷ 60; 3600 ÷ 6; 3600 ÷ 60; 3600 ÷ 600; 360 ÷ 12; 360 ÷ 120; 3600 ÷ 12; 3600 ÷ 120; 3600 ÷ 1200). (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307EA","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"M(N&O)–5–7","text":"Makes estimates in a given situation by identifying when estimation is appropriate, selecting the appropriate method of estimation, determining the level of accuracy needed given the situation, analyzing the effect of the estimation method on the accuracy of results, and evaluating the reasonableness of solutions appropriate to grade level GLEs across content strands. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307EB","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"M(N&O)–5–8","text":"Applies properties of numbers (odd, even, and divisibility) and field properties (commutative, associative, identity, and distributive) to solve problems and to simplify computations. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307EC","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"M(N&O)–6–1","text":"Demonstrates conceptual understanding of rational numbers with respect to ratios (comparison of two whole numbers by division a/b, a : b, and a ÷ b , where b ≠ 0); and rates (e.g., a out of b, 25%) using models, explanations, or other representations. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307ED","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"M(N&O)–6–2","text":"Demonstrates understanding of the relative magnitude of numbers by ordering or comparing numbers with whole number bases and whole number exponents (e.g.,3³, 4³), integers, or rational numbers within and across number formats (fractions, decimals, or whole number percents from 1–100) using number lines or equality and inequality symbols. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307EE","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"M(N&O)–6–3","text":"Demonstrates conceptual understanding of mathematical operations by adding and subtracting positive fractions and integers; and multiplying and dividing fractions and decimals. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307EF","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"M(N&O)–6–3","text":"Demonstrates conceptual understanding of mathematical operations by describing or illustrating the meaning of a power by representing the relationship between the base (whole number) and the exponent (whole number) (e.g.,3³, 4³); and the effect on the magnitude of a whole number when multiplying or dividing it by a whole number, decimal, or fraction. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307F0","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"M(N&O)–6–4","text":"Accurately solves problems involving single or multiple operations on fractions (proper, improper, and mixed), or decimals; and addition or subtraction of integers; percent of a whole; or problems involving greatest common factor or least common multiple. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307F1","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"M(N&O)–6–6","text":"Uses a variety of mental computation strategies to solve problems (e.g., using compatible numbers, applying properties of operations, using mental imagery, using patterns) and to determine the reasonableness of answers; and mentally calculates change back from $5.00, $10.00, $20.00, $50.00, and $100.00; multiplies a two-digit whole number by a one-digit number whole number (e.g., 45 x 5), two-digit whole numbers that are multiples of ten (e.g., 50 x 60), a three-digit whole number that is a multiple of 100 by a two- or three-digit number which is a multiple of 10 or 100, respectively (e.g., 400 x 50, 400 x 600); divides 3- and 4-digit multiples of powers of ten by their compatible factors (e.g., 360 ÷ 6; 360 ÷ 60; 3600 ÷ 6; 3600 ÷ 60; 3600 ÷ 600; 360 ÷ 12; 360 ÷ 120; 3600 ÷ 12; 3600 ÷ 120; 3600 ÷ 1200); and determines the part of a whole number using benchmark percents (1%, 10%, 25%, 50%, and 75%). (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307F2","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"M(N&O)–6–7","text":"Makes estimates in a given situation by identifying when estimation is appropriate, selecting the appropriate method of estimation, determining the level of accuracy needed given the situation, analyzing the effect of the estimation method on the accuracy of results, and evaluating the reasonableness of solutions appropriate to grade level GLEs across content strands. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307F3","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"M(N&O)–6–8","text":"Applies properties of numbers (odd, even, remainders, divisibility, and prime factorization) and field properties (commutative, associative, identity [including the multiplicative property of one, e.g., 1 = 2/2 and 2/2 x 3/4 = 6/8, so 3/4 = 6/8], distributive, and additive inverses) to solve problems and to simplify computations. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307F4","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"M(N&O)–7–1","text":"Demonstrates conceptual understanding of rational numbers with respect to square roots of perfect squares, rates, and proportional reasoning. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307F5","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"M(N&O)–7–1","text":"Demonstrates conceptual understanding of rational numbers with respect to percents as a means of comparing the same or different parts of the whole when the wholes vary in magnitude (e.g., 8 girls in a classroom of 16 students compared to 8 girls in a classroom of 20 students, or 20% of 400 compared to 50% of 100); and percents as a way of expressing multiples of a number (e.g., 200% of 50) using models, explanations, or other representations. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307F6","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"M(N&O)–7–2","text":"Demonstrates understanding of the relative magnitude of numbers by ordering, comparing, or identifying equivalent rational numbers across number formats, numbers with whole number bases and whole number exponents (e.g., 3³, 4³), integers, absolute values, or numbers represented in scientific notation using number lines or equality and inequality symbols. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307F7","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"M(N&O)–7–3","text":"Demonstrates conceptual understanding of operations with integers and whole number exponents (where the base is a whole number) using models, diagrams, or explanations. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307F8","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"M(N&O)–7–4","text":"Accurately solves problems involving the addition or subtraction of integers, raising numbers to whole number powers, and determining square roots of perfect square numbers and non-perfect square numbers. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307F9","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"M(N&O)–7–4","text":"Accurately solves problems involving proportional reasoning; percents involving discounts, tax, or tips; and rates. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307FA","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"M(N&O)–7–6","text":"Uses a variety of mental computation strategies to solve problems (e.g., using compatible numbers, applying properties of operations, using mental imagery, using patterns) and to determine the reasonableness of answers; and mentally calculates benchmark perfect squares and related square roots (e.g., 1², 2² … 12², 15², 20², 25², 100², 1000²); determines the part of a number using benchmark percents and related fractions (1%, 10%, 25%, 33 1/3%, 50%, 66 2/3%, 75%, and 100%) (e.g., 25% of 16; 33 1/3% of 330). (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307FB","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"M(N&O)–7–7","text":"Makes estimates in a given situation (including tips, discounts, and tax) by identifying when estimation is appropriate, selecting the appropriate method of estimation, determining the level of accuracy needed given the situation, analyzing the effect of the estimation method on the accuracy of results, and evaluating the reasonableness of solutions appropriate to grade level GLEs across content strands. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307FC","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"M(N&O)–7–8","text":"Applies properties of numbers (odd, even, remainders, divisibility, and prime factorization) and field properties (commutative, associative, identity, distributive, inverses) to solve problems and to simplify computations, and demonstrates conceptual understanding of field properties as they apply to subsets of the real numbers (e.g., the set of whole numbers does not have additive inverses, the set of integers does not have multiplicative inverses). (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307FD","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"M(N&O)–8–1","text":"Demonstrates conceptual understanding of rational numbers with respect to absolute values, perfect square and cube roots, and percents as a way of describing change (percent increase and decrease) using explanations, models, or other representations. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307FE","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"M(N&O)–8–2","text":"Demonstrates understanding of the relative magnitude of numbers by ordering or comparing rational numbers, common irrational numbers (e.g., √2 , p ), numbers with whole number or fractional bases and whole number exponents, square roots, absolute values, integers, or numbers represented in scientific notation using number lines or equality and inequality symbols. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307FF","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"M(N&O)–8–4","text":"Accurately solves problems involving proportional reasoning (percent increase or decrease, interest rates, markups, or rates); multiplication or division of integers; and squares, cubes, and taking square or cube roots. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130800","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"M(N&O)–8–6","text":"Uses a variety of mental computation strategies to solve problems (e.g., using compatible numbers, applying properties of operations, using mental imagery, using patterns) and to determine the reasonableness of answers; and mentally calculates benchmark perfect squares and related square roots (e.g., 1², 2², … , 12², 15², 20², 25², 100², 1000²); determines the part of a number using benchmark percents and related fractions (1%, 10%, 25%, 33 1/3%, 50%, 66 2/3%, 75%, and 100%) (e.g., 25% of 16; 33 1/3% of 330). (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130801","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"M(N&O)–8–7","text":"Makes estimates in a given situation (including tips, discounts, tax, and the value of a non-perfect square root as between two whole numbers) by identifying when estimation is appropriate, selecting the appropriate method of estimation; determining the level of accuracy needed given the situation; analyzing the effect of the estimation method on the accuracy of results; and evaluating the reasonableness of solutions appropriate to grade level GLEs across content strands. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130802","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"M(N&O)–8–8","text":"Applies properties of numbers (odd, even, remainders, divisibility, and prime factorization) and field properties (commutative, associative, identity [including the multiplicative property of one, e.g., 2<sup>0</sup> x 2³ = 2<sup>0+3</sup> = 2³, so 2<sup>0</sup> = 1], distributive, inverses) to solve problems and to simplify computations, and demonstrates conceptual understanding of field properties as they apply to subsets of real numbers when addition and multiplication are not defined in the traditional ways (e.g., If  a<img src = \"http://purl.org/ASN/resources/images/triangle.gif\" />b = a + b - 1, is <img src = \"http://purl.org/ASN/resources/images/triangle.gif\" /> a commutative operation?) (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130803","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"asn_statementNotation":"M(N&O)–10–2","text":"Demonstrates understanding of the relative magnitude of real numbers by solving problems involving ordering or comparing rational numbers, common irrational numbers (e.g., √2, p), rational bases with integer exponents, square roots, absolute values, integers, or numbers represented in scientific notation using number lines or equality and inequality symbols. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130804","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"asn_statementNotation":"M(N&O)–10–4","text":"Accurately solves problems that involve but are not limited to proportional relationships, percents, ratios, and rates. (The problems might be drawn from contexts outside of and within mathematics including those that cut across content strands or disciplines.) (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130805","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"asn_statementNotation":"M(N&O)–10–6","text":"Uses a variety of mental computation strategies to solve problems. Calculates benchmark perfect squares and related square roots (e.g., 1², 2², …, 12², 15², 20², 25², 100², 1000²). Determines any whole number percentage of a number or any multiples of 100% up to 500%. Determines benchmark fractions of a number. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130806","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"asn_statementNotation":"M(N&O)–10–7","text":"Makes appropriate estimates in a given situation by determining the level of accuracy needed and analyzing the accuracy of results. Estimates tips, discounts, and tax and estimates the value of a non-perfect square root or cube root. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130807","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"asn_statementNotation":"M(N&O)–10–8","text":"Applies properties of numbers to solve problems, to simplify computations, or to compare and contrast the properties of numbers and number systems. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130808","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"M(N&O)–12–1","text":"Demonstrates conceptual understanding of rational numbers by knowing why a real number is rational if and only if the number's decimal expansion eventually repeats or terminates. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130809","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"M(N&O)–12–2","text":"Demonstrates understanding of the relative magnitude of real numbers by solving problems that involve ordering or comparing any subset of the real numbers.(Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113080A","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"M(N&O)–12–4","text":"Accurately solves problems involving scientific notation or uses significant digits to assess the precision of an answer. Interprets rational exponents and their relation to radicals; computes by hand in simple cases (e.g. 4<sup>3/2</sup>), and using a calculator when appropriate. Interprets numbers given in scientific notation and carries out computations of them with and without a calculator. Solves problems involving compound interest. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113080B","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"M(N&O)–12–7","text":"Makes appropriate estimates in a given situation by determining the level of accuracy needed and analyzing the accuracy of results. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113080C","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"M(N&O)–12–8","text":"Applies properties to determine whether a given subset of numbers is closed under a given arithmetic operation. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113080D","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"M(N&O)– AM-1","text":"Demonstrates conceptual understanding of the real number system as an extension of the rational numbers by representing real numbers as infinite decimal expansions (that provide successive rational approximations to the number) and as points on a number line. Determines whether the decimal expansion of a rational number given in fractional form eventually repeats or terminates (without using a calculator). (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113080E","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"M(N&O)–AM –4","text":"Accurately solves problems and demonstrates understanding of complex numbers by interpreting them geometrically and by computing with them ( e, g., adding, multiplying, dividing, finding the nth root, or by finding conjugates). Understands complex numbers as an extension of the real numbers (e.g. arising in solutions of polynomial equations). Manipulates complex numbers using rectangular and polar coordinates. Knows the fundamental theorem of algebra and knows that non-constant polynomials always factor into linear factors over the complex numbers. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113080F","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"M(N&O)–AM–8","text":"Applies properties to add and multiply numerical matrices with attention to the arithmetic properties of these operations. Algebraically and geometrically interpret vectors, vector addition, and scalar multiplication in the plane, with attention to arithmetic properties. Knows and uses the principle of mathematical induction. (Local)"}]},{"leaf":false,"text":"Geometry and Measurement","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113077A","dcterms_educationLevel":[{"prefLabel":"K"}],"asn_statementNotation":"M(G&M)–K–1","text":"Uses properties, attributes, composition, or decomposition to sort or classify polygons (triangles, squares, rectangles, rhombi, trapezoids, and hexagons) or objects by using one non-measurable or measurable attribute; and recognizes, names, and builds polygons and circles in the environment. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113077B","dcterms_educationLevel":[{"prefLabel":"K"}],"asn_statementNotation":"M(G&M)–K–7","text":"Demonstrates conceptual understanding of measurable attributes using comparative language to describe and compare attributes of objects (length [longer, shorter], height [taller, shorter], weight [heavier, lighter], temperature [warmer, cooler], and capacity [more, less]); and compares objects visually and with direct comparison. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113077C","dcterms_educationLevel":[{"prefLabel":"K"}],"asn_statementNotation":"M(G&M)–K–8","text":"Determines elapsed and accrued time as it relates to calendar patterns (days of the week, yesterday, today, and tomorrow), the sequence of events in a day; and identifies a clock and calendar as measurement tools (days of week, months of the year). (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113077D","dcterms_educationLevel":[{"prefLabel":"K"}],"asn_statementNotation":"M(G&M)–K–9","text":"Demonstrates understanding of spatial relationships using location and position by using positional words to locate and describe where an object is found in the environment. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113077E","dcterms_educationLevel":[{"prefLabel":"1"}],"asn_statementNotation":"M(G&M)–1–1","text":"Uses properties, attributes, composition, or decomposition to sort or classify polygons (triangles, squares, rectangles, rhombi, trapezoids, and hexagons) or objects by a combination of two non-measurable or measurable attributes; and recognizes, names, builds, and draws polygons and circles in the environment. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113077F","dcterms_educationLevel":[{"prefLabel":"1"}],"asn_statementNotation":"M(G&M)–1–3","text":"Given an example of a three-dimensional geometric shape (rectangular prisms, cylinders, or spheres) finds examples of objects in the environment that are of the same geometric shape (e.g., show a wooden cylinder and students identify common objects of the same shape). (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130780","dcterms_educationLevel":[{"prefLabel":"1"}],"asn_statementNotation":"M(G&M)–1–4","text":"Demonstrates conceptual understanding of congruency by making mirror images and creating shapes that have line symmetry. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130781","dcterms_educationLevel":[{"prefLabel":"1"}],"asn_statementNotation":"M(G&M)–1–6","text":"Demonstrates conceptual understanding of the length/height of a two-dimensional object using nonstandard units (e.g. comparing objects to trains of small cubes, using iterations of a small unit to measure an object). (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130782","dcterms_educationLevel":[{"prefLabel":"1"}],"asn_statementNotation":"M(G&M)–1–7","text":"Demonstrates conceptual understanding of measurable attributes using comparative language to describe and compare attributes of objects (length [longer, shorter], height [taller, shorter], weight [heavier, lighter], temperature [warmer, cooler], and capacity [more, less]); compares objects visually, with direct comparison, and using non-standard units. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130783","dcterms_educationLevel":[{"prefLabel":"1"}],"asn_statementNotation":"M(G&M)–1–8","text":"Determines elapsed and accrued time as it relates to calendar patterns (days of the week, months of the year), the sequence of events in a day; and recognizes an hour and \"on the 1/2 hour\". (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130784","dcterms_educationLevel":[{"prefLabel":"1"}],"asn_statementNotation":"M(G&M)–1–9","text":"Demonstrates understanding of spatial relationships using location and position by using positional words (e.g., close by, on the right, underneath, above, beyond) to describe one location in reference to another on a map, in a diagram, and in the environment. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130785","dcterms_educationLevel":[{"prefLabel":"2"}],"asn_statementNotation":"M(G&M)–2–1","text":"Uses properties, attributes, composition, or decomposition to sort or classify polygons or objects by a combination of two or more non-measurable or measurable attributes. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130786","dcterms_educationLevel":[{"prefLabel":"2"}],"asn_statementNotation":"M(G&M)–2–4","text":"Demonstrates conceptual understanding of congruency by composing and decomposing two-dimensional objects using models or explanations (e.g., using triangular pattern blocks to construct a figure congruent to the hexagonal pattern block); and uses line symmetry to demonstrate congruent parts within a shape. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130787","dcterms_educationLevel":[{"prefLabel":"2"}],"asn_statementNotation":"M(G&M)–2–6","text":"Demonstrates conceptual understanding of perimeter and area by using models or manipulatives to surround and cover polygons. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130788","dcterms_educationLevel":[{"prefLabel":"2"}],"asn_statementNotation":"M(G&M)–2–7","text":"Measures and uses units of measures appropriately and consistently, and makes conversions within systems when solving problems across the content strands. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130789","dcterms_educationLevel":[{"prefLabel":"2"}],"asn_statementNotation":"M(G&M)–2–9","text":"Demonstrates understanding of spatial relationships using location and position by using positional language in two- and three- dimensional situations to describe and interpret relative positions (e.g., above the surface of the desk, below the triangle on the paper); and creates and interprets simple maps and names locations on simple coordinate grids. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113078A","dcterms_educationLevel":[{"prefLabel":"3"}],"asn_statementNotation":"M(G&M)–3–1","text":"Uses properties or attributes of angles (number of angles) or sides (number of sides or length of sides) or composition or decomposition of shapes to identify, describe, or distinguish among triangles, squares, rectangles, rhombi, trapezoids, hexagons, or circles. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113078B","dcterms_educationLevel":[{"prefLabel":"3"}],"asn_statementNotation":"M(G&M)–3–4","text":"Demonstrates conceptual understanding of congruency by matching congruent figures using reflections, translations, and rotations (flips, slides, and turns) (e.g., recognizing when pentominoes are reflections, translations and rotations of each other); composing and decomposing two- and three-dimensional objects using models or explanations (e.g., Given a cube, students use blocks to construct a congruent cube.); and by using line symmetry to demonstrate congruent parts within a shape. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113078C","dcterms_educationLevel":[{"prefLabel":"3"}],"asn_statementNotation":"M(G&M)–3–5","text":"Demonstrates conceptual understanding of similarity by identifying similar shapes. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113078D","dcterms_educationLevel":[{"prefLabel":"3"}],"asn_statementNotation":"M(G&M)–3–6","text":"Demonstrates conceptual understanding of perimeter of polygons, and the area of rectangles on grids using a variety of models or manipulatives. Expresses all measures using appropriate units. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113078E","dcterms_educationLevel":[{"prefLabel":"3"}],"asn_statementNotation":"M(G&M)–3–7","text":"Measures and uses units of measures appropriately and consistently, and makes conversions within systems when solving problems across the content strands. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113078F","dcterms_educationLevel":[{"prefLabel":"3"}],"asn_statementNotation":"M(G&M)–3–9","text":"Demonstrates understanding of spatial relationships using location and position by interpreting and giving directions from one location to another (e.g., classroom to the gym, from school to home) using positional words; and between locations on a map or coordinate grid (first quadrant) using positional words or compass directions. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130790","dcterms_educationLevel":[{"prefLabel":"3"}],"asn_statementNotation":"M(G&M)–3–10","text":"Demonstrates conceptual understanding of spatial reasoning and visualization by copying, comparing, and drawing models of triangles, squares, rectangles, rhombi, trapezoids, hexagons, and circles; and builds models of rectangular prisms from three-dimensional representations. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130791","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"M(G&M)–4–1","text":"Uses properties or attributes of angles (number of angles) or sides (number of sides, length of sides, parallelism, or perpendicularity) to identify, describe, or distinguish among triangles, squares, rectangles, rhombi, trapezoids, hexagons, or octagons; or classify angles relative to 90° as more than, less than, or equal to. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130792","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"M(G&M)–4–3","text":"Uses properties or attributes (shape of bases or number of lateral faces) to identify, compare, or describe three-dimensional shapes (rectangular prisms, triangular prisms, cylinders, or spheres). (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130793","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"M(G&M)–4–4","text":"Demonstrates conceptual understanding of congruency by matching congruent figures using reflections, translations, or rotations (flips, slides, or turns), or as the result of composing or decomposing shapes using models or explanations. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130794","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"M(G&M)–4–5","text":"Demonstrates conceptual understanding of similarity by applying scales on maps, or applying characteristics of similar figures (same shape but not necessarily the same size) to identify similar figures, or to solve problems involving similar figures. Describes relationships using models or<sup>sc</sup> explanations. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130795","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"M(G&M)–4–6","text":"Demonstrates conceptual understanding of perimeter of polygons, and the area of rectangles, polygons or irregular shapes on grids using a variety of models, manipulatives, or formulas. Expresses all measures using appropriate units. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130796","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"M(G&M)–4–7","text":"Measures and uses units of measures appropriately and consistently, and makes conversions within systems when solving problems across the content strands. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130797","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"M(G&M)–4–9","text":"Demonstrates understanding of spatial relationships using location and position by interpreting and giving directions between locations on a map or coordinate grid (first quadrant); plotting points in the first quadrant in context (e.g., games, mapping); and finding the horizontal and vertical distances between points on a coordinate grid in the first quadrant. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130798","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"M(G&M)–4–10","text":"Demonstrates conceptual understanding of spatial reasoning and visualization by copying, comparing, and drawing models of triangles, squares, rectangles, rhombi, trapezoids, hexagons, octagons, and circles; and builds models of rectangular prisms from two- or three-dimensional representations. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130799","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"M(G&M)–5–1","text":"Uses properties or attributes of angles (right, acute, or obtuse) or sides (number of congruent sides, parallelism, or perpendicularity) to identify, describe, classify, or distinguish among different types of triangles (right, acute, obtuse, equiangular, or equilateral) or quadrilaterals (rectangles, squares, rhombi, trapezoids, or parallelograms). (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113079A","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"M(G&M)–5–3","text":"Uses properties or attributes (shape of bases, number of lateral faces, or number of bases) to identify, compare, or describe three-dimensional shapes (rectangular prisms, triangular prisms, cylinders, spheres, pyramids, or cones). (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113079B","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"M(G&M)–5–5","text":"Demonstrates conceptual understanding of similarity by describing the proportional effect on the linear dimensions of triangles and rectangles when scaling up or down while preserving angle measures, or by solving related problems (including applying scales on maps). Describes effects using models or<sup>sc</sup> explanations. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113079C","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"M(G&M)–5–6","text":"Demonstrates conceptual understanding of perimeter of polygons, and the area of rectangles or right triangles through models, manipulatives, or formulas, the area of polygons or irregular figures on grids, and volume of rectangular prisms (cubes) using a variety of models, manipulatives, or formulas. Expresses all measures using appropriate units. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113079D","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"M(G&M)–5–7","text":"Measures and uses units of measures appropriately and consistently, and makes conversions within systems when solving problems across the content strands. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113079E","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"M(G&M)–5–9","text":"Demonstrates understanding of spatial relationships using location and position by interpreting and giving directions between locations on a map or coordinate grid (all four quadrants); plotting points in four quadrants in context (e.g., games, mapping, identifying the vertices of polygons as they are reflected, rotated, and translated); and determining horizontal and vertical distances between points on a coordinate grid in the first quadrant. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113079F","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"M(G&M)–5–10","text":"Demonstrates conceptual understanding of spatial reasoning and visualization by building models of rectangular and triangular prisms, cones, cylinders, and pyramids from two- or three-dimensional representations. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307A0","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"M(G&M)–6–1","text":"Uses properties or attributes of angles (right, acute, or obtuse) or sides (number of congruent sides, parallelism, or perpendicularity) to identify, describe, classify, or distinguish among different types of triangles (right, acute, obtuse, equiangular, scalene, isosceles, or equilateral) or quadrilaterals (rectangles, squares, rhombi, trapezoids, or parallelograms). (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307A1","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"M(G&M)–6–3","text":"Uses properties or attributes (shape of bases, number of lateral faces, number of bases, number of edges, or number of vertices) to identify, compare, or describe three-dimensional shapes (rectangular prisms, triangular prisms, cylinders, spheres, pyramids, or cones). (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307A2","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"M(G&M)–6–4","text":"Demonstrates conceptual understanding of congruency by predicting and describing the transformational steps (reflections, translations, and rotations) needed to show congruence (including the degree of rotation) and as the result of composing and decomposing two- and three-dimensional objects using models or explanations; and using line and rotational symmetry to demonstrate congruent parts within a shape. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307A3","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"M(G&M)–6–5","text":"Demonstrates conceptual understanding of similarity by describing the proportional effect on the linear dimensions of polygons or circles when scaling up or down while preserving the angles of polygons, or by solving related problems (including applying scales on maps). Describes effects using models or<sup>sc</sup> explanations. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307A4","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"M(G&M)–6–6","text":"Demonstrates conceptual understanding of perimeter of polygons, the area of quadrilaterals or triangles, and the volume of rectangular prisms by using models, formulas, or by solving problems; and demonstrates understanding of the relationships of circle measures (radius to diameter and diameter to circumference) by solving related problems. Expresses all measures using appropriate units. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307A5","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"M(G&M)–6–7","text":"Measures and uses units of measures appropriately and consistently, and makes conversions within systems when solving problems across the content strands. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307A6","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"M(G&M)–7–1","text":"Uses properties of angle relationships resulting from two or three intersecting lines (adjacent angles, vertical angles, straight angles, or angle relationships formed by two non-parallel lines cut by a transversal), or two parallel lines cut by a transversal to solve problems. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307A7","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"M(G&M)–7–2","text":"Applies theorems or relationships (triangle inequality or sum of the measures of interior angles of regular polygons) to solve problems. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307A8","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"M(G&M)–7–4","text":"Applies the concepts of congruency by solving problems on a coordinate plane involving reflections, translations, or rotations. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307A9","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"M(G&M)–7–5","text":"Applies concepts of similarity by solving problems involving scaling up or down and their impact on angle measures, linear dimensions and areas of polygons, and circles when the linear dimensions are multiplied by a constant factor. Describes effects using models or<sup>sc</sup> explanations. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307AA","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"M(G&M)–7–6","text":"Demonstrates conceptual understanding of the area of circles or the area or perimeter of composite figures (quadrilaterals, triangles, or parts of circles), and the surface area of rectangular prisms, or volume of rectangular prisms, triangular prisms, or cylinders using models, formulas, or by solving related problems. Expresses all measures using appropriate units. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307AB","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"M(G&M)–7–10","text":"Demonstrates conceptual understanding of spatial reasoning and visualization by sketching three-dimensional solids; and draws nets of rectangular and triangular prisms, cylinders, and pyramids and uses the nets as a technique for finding surface area. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307AC","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"M(G&M)–8–2","text":"Applies the Pythagorean Theorem to find a missing side of a right triangle, or in problem solving situations. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307AD","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"M(G&M)–8–5","text":"Applies concepts of similarity to determine the impact of scaling on the volume or surface area of three-dimensional figures when linear dimensions are multiplied by a constant factor; to determine the length of sides of similar triangles, or to solve problems involving growth and rate. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307AE","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"M(G&M)–8–6","text":"Demonstrates conceptual understanding of surface area or volume by solving problems involving surface area and volume of rectangular prisms, triangular prisms, cylinders, pyramids, or cones. Expresses all measures using appropriate units. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307AF","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"asn_statementNotation":"M(G&M)–10–2","text":"Creates formal proofs of propositions (e.g. angles, lines, circles, distance, midpoint and polygons including triangle ratios). (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307B0","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"asn_statementNotation":"M(G&M)–10–2","text":"Makes and defends conjectures, constructs geometric arguments, uses geometric properties, or uses theorems to solve problems involving angles, lines, polygons, circles, or right triangle ratios (sine, cosine, tangent) within mathematics or across disciplines or contexts (e.g., Pythagorean Theorem, Triangle Inequality Theorem). (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307B1","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"asn_statementNotation":"M(G&M)–10–4","text":"Applies the concepts of congruency by solving problems on or off a coordinate plane involving reflections, translations, or rotations; or solves problems using congruency involving problems within mathematics or across disciplines or contexts. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307B2","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"asn_statementNotation":"M(G&M)–10–5","text":"Applies concepts of similarity by solving problems within mathematics or across disciplines or contexts. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307B3","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"asn_statementNotation":"M(G&M)–10–6","text":"Solves problems involving perimeter, circumference, or area of two-dimensional figures (including composite figures) or surface area or volume of three-dimensional figures (including composite figures) within mathematics or across disciplines or contexts. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307B4","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"asn_statementNotation":"M(G&M)–10–7","text":"Uses units of measure appropriately and consistently when solving problems across content strands; makes conversions within or across systems and makes decisions concerning an appropriate degree of accuracy in problem situations involving measurement in other GSEs. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307B5","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"asn_statementNotation":"M(G&M)–10–9","text":"Solves problems on and off the coordinate plane involving distance, midpoint, perpendicular and parallel lines, or slope. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307B6","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"asn_statementNotation":"M(G&M)–10–10","text":"Demonstrates conceptual understanding of spatial reasoning and visualization by sketching or using dynamic geometric software to generate three-dimensional objects from two-dimensional perspectives, or to generate two-dimensional perspectives from three- dimensional objects, or by solving related problems. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307B7","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"M(G&M)–12–2","text":"Creates formal proofs of propositions (e.g. angles, lines, circles, distance, midpoint and polygons including triangle congruence and similarity). (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307B8","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"M(G&M)–12–4","text":"Applies the concepts of congruency by using matrices to represent reflections, translations, and rotations. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307B9","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"M(G&M)–12–5","text":"Applies the concepts of similarity of right triangles with the trigonometric functions defined as ratios of sides of triangles, and uses the ratios of the sides of special right triangles (30°-60°-90° and 45°-45°-90°) to determine the sine, cosine and tangent ( 30°,45°, 60°) and solve related problems. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307BA","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"M(G&M)–12–6","text":"Solves problems involving angles, lengths and areas of polygons by applying the trigonometric formulas (law of sines/cosines,A=1/2absinC) ; and applies the appropriate unit of measure. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307BB","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"M(G&M)–12–7","text":"Uses informal concepts of successive approximation, upper and lower bounds, and limits in measurement situations (e.g., use successive approximation to find the area of a pond); uses measurement conversion strategies (e.g., unit/dimensional analysis). (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307BC","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"M(G&M)––12-9","text":"Solves problems involving circles as loci of points in the plane satisfying certain distance requirements, and uses the distance formula to obtain equations for circles. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307BD","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"M(G&M)–12-10","text":"Demonstrates conceptual understanding of spatial reasoning and visualization by performing and justifying constructions with compass and straightedge or dynamic geometric software. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307BE","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"M(G&M)–AM–2","text":"Extends and deepens knowledge and usage of proofs and proof techniques; and uses geometric models to represent and distinguish between Euclidean and non-Euclidean Systems. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307BF","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"M(G&M)–AM–6","text":"Solves problems involving volume using Cavalieri's principle and derives and uses formulas for lengths of arcs and areas of sectors and segments of circles. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307C0","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"M(G&M)-AM-7","text":"Uses radian measure appropriately when solving problems; converts between radian measure and degree measure; and understands why radian measure is useful. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11307C1","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"M(G&M)–AM–9","text":"Solves problems using analytic geometry (including three-dimensions) and circular trigonometry (e.g., find the equation of a circle inscribed in a triangle; find the distance between opposite vertices in a rectangular solid); explores and interprets the characteristics of conic sections graphically and algebraically including understanding how different planar slices of a double cone yield different conic sections; knows the characterization of conic sections as loci of points in the plane satisfying certain distance requirements, and uses the distance formula to obtain equations for the conic sections. (Local)"}]},{"leaf":false,"text":"Functions and Algebra","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130753","dcterms_educationLevel":[{"prefLabel":"K"}],"asn_statementNotation":"M(F&A)–K–1","text":"Identifies and extends to specific cases a variety of patterns (sequences of shapes, sounds, movement, colors, and letters) by extending the pattern to the next one, two or three elements, or by translating AB patterns across formats (e.g., an abb pattern can be represented as snap, clap, clap or red, yellow, yellow) or by identifying number patterns in the environment. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130754","dcterms_educationLevel":[{"prefLabel":"1"}],"asn_statementNotation":"M(F&A)–1–1","text":"Identifies and extends to specific cases a variety of patterns (repeating and growing [numeric and nonnumeric]) represented in models, tables, or sequences by extending the pattern to the next one, two, or three elements, by finding a missing element (e.g., 2, 4, 6, ___, 10), or by translating repeating patterns across formats (e.g., an abb pattern can be represented as snap, clap, clap; or red, yellow, yellow; or 1,2,2). (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130755","dcterms_educationLevel":[{"prefLabel":"1"}],"asn_statementNotation":"M(F&A)–1–4","text":"Demonstrates conceptual understanding of equality by finding the value that will make an open sentence true (e.g., 2+ <img src=\"http://purl.org/ASN/resources/images/square.gif\" /> = 7 ) using models, verbal explanations, or written equations. (limited to one operation and limited to use addition or subtraction) (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130756","dcterms_educationLevel":[{"prefLabel":"2"}],"asn_statementNotation":"M(F&A)–2–1","text":"Identifies and extends to specific cases a variety of patterns (linear and non-numeric) represented in models, tables, or sequences by extending the pattern to the next element, or finding a missing element (e.g., 2, 4, 6, ___, 10). (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130757","dcterms_educationLevel":[{"prefLabel":"2"}],"asn_statementNotation":"M(F&A)–2–4","text":"Demonstrates conceptual understanding of equality by finding the value that will make an open sentence true (e.g., 2+ <img src=\"http://purl.org/ASN/resources/images/square.gif\" /> = 7 ). (limited to one operation and limited to use addition or subtraction) (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130758","dcterms_educationLevel":[{"prefLabel":"3"}],"asn_statementNotation":"M(F&A)–3–1","text":"Identifies and extends to specific cases a variety of patterns (linear and non-numeric) represented in models, tables, or sequences by extending the pattern to the next one, two, or three elements, or finding missing elements. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130759","dcterms_educationLevel":[{"prefLabel":"3"}],"asn_statementNotation":"M(F&A)–3–4","text":"Demonstrates conceptual understanding of equality by showing equivalence between two expressions using models or different representations of the expressions; or by finding the value that will make an open sentence true (e.g., 2+ <img src=\"http://purl.org/ASN/resources/images/square.gif\" /> = 7 ). (limited to one operation and limited to use addition, subtraction, or multiplication) (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113075A","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"M(F&A)–4–1","text":"Identifies and extends to specific cases a variety of patterns (linear and nonlinear) represented in models, tables or sequences; and writes a rule in words orsc symbols to find the next case. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113075B","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"M(F&A)–4–2","text":"Demonstrates conceptual understanding of linear relationships (y = kx) as a constant rate of change by identifying, describing, or comparing situations that represent constant rates of change. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113075C","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"M(F&A)–4–3","text":"Demonstrates conceptual understanding of algebraic expressions by using letters or symbols to represent unknown quantities to write simple linear algebraic expressions involving any one of the four operations; or by evaluating simple linear algebraic expressions using whole numbers. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113075D","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"M(F&A)–4–4","text":"Demonstrates conceptual understanding of equality by showing equivalence between two expressions using models or different representations of the expressions, by simplifying numerical expressions where left to right computations may be modified only by the use of parentheses [e.g., 14 – (2 × 5)] (expressions consistent with the parameters of M(F&A)–4–3), and by solving one-step linear equations of the form ax = c, x ± b = c, where a, b, and c are whole numbers with a ≠ 0. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113075E","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"M(F&A)–5–1","text":"Identifies and extends to specific cases a variety of patterns (linear and nonlinear) represented in models, tables, sequences, or in problem situations; and writes a rule in words or<sup>sc</sup> symbols for finding specific cases of a linear relationship. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113075F","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"M(F&A)–5–2","text":"Demonstrates conceptual understanding of linear relationships (y = kx) as a constant rate of change by identifying, describing, or comparing situations that represent constant rates of change (e.g., tell a story given a line graph about a trip). (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130760","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"M(F&A)–5–3","text":"Demonstrates conceptual understanding of algebraic expressions by using letters to represent unknown quantities to write linear algebraic expressions involving any two of the four operations; or by evaluating linear algebraic expressions using whole numbers. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130761","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"M(F&A)–5–4","text":"Demonstrates conceptual understanding of equality by showing equivalence between two expressions using models or different representations of the expressions (expressions consistent with the parameters of M(F&A)–5–3), by solving one-step linear equations of the form ax = c, x ± b = c, or x/a = c, where a, b, and c are whole numbers with a ≠ 0; or by determining which values of a replacement set make the equation (multi-step of the form ax ± b = c where a, b, and c are whole numbers with a ≠ 0) a true statement (e.g., 2x + 3 = 11, {x: x = 2, 3, 4, 5}). (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130762","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"M(F&A)–6–1","text":"Identifies and extends to specific cases a variety of patterns (linear and nonlinear) represented in models, tables, sequences, graphs, or in problem situations; or writes a rule in words or symbols for finding specific cases of a linear relationship; or writes a rule in words or<sup>sc</sup> symbols for finding specific cases of a nonlinear relationship; and writes an expression or<sup>sc</sup> equation using words or<sup>sc</sup> symbols to express the generalization of a linear relationship (e.g., twice the term number plus 1 or<sup>sc</sup> 2n + 1). (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130763","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"M(F&A)–6–2","text":"Demonstrates conceptual understanding of linear relationships (y = kx; y = mx + b) as a constant rate of change by constructing or interpreting graphs of real occurrences and describing the slope of linear relationships (faster, slower, greater, or smaller) in a variety of problem situations; and describes how change in the value of one variable relates to change in the value of a second variable in problem situations with constant rates of change. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130764","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"M(F&A)–6–3","text":"Demonstrates conceptual understanding of algebraic expressions by using letters to represent unknown quantities to write linear algebraic expressions involving any of the four operations and consistent with order of operations expected at this grade level; or by evaluating linear algebraic expressions (including those with more than one variable); or by evaluating an expression within an equation (e.g., determine the value of y when x = 4 given y = 3x – 2). (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130765","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"M(F&A)–6–4","text":"Demonstrates conceptual understanding of equality by showing equivalence between two expressions using models or different representations of the expressions (expressions consistent with the parameters of M(F&A)–6–3), solving multi-step linear equations of the form ax ± b = c, where a, b, and c are whole numbers with a ≠ 0. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130766","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"M(F&A)–7–1","text":"Identifies and extends to specific cases a variety of patterns (linear and nonlinear) represented in models, tables, sequences, graphs, or in problem situations; and generalizes a linear relationship using words and symbols; generalizes a linear relationship to find a specific case; or writes an expression or<sup>sc</sup> equation using words or<sup>sc</sup> symbols to express the generalization of a nonlinear relationship. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130767","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"M(F&A)–7–2","text":"Demonstrates conceptual understanding of linear relationships (y = kx; y = mx + b) as a constant rate of change by solving problems involving the relationship between slope and rate of change, by describing the meaning of slope in concrete situations, or informally determining the slope of a line from a table or graph; and distinguishes between constant and varying rates of change in concrete situations represented in tables or graphs; or describes how change in the value of one variable relates to change in the value of a second variable in problem situations with constant rates of change. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130768","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"M(F&A)–7–3","text":"Demonstrates conceptual understanding of algebraic expressions by using letters to represent unknown quantities to write algebraic expressions (including those with whole number exponents or more than one variable); or by evaluating algebraic expressions (including those with whole number exponents or more than one variable); or by evaluating an expression within an equation (e.g., determine the value of y when x = 4 given y = 5x³ – 2). (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130769","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"M(F&A)–7–4","text":"Demonstrates conceptual understanding of equality by showing equivalence between two expressions (expressions consistent with the parameters of the left- and right-hand sides of the equations being solved at this grade level) using models or different representations of the expressions, solving multi-step linear equations of the form ax ± b = c with a ≠ 0, ax ± b = cx ± d with a, c ≠ 0, and (x/a) ± b = c with a ≠ 0, where a, b, c and d are whole numbers; or by translating a problem-solving situation into an equation consistent with the parameters of the type of equations being solved for this grade level. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113076A","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"M(F&A)–8–1","text":"Identifies and extends to specific cases a variety of patterns (linear and nonlinear) represented in models, tables, sequences, graphs, or in problem situations; and generalizes a linear relationship (non-recursive explicit equation); generalizes a linear relationship to find a specific case; generalizes a nonlinear relationship using words or<sup>sc</sup> symbols; or generalizes a common nonlinear relationship to find a specific case. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113076B","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"M(F&A)–8–2","text":"Demonstrates conceptual understanding of linear relationships (y = kx; y = mx + b) as a constant rate of change by solving problems involving the relationship between slope and rate of change; informally and formally determining slopes and intercepts represented in graphs, tables, or problem situations; or describing the meaning of slope and intercept in context; and distinguishes between linear relationships (constant rates of change) and nonlinear relationships (varying rates of change) represented in tables, graphs, equations, or problem situations; or describes how change in the value of one variable relates to change in the value of a second variable in problem situations with constant and varying rates of change. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113076C","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"M(F&A)–8–3","text":"Demonstrates conceptual understanding of algebraic expressions by evaluating and simplifying algebraic expressions (including those with square roots, whole number exponents, or rational numbers); or by evaluating an expression within an equation (e.g., determine the value of y when x = 4 given y=7√x+2x). (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113076D","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"M(F&A)–8–4","text":"Demonstrates conceptual understanding of equality by showing equivalence between two expressions (expressions consistent with the parameters of the left- and right-hand sides of the equations being solved at this grade level) using models or different representations of the expressions, solving formulas for a variable requiring one transformation (e.g., d = rt; d/r = t); by solving multi-step linear equations with integer coefficients; by showing that two expressions are or are not equivalent by applying commutative, associative, or distributive properties, order of operations, or substitution; and by informally solving problems involving systems of linear equations in a context. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113076E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"asn_statementNotation":"M(F&A)–10–1","text":"Identifies, extends, and generalizes a variety of patterns (linear and nonlinear) represented by models, tables, sequences, or graphs to solve problems. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113076F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"asn_statementNotation":"M(F&A)–10–2","text":"Demonstrates conceptual understanding of linear and nonlinear functions and relations (including characteristics of classes of functions) through an analysis of constant, variable, or average rates of change, intercepts, domain, range, maximum and minimum values, increasing and decreasing intervals and rates of change (e.g., the height is increasing at a decreasing rate); describes how change in the value of one variable relates to change in the value of a second variable; or works between and among different representations of functions and relations (e.g., graphs, tables, equations, function notation). (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130770","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"asn_statementNotation":"M(F&A)–10–3","text":"Demonstrates conceptual understanding of algebraic expressions by solving problems involving algebraic expressions, by simplifying expressions (e.g., simplifying polynomial or rational expressions, or expressions involving integer exponents, square roots, or absolute values), by evaluating expressions, or by translating problem situations into algebraic expressions. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130771","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"asn_statementNotation":"M(F&A)–10–4","text":"Demonstrates conceptual understanding of equality by solving problems involving algebraic reasoning about equality; by translating problem situations into equations; by solving linear equations (symbolically and graphically) and expressing the solution set symbolically or graphically, or provides the meaning of the graphical interpretations of solution(s) in problem-solving situations; or by solving problems involving systems of linear equations in a context (using equations or graphs) or using models or representations. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130772","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"M(F&A)–12-1","text":"Identifies arithmetic and geometric sequences and finds the nth term; then uses the generalization to find a specific term. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130773","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"M(F&A)–12-2","text":"Demonstrates conceptual understanding of linear and nonlinear functions and relations by representing and analyzing functions in several ways; recognizing properties of functions and characteristics properties of families of functions; applying knowledge of functions to interpret, model, and solve problems; analyzing characteristics of classes of functions (polynomial, rational, and exponential) to include domain, range, intercepts, increasing and decreasing intervals and rates of change; representing functions numerically, algebraically, graphically, and verbally (i.e. in written words), recognizing properties of a function from these representations, and transfers information from one representation to another; graphing polynomial, rational and exponential functions, including vertical and horizontal shifts, stretches, and compressions as well as reflections across vertical and horizontal axes; applying knowledge of functions to interpret and understand situations, design mathematical models, and solve problems in mathematics as well as in natural and social sciences. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130774","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"M(F&A)–12–3","text":"Demonstrates conceptual understanding of algebraic expressions by manipulating, evaluating, and simplifying algebraic and numerical expressions; adding, subtracting, multiplying and dividing polynomials; adding, subtracting, multiplying and dividing rational expressions; simplifying complex fractions; factoring quadratic and higher degree polynomials, including difference of squares; applying properties of logarithms (e.g., log<sub>a</sub>b<sup>n</sup>=nlog<sub>a</sub>ba<sup>logab=b</sup>) and converting between logarithmic and exponential forms; manipulating, evaluating, and simplifying expressions involving rational exponents and radicals and converting between expressions with rational exponents and expressions with radicals. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130775","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"M(F&A)–12–4","text":"Demonstrates conceptual understanding of equality by solving equations and systems of equations or inequalities and interpreting the solutions algebraically and graphically; by factoring, completing the square, using the quadratic formula, and graphing quadratic functions to solve quadratic equations; solving and interpreting solutions of equations involving polynomial, rational, and radical expressions; analyzing the effect of simplifying radical or rational expressions on the solution set of equations involving such expressions. (e.g. x^2/x =x for x ≠0); finding approximate solutions to equations by graphing each side as a function using technology. [Understand that any equation in x can be interpreted as the equation f(x) = g(x) and interpret the solutions of the equation as the x-value(s) of the intersection point(s) of the graphs of y = f(x) and y = g(x).]; solving 2x2 and 3x3 systems of linear equations and graphically interprets the solutions; solving systems of linear and quadratic inequalities; solving and graphically interpreting solutions systems of equations involving nonlinear expressions. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130776","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"M(F&A)–AM-1","text":"Identifies and computes partial sums of infinite arithmetic and geometric sequences, determines when an infinite geometric series converges, and finds its sum. Connects arithmetic and geometric sequences to linear and exponential functions, respectively. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130777","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"M(F&A)––AM-2","text":"Demonstrates conceptual understanding of linear and nonlinear functions and relations from a set-theoretic perspective, and operations on functions including composition and inverse including computing inverses algebraically; analyzing characteristics of classes of functions and inverse functions (exponential, logarithmic, trigonometric) to include domain, range, intercepts, increasing and decreasing intervals and rates of change, periodicity, end behavior, maximum and minimum values, continuity, and asymptotes; analyzing properties of functions including injectivity (1-1), surjectivity (onto), critical points and inflection points. Determine graphically and analytically whether a function is even, odd or neither; analyzing informally the idea of continuity and limits; recognizing properties of families of functions including logarithmic and trigonometric, and graphs them; analyzing domain restriction and the effects of it on the function and its properties. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130778","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"M(F&A)–AM–3","text":"Demonstrates conceptual understanding of algebraic expressions by using the remainder theorem, the factor theorem and rational root theorem for polynomials; by factoring polynomials over integer, rational, real and complex numbers. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130779","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"M(F&A)–AM–4","text":"Demonstrates conceptual understanding of equality by solving equations and verifying identities involving trigonometric expressions; solving, graphing and interpreting equations involving exponential and logarithmic expressions; interpreting systems as matrix equations and solving them by computing the appropriate matrix inverse and multiplication, with or without technology; applying the intermediate value theorem to find exact or approximate solutions of equations or zeros of continuous functions. (Local)"}]},{"leaf":false,"text":"Data, Statistics, and Probability","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113070F","dcterms_educationLevel":[{"prefLabel":"K"}],"asn_statementNotation":"M(DSP)–K–1","text":"Interprets a given representation created by the class (models and tally charts) to answer questions related to the data, or to analyze the data to formulate conclusions using words, diagrams, or verbal/scribed responses to express answers. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130710","dcterms_educationLevel":[{"prefLabel":"K"}],"asn_statementNotation":"M(DSP)–K–2","text":"Analyzes patterns, trends, or distributions in data in a variety of contexts by determining or using more, less, or equal (e.g., Have there been more, less, or the same number of cloudy days compared to sunny days this week?). (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130711","dcterms_educationLevel":[{"prefLabel":"1"}],"asn_statementNotation":"M(DSP)–1–1","text":"Interprets a given representation created by the class (models, tally charts, pictographs with one-to-one correspondence, and tables) to answer questions related to the data, or to analyze the data to formulate conclusions using words, diagrams, or verbal/scribed responses to express answers. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130712","dcterms_educationLevel":[{"prefLabel":"1"}],"asn_statementNotation":"M(DSP)–1–2","text":"Analyzes patterns, trends, or distributions in data in a variety of contexts by determining or using more, less, or equal. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130713","dcterms_educationLevel":[{"prefLabel":"1"}],"asn_statementNotation":"M(DSP)–1–5","text":"For a probability event in which the sample space may or may not contain equally likely outcomes, groups use experiments to describes the likelihood or chance of an event (using \"more likely,\" \"less likely\", or \"equally likely\"). (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130714","dcterms_educationLevel":[{"prefLabel":"2"}],"asn_statementNotation":"M(DSP)–2–1","text":"Interprets a given representation (pictographs with one-to-one correspondence, line plots, tally charts, or tables) to answer questions related to the data, or to analyze the data to formulate conclusions. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130715","dcterms_educationLevel":[{"prefLabel":"2"}],"asn_statementNotation":"M(DSP)–2–2","text":"Analyzes patterns, trends, or distributions in data in a variety of contexts by determining or using more, less, or equal. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130716","dcterms_educationLevel":[{"prefLabel":"2"}],"asn_statementNotation":"M(DSP)–2–4","text":"Uses counting techniques to solve problems involving combinations using a variety of strategies (e.g., student diagrams, organized lists, tables, tree diagrams, orsc others); (e.g., How many ways can you make 50 cents using nickels, dimes, and quarters?) (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130717","dcterms_educationLevel":[{"prefLabel":"2"}],"asn_statementNotation":"M(DSP)–2–5","text":"For a probability event in which the sample space may or may not contain equally likely outcomes, uses experiments to describe the likelihood or chance of an event using \"more likely,\" \"less likely,\" \"equally likely,\" certain or impossible. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130718","dcterms_educationLevel":[{"prefLabel":"2"}],"asn_statementNotation":"M(DSP)–2–6","text":"In response to a teacher or student generated question or hypothesis, groups decide the most effective method (e.g., survey, observation, experimentation) to collect the data (numerical or categorical) necessary to answer the question; collects, organizes, and appropriately displays the data; analyzes the data to draw conclusions about the question or hypothesis being tested, and when appropriate makes predictions. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130719","dcterms_educationLevel":[{"prefLabel":"3"}],"asn_statementNotation":"M(DSP)–3–1","text":"Interprets a given representation (line plots, tally charts, tables, or bar graphs) to answer questions related to the data, to analyze the data to formulate conclusions, or to make predictions. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113071A","dcterms_educationLevel":[{"prefLabel":"3"}],"asn_statementNotation":"M(DSP)–3–2","text":"Analyzes patterns, trends, or distributions in data in a variety of contexts by determining or using most frequent (mode), least frequent, largest, or smallest. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113071B","dcterms_educationLevel":[{"prefLabel":"3"}],"asn_statementNotation":"M(DSP)–3–3","text":"Organizes and displays data using tables, tally charts, and bar graphs, to answer questions related to the data, to analyze the data to formulate conclusions, to make predictions, or to solve problems. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113071C","dcterms_educationLevel":[{"prefLabel":"3"}],"asn_statementNotation":"M(DSP)–3–3","text":"Identifies or describes representations or elements of representations that best display a given set of data or situation, consistent with the representations required in M(DSP)–3–1. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113071D","dcterms_educationLevel":[{"prefLabel":"3"}],"asn_statementNotation":"M(DSP)–3–4","text":"Uses counting techniques to solve problems involving combinations and simple permutations using a variety of strategies (e.g., student diagrams, organized lists, tables, tree diagrams, or<sup>sc</sup> others). (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113071E","dcterms_educationLevel":[{"prefLabel":"3"}],"asn_statementNotation":"M(DSP)–3–5","text":"For a probability event in which the sample space may or may not contain equally likely outcomes, predicts the likelihood of an event using \"more likely,\" \"less likely,\" \"equally likely,\" certain, or impossible and tests the prediction through experiments; and determines if a game is fair. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113071F","dcterms_educationLevel":[{"prefLabel":"3"}],"asn_statementNotation":"M(DSP)–3–5","text":"For a probability event in which the sample space may or may not contain equally likely outcomes, determines the likelihood of the occurrence of an event (using \"more likely\", \"less likely\", or \"equally likely\"). (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130720","dcterms_educationLevel":[{"prefLabel":"3"}],"asn_statementNotation":"M(DSP)–3–6","text":"In response to a teacher or student generated question or hypothesis, groups decide the most effective method (e.g., survey, observation, experimentation) to collect the data (numerical or categorical) necessary to answer the question; collects, organizes, and appropriately displays the data; analyzes the data to draw conclusions about the question or hypothesis being tested, and when appropriate makes predictions. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130721","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"M(DSP)–4–1","text":"Interprets a given representation (line plots, tables, bar graphs, pictographs, or circle graphs) to answer questions related to the data, to analyze the data to formulate or justify conclusions, to make predictions, or to solve problems. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130722","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"M(DSP)–4–2","text":"Analyzes patterns, trends, or distributions in data in a variety of contexts by determining or using measures of central tendency (median or mode), or range. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130723","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"M(DSP)–4–3","text":"Organizes and displays data using tables, line plots, bar graphs, and pictographs to answer questions related to the data, to analyze the data to formulate or justify conclusions, to make predictions, or to solve problems. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130724","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"M(DSP)–4–4 Uses counting techniques to solve problems in context involving combinations or simple permutations (e.g., Given a map – Determine the number of paths from point A to point B.) using a variety of strategies (e.g., organized lists, tables, tree diagrams, or<sup>sc</sup> others). (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130725","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"M(DSP)–4–5","text":"For a probability event in which the sample space may or may not contain equally likely outcomes, predicts the likelihood of an event as a part to whole relationship (e.g., two out of five, zero out of five, five out of five) and tests the prediction through experiments; and determines if a game is fair. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130726","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"M(DSP)–4–5","text":"For a probability event in which the sample space may or may not contain equally likely outcomes, determines the theoretical probability of an event and expresses the result as part to whole (e.g., two out of five). (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130727","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"M(DSP)–4–6","text":"In response to a teacher or student generated question or hypothesis, groups decide the most effective method (e.g., survey, observation, experimentation) to collect the data (numerical or categorical) necessary to answer the question; collects, organizes, and appropriately displays the data; analyzes the data to draw conclusions about the question or hypothesis being tested, and when appropriate makes predictions; and asks new questions and makes connections to real world situations. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130728","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"M(DSP)–5–1","text":"Interprets a given representation (tables, bar graphs, circle graphs, or line graphs) to answer questions related to the data, to analyze the data to formulate or justify conclusions, to make predictions, or to solve problems. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130729","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"M(DSP)–5–2","text":"Analyzes patterns, trends, or distributions in data in a variety of contexts by determining or using measures of central tendency (mean, median, or mode) or range to analyze situations, or to solve problems. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113072A","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"M(DSP)–5–3","text":"Organizes and displays data using tables, bar graphs, or line graphs to answer questions related to the data, to analyze the data to formulate or justify conclusions, to make predictions, or to solve problems. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113072B","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"M(DSP)–5–3","text":"Identifies or describes representations or elements of representations that best display a given set of data or situation, consistent with the representations required in M(DSP)–5–1. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113072C","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"M(DSP)–5–5","text":"For a probability event in which the sample space may or may not contain equally likely outcomes, predicts the likelihood of an event as a fraction and tests the prediction through experiments; and determines if a game is fair. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113072D","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"M(DSP)–5–5","text":"For a probability event in which the sample space may or may not contain equally likely outcomes, determines the experimental or theoretical probability of an event and expresses the result as a fraction. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113072E","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"M(DSP)–5–6","text":"In response to a teacher or student generated question or hypothesis decides the most effective method (e.g., survey, observation, experimentation) to collect the data (numerical or categorical) necessary to answer the question; collects, organizes, and appropriately displays the data; analyzes the data to draw conclusions about the question or hypothesis being tested, and when appropriate makes predictions; and asks new questions and makes connections to real world situations. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113072F","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"M(DSP)–6–1","text":"Interprets a given representation (circle graphs, line graphs, or stem-and-leaf plots) to answer questions related to the data, to analyze the data to formulate or justify conclusions, to make predictions, or to solve problems. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130730","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"M(DSP)–6–2","text":"Analyzes patterns, trends or distributions in data in a variety of contexts by determining or using measures of central tendency (mean, median, or mode) or dispersion (range) to analyze situations, or to solve problems. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130731","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"M(DSP)–6–3","text":"Organizes and displays data using tables, line graphs, or stem-and-leaf plots to answer questions related to the data, to analyze the data to formulate or justify conclusions, to make predictions, or to solve problems. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130732","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"M(DSP)–6–4","text":"Uses counting techniques to solve problems in context involving combinations or simple permutations using a variety of strategies (e.g., organized lists, tables, tree diagrams, models, Fundamental Counting Principle, or<sup>sc</sup> others). (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130733","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"M(DSP)–6–5","text":"For a probability event in which the sample space may or may not contain equally likely outcomes, predicts the theoretical probability of an event and tests the prediction through experiments and simulations; and designs fair games. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130734","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"M(DSP)–6–5","text":"For a probability event in which the sample space may or may not contain equally likely outcomes, determines the experimental or theoretical probability of an event in a problem-solving situation. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130735","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"M(DSP)–6–6","text":"In response to a teacher or student generated question or hypothesis decides the most effective method (e.g., survey, observation, experimentation) to collect the data (numerical or categorical) necessary to answer the question; collects, organizes, and appropriately displays the data; analyzes the data to draw conclusions about the question or hypothesis being tested, and when appropriate makes predictions; and asks new questions and makes connections to real world situations. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130736","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"M(DSP)–7–1","text":"Interprets a given representation (circle graphs, scatter plots that represent discrete linear relationships, or histograms) to analyze the data to formulate or justify conclusions, to make predictions, or to solve problems. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130737","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"M(DSP)–7–2","text":"Analyzes patterns, trends, or distributions in data in a variety of contexts by solving problems using measures of central tendency (mean, median, or mode), dispersion (range or variation), or outliers to analyze situations to determine their effect on mean, median, or mode; and evaluates the sample from which the statistics were developed (bias). (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130738","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"M(DSP)–7–3","text":"Organizes and displays data using tables, line graphs, scatter plots, and circle graphs to answer questions related to the data, to analyze the data to formulate or justify conclusions, to make predictions, or to solve problems. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130739","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"M(DSP)–7–3","text":"Identifies or describes representations or elements of representations that best display a given set of data or situation, consistent with the representations required in M(DSP)–7–1. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113073A","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"M(DSP)–7–4","text":"Uses counting techniques to solve problems in context involving combinations or permutations (e.g., How many different ways can eight students place first, second, and third in a race?) using a variety of strategies (e.g., organized lists, tables, tree diagrams, models, Fundamental Counting Principle, or<sup>sc</sup> others). (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113073B","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"M(DSP)–7–5","text":"For a probability event in which the sample space may or may not contain equally likely outcomes, predicts the theoretical probability of an event and tests the prediction through experiments and simulations; and compares and contrasts theoretical and experimental probabilities.(Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113073C","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"M(DSP)–7–5","text":"For a probability event in which the sample space may or may not contain equally likely outcomes, determines the experimental or theoretical probability of an event in a problem-solving situation. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113073D","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"M(DSP)–7–6","text":"In response to a teacher or student generated question or hypothesis decides the most effective method (e.g., survey, observation, experimentation) to collect the data (numerical or categorical) necessary to answer the question; collects, organizes, and appropriately displays the data; analyzes the data to draw conclusions about the question or hypothesis being tested while considering the limitations that could affect interpretations; and when appropriate makes predictions; and asks new questions and makes connections to real world situations. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113073E","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"M(DSP)–8–1","text":"Interprets a given representation (line graphs, scatter plots, histograms, or box-and-whisker plots) to analyze the data to formulate or justify conclusions, to make predictions, or to solve problems. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113073F","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"M(DSP)–8–2","text":"Analyzes patterns, trends, or distributions in data in a variety of contexts by determining or using measures of central tendency (mean, median, or mode), dispersion (range or variation), outliers, quartile values, or estimated line of best fit to analyze situations, or to solve problems; and evaluates the sample from which the statistics were developed (bias, random, or non-random). (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130740","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"M(DSP)–8–3","text":"Organizes and displays data using scatter plots to answer questions related to the data, to analyze the data to formulate or justify conclusions, to make predictions, or to solve problems; or identifies representations or elements of representations that best display a given set of data or situation, consistent with the representations required in M(DSP)–8–1. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130741","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"M(DSP)–8–4","text":"Uses counting techniques to solve problems in context involving combinations or permutations using a variety of strategies (e.g., organized lists, tables, tree diagrams, models, Fundamental Counting Principle, or<sup>sc</sup> others). (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130742","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"M(DSP)–8–5","text":"For a probability event in which the sample space may or may not contain equally likely outcomes, determines the experimental or theoretical probability of an event in a problem-solving situation; and predicts the theoretical probability of an event and tests the prediction through experiments and simulations; and compares and contrasts theoretical and experimental probabilities. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130743","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"M(DSP)–8–6","text":"In response to a teacher or student generated question or hypothesis decides the most effective method (e.g., survey, observation, experimentation) to collect the data (numerical or categorical) necessary to answer the question; collects, organizes, and appropriately displays the data; analyzes the data to draw conclusions about the question or hypothesis being tested while considering the limitations that could affect interpretations; and when appropriate makes predictions; and asks new questions and makes connections to real world situations. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130744","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"asn_statementNotation":"M(DSP)–10–1","text":"Interprets a given representation (e.g., box-and-whisker plots, scatter plots, bar graphs, line graphs, circle graphs, histograms, frequency charts) to make observations, to answer questions, to analyze the data to formulate or justify conclusions, critique conclusions, make predictions, or to solve problems within mathematics or across disciplines or contexts (e.g. media, workplace, social and environmental situations). (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130745","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"asn_statementNotation":"M(DSP)–10–2","text":"Analyzes patterns, trends, or distributions in data in a variety of contexts by determining, using, or analyzing measures of central tendency (mean, median, or mode), dispersion (range or variation), outliers, quartile values, estimated line of best fit, regression line, or correlation (strong positive, strong negative, or no correlation) to solve problems; and solve problems involving conceptual understanding of the sample from which the statistics were developed. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130746","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"asn_statementNotation":"M(DSP)–10–3","text":"Identifies or describes representations or elements of representations that best display a given set of data or situation, consistent with the representations required in M(DSP)–10–1. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130747","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"M(DSP)–10–4 Uses counting techniques to solve contextualized problems involving combinations or permutations (e.g., organized lists, tables, tree diagrams, models, Fundamental Counting Principle, or<sup>sc</sup> others). (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130748","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"asn_statementNotation":"M(DSP)–10–5","text":"Solves problems involving experimental or theoretical probability. (State)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130749","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"asn_statementNotation":"M(DSP)–10–6","text":"In response to a teacher or student generated question or hypothesis decides the most effective method (e.g., survey, observation, research, experimentation) and sampling techniques (e.g., random sample, stratified random sample) to collect the data necessary to answer the question; collects, organizes, and appropriately displays the data; analyzes the data to draw conclusions about the questions or hypotheses being tested while considering the limitations of the data that could effect interpretations; and when appropriate makes predications, asks new questions, or makes connections to real-world situations. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113074A","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"M(DSP)-12-1","text":"Interprets a given representation(s) (e.g., regression function including linear, quadratic, and exponential) to analyze the data to make inferences and to formulate, justify, and critique conclusions. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113074B","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"M(DSP)-12-2","text":"Analyzes patterns, trends, or distributions in data in a variety of contexts by calculating and analyzing measures of dispersion (standard deviation, variance, and percentiles). (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113074C","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"M(DSP)-12-3","text":"Organizes and displays one- and two-variable data using a variety of representations (e.g., box-and-whisker plots, scatter plots, bar graphs, line graphs, circle graphs, histograms, frequency charts, linear, quadratic, and exponential regression functions) to analyze the data to formulate or justify conclusions, make predictions, or to solve problems with or without using technology. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113074D","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"M(DSP)-12-4","text":"Uses counting techniques to solve problems in context involving combination or permutations using a variety of strategies (e.g., nCr, nPr, or n!); and finds unions, intersections, and complements of sets. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113074E","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"M(DSP)-12-5","text":"For a probability event in which the sample space may or may not contain equally likely outcomes, predicts the theoretical probability of an event and tests the prediction through experiments and simulations; compares and contrasts theoretical and experimental probabilities; finds the odds of an event and understands the relationship between probability and odds. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113074F","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"M(DSP)-12-6","text":"In response to a teacher or student generated question or hypothesis decides the most effective method (e.g., survey, observation, research, experimentation) and sampling techniques (e.g., random sample, stratified random sample) to collect the data necessary to answer the question; collects, organizes, and appropriately displays the data; analyzes the data to draw conclusions about the questions or hypotheses being tested while considering the limitations of the data that could effect interpretations; and when appropriate makes predications, asks new questions, or makes connections to real-world situations. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130750","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"M(DSP)-AM-2","text":"Analyzes and interprets measures of dispersion (standard deviation, variance, and percentiles) and central tendency for the normal distribution; and interprets the correlation coefficient and the coefficient of determination in the context of data. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130751","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"M(DSP)-AM-3","text":"Uses technology to explore the method of least squares and median-median for linear regression. (Local)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130752","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"M(DSP)-AM-5","text":"Solves probability problems (e.g., by applying concepts of counting, random variables, independence/dependence of events, and conditional probability). (Local)"}]},{"leaf":false,"text":"Problem Solving, Reasoning, and Proof","children":[{"leaf":false,"text":"Students will use problem-solving strategies to investigate and understand increasingly complex mathematical content and be able to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11306F0","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"<ul><li>Formulate and solve multi-step problems from everyday and mathematical situations.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11306F1","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"<ul><li>Solve problems using a variety of strategies (e.g., working backwards, looking for patterns and relationships; guess and check; making tables, charts, or organized lists; solving a simpler version of a problem, drawing a diagram; or creating a model)</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11306F2","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"<ul><li>Verify and interpret results with respect to the original problem.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11306F3","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"<ul><li>Determine if the solution of a problem is reasonable.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11306F4","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"<ul><li>Solve problems using manipulatives, graphs, charts, diagrams, and calculators.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11306F5","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"<ul><li>Demonstrate that a problem may be solved in more than one way.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11306F6","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"<ul><li>Exhibit confidence in their ability to solve problems independently and in groups.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11306F7","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"<ul><li>Display increasing perseverance, and persistence in problem solving.</li></ul>"}]},{"leaf":false,"text":"Students will use mathematical reasoning and proof and be able to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11306F8","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"<ul><li>Use models, known facts, properties, and relationships to explain their thinking.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11306F9","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"<ul><li>Justify solution processes and answers (e.g., \"I chose this method to solve the problem because...\").</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11306FA","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"<ul><li>Draw conclusions using inductive reasoning.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11306FB","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"<ul><li>Identify the missing information needed to find a solution to a given story problem.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11306FC","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"<ul><li>Use patterns and relationships to analyze mathematical situations (e.g., count by fives).</li></ul>"}]},{"leaf":false,"text":"Students will use problem-solving strategies to investigate and understand increasingly complex mathematical content and be able to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11306FD","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"<ul><li>Determine the reasonableness of solutions to real-world problems.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11306FE","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"<ul><li>Generalize solutions and apply strategies to new problem situations.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11306FF","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"<ul><li>Add to the repertoire of problem-solving strategies (e.g., looking for similar problems) and use those strategies in more sophisticated ways.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130700","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"<ul><li>Solve problems with multiple solutions, recognize when a problem has no solution, and recognize problems where more information is needed.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130701","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"<ul><li>Translate results of a computation into solutions that fit the real-world problem (e.g., when a computation shows that one needs 3.2 gallons of paint to paint a room, how much paint do you buy?).</li></ul>"}]},{"leaf":false,"text":"Students will use mathematical reasoning and proof and be able to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130702","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"<ul><li>Draw conclusions and solve problems using elementary deductive reasoning and reasoning by analogy.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130703","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"<ul><li>Make and defend conjectures and generalizations.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130704","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"<ul><li>Use models, known facts, properties, and relationships to explain thinking and to justify answers and solution processes.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130705","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"<ul><li>Recognize the pervasive use and power of reasoning as a part of mathematics.</li></ul>"}]},{"leaf":false,"text":"Students will use problem-solving strategies to investigate and understand increasingly complex mathematical content and be able to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130706","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"<ul><li>Use problem-solving strategies appropriately and effectively for a given situation.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130707","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"<ul><li>Determine, collect and organize the relevant information needed to solve real-world problems.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130708","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"<ul><li>Apply integrated problem-solving strategies to solve problems in the physical, natural, and social sciences and in pure mathematics.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1130709","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"<ul><li>Use technology when appropriate to solve problems.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113070A","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"<ul><li>Reflect on solutions and the problem-solving process for a given situation and refine strategies as needed.</li></ul>"}]},{"leaf":false,"text":"Students will use mathematical reasoning and proof and be able to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113070B","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"<ul><li>Draw logical conclusions and make generalizations using deductive and inductive reasoning.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113070C","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"<ul><li>Formulate, test, and justify mathematical conjectures and arguments.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113070D","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"<ul><li>Construct and determine the validity of a mathematical argument or a solution.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113070E","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"<ul><li>Apply mathematical reasoning skills in other disciplines.</li></ul>"}]}]},{"leaf":false,"text":"Communication, Connections, and Representations","children":[{"leaf":false,"text":"Students will communicate their understanding of mathematics and be able to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11306C7","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"<ul><li>Demonstrate mathematical communication through discussion, reading, writing, listening, and responding, individually and in groups.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11306C8","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"<ul><li>Discuss relationships between everyday language and mathematical language and symbols (e.g., words that mean something different in mathematics and in everyday life).</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11306C9","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"<ul><li>Explain conclusions, thought processes, and strategies in problem-solving situations.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11306CA","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"<ul><li>Discuss, illustrate, and write about mathematical concepts and relationships.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11306CB","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"<ul><li>Draw pictures and use objects to illustrate mathematical concepts.</li></ul>"}]},{"leaf":false,"text":"Students will create and use representations to communicate mathematical ideas and to solve problems and be able to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11306CC","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"<ul><li>Create and use age level appropriate representations to organize, record, and communicate mathematical ideas (e.g., students should recognize the relationship among seven counters, seven tally marks, and the symbol 7).</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11306CD","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"<ul><li>Select, apply, and translate among mathematical representations to solve problems (e.g., representing fractions with circles, with geoboards, and with pattern blocks).</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11306CE","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"<ul><li>Link different representations.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11306CF","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"<ul><li>Use representations to model and interpret physical, social, and mathematical phenomena.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11306D0","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"<ul><li>Use conventional and self-generated (invented) representations and connect them.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11306D1","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"<ul><li>Realize that any representation is subject to multiple interpretations (e.g., drawings and graphs can be read in a different way).</li></ul>"}]},{"leaf":false,"text":"Students will recognize, explore, and develop mathematical connections and be able to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11306D2","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"<ul><li>Link conceptual and procedural knowledge (e.g., they will know that when they \"regroup,\" they are simply changing the representation of the minuend, but not its value).</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11306D3","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"<ul><li>Recognize and use mathematics in other curriculum areas (e.g., science, social studies).</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11306D4","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"<ul><li>Recognize and use mathematics in their daily lives (e.g., graphs, tables, or maps).</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11306D5","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"<ul><li>Identify mathematical situations occurring in literature for children.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11306D6","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"<ul><li>Identify examples of geometry in nature, art, and architecture.</li></ul>"}]},{"leaf":false,"text":"Students will communicate their understanding of mathematics and be able to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11306D7","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"<ul><li>Discuss mathematical ideas and write convincing arguments.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11306D8","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"<ul><li>Understand, explain, analyze, and evaluate mathematical arguments and conclusions presented by others.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11306D9","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"<ul><li>Ask clarifying and extending questions related to mathematics they have heard or read about.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11306DA","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"<ul><li>Understand and appreciate the economy and power of mathematical symbolism and its role in the development of mathematics.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11306DB","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"<ul><li>Demonstrate an understanding of mathematical concepts and relationships through a variety of methods (e.g., writing, graphing, charts, diagrams, number sentences, or symbols).</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11306DC","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"<ul><li>Use a variety of technologies (e.g., computers, calculators, video, probes) to represent and communicate mathematical ideas.</li></ul>"}]},{"leaf":false,"text":"Students will create and use representations to communicate mathematical ideas and to solve problems and be able to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11306DD","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"<ul><li>Use physical models and diagrams to represent important mathematical ideas (e.g., multiplication).</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11306DE","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"<ul><li>Use appropriate representations to solve problems or to portray, clarify, or extend a mathematical idea.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11306DF","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"<ul><li>Recognize equivalent representations of concepts and procedures and translate among them as appropriate (for example, understand how the addition of whole numbers, fractions, and decimals are related).</li></ul>"}]},{"leaf":false,"text":"Students will recognize, explore, and develop mathematical connections and be able to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11306E0","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"<ul><li>See mathematics as an integrated whole.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11306E1","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"<ul><li>Recognize relationships among different topics in mathematics.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11306E2","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"<ul><li>Recognize and use mathematics in other curriculum areas and in their daily lives.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11306E3","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"<ul><li>Link concepts and procedures.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11306E4","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"<ul><li>Use mathematical skills, concepts, and applications in other disciplines (e.g., graphs in social studies, patterns in art, or music and geometry in technology education).</li></ul>"}]},{"leaf":false,"text":"Students will communicate their understanding of mathematics and be able to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11306E5","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"<ul><li>Articulate ideas clearly and logically in both written and oral form.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11306E6","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"<ul><li>Present, share, explain, and justify thinking with others and build upon the ideas of others to solve problems.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11306E7","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"<ul><li>Use mathematical symbols and notation.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11306E8","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"<ul><li>Formulate questions, conjectures, definitions, and generalizations about data, information, and problem situations.</li></ul>"}]},{"leaf":false,"text":"Students will create and use representations to communicate mathematical ideas and to solve problems and be able to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11306E9","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"<ul><li>Use models and technology to develop equivalent representations of the same mathematical concept.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11306EA","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"<ul><li>Use and create representations to solve problems and organize their thoughts and ideas.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11306EB","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"<ul><li>Convert between representations (e.g., a table of values, an equation, and a graph may all be representations of the same function).</li></ul>"}]},{"leaf":false,"text":"Students will recognize, explore, and develop mathematical connections and be able to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11306EC","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"<ul><li>Connect new mathematical ideas to those already studied and build upon them.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11306ED","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"<ul><li>Understand that many real-world applications require an understanding of mathematical concepts (e.g., personal finance, running a business, building a house, following a recipe, or sending a rocket to the moon).</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11306EE","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"<ul><li>Explain in oral and written form the relationships between a real-world problem and an appropriate mathematical model.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11306EF","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"<ul><li>Explain in oral and written form the relationships among various mathematical concepts (e.g., the relationship between exponentiation and multiplication).</li></ul>"}]}]}]