[{"leaf":false,"text":"A. The Nature of Technology","children":[{"leaf":false,"text":"Technology and Science","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1014046","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"By the end of the 2nd grade all students will know that --<br /> Tools are used to do things better or more easily and to do some things that could not otherwise be done at all. In technology, tools are used to observe, measure, and make things."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1012F68","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"By the end of the 2nd grade all students will know that --<br /> When trying to build something or to get something to work better, it usually helps to follow directions if there are any or to ask someone who has done it before for suggestions."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1010AE8","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"By the end of the 5th grade all students will know that --<br /> Throughout all of history, people everywhere have invented and used tools. Most tools of today are different from those of the past but many are modifications of very ancient tools."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101AD5E","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"By the end of the 5th grade all students will know that --<br /> The products of technology enable scientists and others to observe things that are too small or too far away to be seen without them and to study the motion of objects that are moving very rapidly or are hardly moving at all."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101A6EC","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"By the end of the 5th grade all students will know that --<br /> Measuring instruments can be used to gather accurate information for making scientific comparisons of objects and events and for designing and constructing things that will work properly."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101B9C5","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"By the end of the 5th grade all students will know that --<br /> Technology extends the ability of people to change the world: to cut, shape, or put together materials; to move things from one place to another; and to reach farther with their hands, voices, senses, and minds. The changes may be for survival needs such as food, shelter, and defense, for communication and transportation, or to gain knowledge and express ideas, or entertainment."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101D2EE","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"By the end of the 8th grade all students will know that --<br /> In earlier times, the accumulated information and techniques of each generation of workers were taught on the job directly to the next generation of workers. Today, the knowledge base for technology can be found as well in libraries of print and electronic resources and is often taught in the classroom."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1006BBF","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"By the end of the 8th grade all students will know that --<br /> Science and technology are essential to one another for such purposes as access to outer space and other remote locations, sample collection and treatment, measurement, data collection and storage, computation, and communication of information."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1023A3B","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> Technological problems often create a demand for new scientific knowledge, and new technologies make it possible for scientists to extend their research in new ways or to undertake entirely new lines of research. The very availability of new technology itself often sparks scientific advances."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101A7F0","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> Mathematics, creativity, logic, and originality are all needed to improve technology."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1003B0D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> Technology usually affects society in different ways than basic science because it solves practical problems and tries to serve human needs (and may create new problems and needs). In contrast, basic science affects society mainly by stimulating and satisfying people's curiosity and occasionally by enlarging or challenging their views of what the world is like."}]},{"leaf":false,"text":"Designs and Systems","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1022AD2","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"By the end of the 2nd grade all students will know that --<br /> People can use objects and ways of doing things to solve problems."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1017BA0","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"By the end of the 5th grade all students will know that --<br /> There is no perfect design. Designs that are best in one respect (safety or ease of use, for example) may be inferior in other ways (cost or appearance). Usually some features must be sacrificed to get others. How such trade-offs are perceived depends upon which features are emphasized and which are downplayed."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1003DC1","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"By the end of the 5th grade all students will know that --<br /> Even a good design may fail. Sometimes steps can be  taken ahead of time to reduce the likelihood of failure, but it cannot be entirely eliminated."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1014A23","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"By the end of the 5th grade all students will know that --<br /> The solution to one problem may create other problems."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100FEBB","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"By the end of the 8th grade all students will know that --<br /> Design usually requires taking constraints into account. Some constraints, such as gravity or the properties of the materials to be used, are unavoidable. Other constraints, including economic, political, social, ethical, and aesthetic ones, limit design choices."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100C541","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"By the end of the 8th grade all students will know that --<br /> Systems fail because they have faulty or poorly matched parts, are used in ways that exceed what was intended by the design, or were poorly designed to begin with. The most common ways to prevent failure are pretesting parts and procedures, overdesign, and redundancy."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10137EF","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> In designing a device or process, thought should be given to how it will be manufactured, operated, maintained, replaced, and disposed of and who will sell, operate, and take care of it. The costs associated with these functions may introduce yet more constraints on the design."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10016AB","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> The value of any given technology may be different for different groups of people and at different points in time."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1000465","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> Complex systems have layers of controls. Some controls operate particular parts of the system and some control other controls. Even \"fully\" automatic systems require human control at some point."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1023239","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> Risk analysis is used to minimize the likelihood of unwanted side effects of a new technology. The public perception of risk may depend, however, on psychological factors as well as scientific ones."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101E2D0","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> The more parts and connections a system has, the more ways it can go wrong. Complex systems usually have components to detect, back up, bypass, or compensate for minor failures."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1004A80","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> To reduce the chance of system failure, performance testing is often conducted using small-scale models, computer simulations, analogous systems, or just the parts of the system thought to be least reliable."}]},{"leaf":false,"text":"Issues in Technology","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1013D29","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"By the end of the 2nd grade all students will know that --<br /> People, alone or in groups, are always inventing new ways to solve problems and get work done. The tools and ways of doing things that people have invented affect all aspects of life."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1015BDB","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"By the end of the 2nd grade all students will know that --<br /> When a group of people wants to build something or try something new, they should try to figure out ahead of time how it might affect other people."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1013914","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"By the end of the 5th grade all students will know that --<br /> Technology has been part of life on the earth since the advent of the human species. Like language, ritual, commerce, and the arts, technology is an intrinsic part of human culture, and it both shapes society and is shaped by it. The technology available to people greatly influences what their lives are like."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100798E","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"By the end of the 5th grade all students will know that --<br /> Any invention is likely to lead to other inventions. Once an invention exists, people are likely to think up ways of using it that were never imagined at first."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1018AD4","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"By the end of the 5th grade all students will know that --<br /> Transportation, communications, nutrition, sanitation, health care, entertainment, and other technologies give large numbers of people today the goods and services that once were luxuries enjoyed only by the wealthy. These benefits are not equally available to everyone."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100F34A","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"By the end of the 5th grade all students will know that --<br /> Scientific laws, engineered principles, properties of materials, and construction techniques must be taken into account in designing engineering solutions to problems. Other factors, such as cost, safety, appearance, environmental impact, and what will happen if the solution fails also must be considered."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101F004","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"By the end of the 5th grade all students will know that --<br /> Because of their ability to invent tools and processes, people have an enormous effect on the lives of other living things."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101B133","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"By the end of the 8th grade all students will know that --<br /> Technology cannot always provide successful solutions for problems or fulfill every human need."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1023103","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"By the end of the 8th grade all students will know that --<br /> Throughout history, people have carried out impressive technological feats, some of which would be hard to duplicate today even with modern tools. The purposes served by these achievements have sometimes been practical, sometimes ceremonial."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1009503","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"By the end of the 8th grade all students will know that --<br /> Techology has strongly influenced the course of history and continues to do so. It is largely responsible for the great revolutions in agriculture, manufacturing, sanitation and medicine, warfare, transportation, information processing, and communications that have radically changed how people live."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1005132","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> Social and economic forces strongly influence which technologies will be developed and used. Which will prevail is affected by many factors, such as personal values, consumer acceptance, patent laws, the availability of risk capital, the federal budget, local and national regulations, media attention, economic competition, and tax incentives."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10065FB","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> Technological knowledge is not always as freely shared as scientific knowledge unrelated to technology. Some scientists and engineers are comfortable working in situations in which some secrecy is required, but others prefer not to do so. It is generally regarded as a matter of individual choice and values, not one of professional ethics."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1008ABA","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> In deciding on proposals to introduce new technologies or to curtail existing ones, some key questions arise concerning alternatives, risks, costs, and benefits. What alternative ways are there to achieve the same ends, and how do the alternatives compare to the plan being put forward? Who benefits and who suffers? What are the financial and social costs, do they change over time, and who bears them? What are the risks associated with using (or not using) the new technology, how serious are they, and who is in jeopardy? What human, material, and energy resources will be needed to build, install, operate, maintain, and replace the new technology, and where will they come from? How will the new technology and its waste products be disposed of and at what costs?"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1024D39","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> The human species has a major impact on other species in many ways: reducing the amount of the earth's surface to those other species, interfering with their food sources, changing the temperature and available chemical composition of their habitats, introducing foreign species into their ecosystems, and altering organisms directly through selective breeding and genetic engineering."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101C540","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> Human inventiveness has brought new risks as well as improvements to human existence."}]}]},{"leaf":false,"text":"B. The Physical Setting","children":[{"leaf":false,"text":"The Universe","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10200F1","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"By the end of the 2nd grade all students will know that --<br /> There are more stars in the sky than anyone can easily count, but they are not scattered evenly."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101B33E","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"By the end of the 2nd grade all students will know that --<br /> The sun can be seen only in the daytime, but the moon can be seen sometimes at night and sometimes during the day. The sun, moon, and stars all appear to move slowly across the sky."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101FD1D","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"By the end of the 2nd grade all students will know that --<br /> The moon looks a little different every day, but looks the same again about every four weeks."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1016C65","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"By the end of the 5th grade all students will know that --<br /> The patterns of stars in the sky stay the same, although they appear to move across the sky nightly, and different stars can be seen in different seasons."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1003B93","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"By the end of the 5th grade all students will know that --<br /> Telescopes magnify the appearance of some distant objects in the sky, including the moon and the planets. The number of stars that can be seen through telescopes is dramatically greater than can be seen by the unaided eye."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1022646","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"By the end of the 5th grade all students will know that --<br /> Planets change their positions against the background of stars."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10160F9","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"By the end of the 5th grade all students will know that --<br /> The earth is one of several planets that orbit the sun, and the moon orbits around the earth."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100F12F","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"By the end of the 5th grade all students will know that --<br /> Stars are like the sun, some being smaller and some larger, but so far away that they look like points of light. The sun is a star."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1017C61","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"By the end of the 8th grade all students will know that --<br /> The sun is a medium-sized star located near the edge of a disk-shaped galaxy (Milky Way) of stars, part of which can be seen as a glowing band of light that spans the sky on a very clear night. The universe contains many billions of galaxies, and each galaxy contains many billions of stars. To the naked eye, even the closest of these galaxies is no more than a dim, fuzzy spot."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1024D66","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"By the end of the 8th grade all students will know that --<br /> The sun is many thousands of times closer to the earth than any other star. Light from the sun takes a few minutes to reach the earth, but light from the next nearest star takes a few years to arrive. The trip to that star would take the fastest rocket thousands of years. Some distant galaxies are so far away that their light takes several billion years to reach the earth. People on earth, therefore, see them as they were that long ago in the past."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1022565","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"By the end of the 8th grade all students will know that --<br /> Large numbers of chunks of rock orbit the sun. Some of those that the earth meets in its yearly orbit around the sun glow and disintegrate from friction as they plunge through the atmosphere — and sometimes impact the ground. Other chunks of rocks mixed with ice have long, off-center orbits that carry them close to the sun, where the sun's radiation (of light and particles) boils off frozen material from their surfaces and pushes it into a long, illuminated tail."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1026D33","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> The stars differ from each other in size, temperature, and age, but they are made up of the same elements that are found on the earth and behave according to the same physical principles. Unlike the sun, most stars are in systems of two or more stars orbiting around one another (binary stars)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100EC51","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> The \"Big Bang Theory\": Stars condensed by gravity out of clouds of molecules of the lightest elements until nuclear fusion of the light elements into heavier ones began to occur. Fusion released great amounts of energy over millions of years. Eventually, some stars exploded, producing clouds of heavy elements from which other stars and planets could later condense. The process of star formation and destruction continues."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1005477","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> Mathematical models and computer simulations are used in studying evidence from many sources in order to form a scientific account of the universe."}]},{"leaf":false,"text":"The Earth","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S101AA87","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"By the end of the 2nd grade all students will know that --<br /> Some events in nature have a repeating pattern. The weather changes some from day to day, but things such as temperature and rain (or snow) tend to be high, low, or medium in the same months every year."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S102357A","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"By the end of the 2nd grade all students will know that --<br /> Water can be a liquid or a solid and can go back and forth from one form to the other. If water is turned into ice and then the ice is allowed to melt, the amount of water is the same as it was before freezing."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10157BE","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"By the end of the 2nd grade all students will know that --<br /> Water left in an open container disappears, but water in a closed container does not disappear."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100EF1D","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"By the end of the 5th grade all students will know that --<br /> Things on or near the earth are pulled toward it by the earth's gravity."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101687E","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"By the end of the 5th grade all students will know that --<br /> Like all planets and stars, the earth is approximately spherical in shape. The rotation of the earth on its axis every 24 hours produces the night-and-day cycle. To people on earth, this turning of the planet makes it seem as though the sun, moon, planets, and stars are orbiting the earth once a day."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1024E40","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"By the end of the 5th grade all students will know that --<br /> Air is a substance that surrounds us, takes up space, and whose movement we feel as wind."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10123B6","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"By the end of the 8th grade all students will know that --<br /> We live on a relatively small planet, the third from the sun in the only system of planets definitely known to exist (although other, similar systems may be discovered in the universe)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100B222","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"By the end of the 8th grade all students will know that --<br /> The earth is mostly rock. Three-fourths of its surface is covered by a relatively thin layer of water (some of it frozen), and the entire planet is surrounded by a relatively thin blanket of air. It is the only body in the solar system that appears able to support life. The other planets have compositions and conditions very different from earth."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100791E","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"By the end of the 8th grade all students will know that --<br /> Everything on or anywhere near the earth is pulled toward the earth's center by gravitational force."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1002B33","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"By the end of the 8th grade all students will know that --<br /> Because the earth turns daily on an axis that is tilted relative to the plane of the earth's yearly orbit around the sun, sunlight falls more intensely on different parts of the earth during the year. The difference in heating of the earth's surface produces the planet's seasons and weather patterns."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1005AA3","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"By the end of the 8th grade all students will know that --<br /> The moon's orbit around the earth once in about 28 days changes what part of the moon is lighted by the sun and how much of that part can be seen from the earth — the phases of the moon, but the same side of the moon always faces the earth."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1011481","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> Life is adapted to conditions on the earth, including the force of gravity that enables the planet to retain an adequate atmosphere, and an intensity of radiation from the sun that allows water to cycle between liquid and vapor."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1005A14","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> Weather (in the short run) and climate (in the long run) involve the transfer of energy in and out of the atmosphere. Solar radiation heats the land masses, oceans, and air. Transfer of heat energy at the boundaries between the atmosphere, the land masses, and the oceans results in layers of different temperatures and densities in both the ocean and atmosphere. The action of gravitational force on regions of different densities causes them to rise or fall -- and such circulation, influenced by the rotation of the earth, produces winds and ocean currents."}]},{"leaf":false,"text":"Processes That Shape The Earth","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S100D630","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"By the end of the 2nd grade all students will know that --<br /> Hunks of rock come in many sizes and shapes, from boulders to grains of sand and even smaller."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100CFE7","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"By the end of the 8th grade all students will know that --<br /> Sediments of sand and smaller particles (sometimes containing the remains of organisms) are gradually buried and are cemented together by precipitation of dissolved minerals to form solid rock again."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101E323","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"By the end of the 8th grade all students will know that --<br /> Sedimentary rock buried deep enough may be reformed by pressure and heat, perhaps melting and recrystallizing into different kinds of rock (metamorphism). These re-formed rock layers may be forced up again to become land surface and even mountains. Subsequently, this new rock too will erode. Rock bears evidence of the minerals, temperatures, and forces that created it."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101CBF3","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"By the end of the 8th grade all students will know that --<br /> Thousands of layers of sedimentary rock confirm the long history of the changing surface of the earth and the changing life forms whose remains are found in successive layers. The youngest layers are not always found on top, because of folding, breaking, and uplift of layers."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1011E99","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"By the end of the 8th grade all students will know that --<br /> Although weathered rock is the basic component of soil, the composition and texture of soil and its fertility and resistance to erosion are greatly influenced by plant roots and debris, bacteria, fungi, worms, insects, rodents, and other organisms."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10112BD","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"By the end of the 8th grade all students will know that --<br /> Human activities, such as reducing the amount of forest cover, increasing the amount and variety of chemicals released into the atmosphere, and intensive farming, have changed the earth's land, oceans, and atmosphere. Some of these changes have decreased the capacity of the environment to support some life forms."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10189E4","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> Plants alter the earth's atmosphere by removing carbon dioxide from it, using carbon and light energy to make sugars, releasing oxygen. This process, commonly known as photosynthesis, is largely responsible for the oxygen content of the air."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1004F41","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> The formation, weathering, sedimentation, and reformation of rock constitute a continuing \"rock cycle\" in which the total amount of material stays the same as its forms change."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101D39F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> The slow movement of material within the earth results from heat flowing out from the deep interior and the action of gravitational forces on regions of different density."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S102082D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> The solid crust of the earth -- including both the continents and the ocean basins -- consists of separate plates that ride on a denser, hot, gradually deformable layer of the earth. The crust sections move very slowly, pressing against one another in some places, pulling apart in other places. Ocean-floor plates may slide under continental plates, sinking deep into the earth. The surface layers of these plates may fold, forming mountain ranges. This is known as \"plate tectonics.\""},{"leaf":"true","id":"http://asn.jesandco.org/resources/S102578C","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> Earthquakes often occur along the boundaries between colliding plates, and molten rock from below creates pressure that is released by volcanic eruptions, helping to build up mountains. Under the ocean basins, molten rock may well up between separating plates to create new ocean floor. Volcanic activity along the ocean floor may form undersea mountains, which can grow above the ocean's surface to become islands."}]},{"leaf":false,"text":"Motion","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S101D6C9","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"By the end of the 2nd grade all students will know that --<br /> Things move in many different ways, such as straight, zigzag, round and round, back and forth, and fast and slow."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1015EE4","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"By the end of the 2nd grade all students will know that --<br /> The way to change how something is moving is to give it a push or a pull."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1004820","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"By the end of the 2nd grade all students will know that --<br /> Sound is caused by vibration."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S102272E","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"By the end of the 8th grade all students will know that --<br /> Light from the sun is made up of a mixture of many different colors of light, even though to the eye the light looks almost white. Other things that give off or reflect light have a different mix of colors."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1011081","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"By the end of the 8th grade all students will know that --<br /> Something can be \"seen\" when light waves emitted or reflected by it enter the eye -- just as something can be \"heard\" when sound waves from it enter the ear."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1023531","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"By the end of the 8th grade all students will know that --<br /> An unbalanced force acting on an object changes its speed or path of motion, or both. If the force acts toward a single center, the object's path may curve into an orbit around the center."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1020EE0","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"By the end of the 8th grade all students will know that --<br /> Vibrations in materials set up wavelike disturbances that spread away from the source. Sound and earthquake waves are examples. These and other waves move at different speeds in different materials."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1025E1B","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"By the end of the 8th grade all students will know that --<br /> Human eyes respond to only a narrow range of wavelengths of electromagnetic radiation -- visible light. Differences of wavelength within that range are perceived as different in color."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1010559","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> The change in motion of an object (the acceleration) is proportional to the applied force and inversely proportional to the mass."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101B7CD","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> All motion is relative to whatever frame of reference is chosen, for there is no motionless frame from which to judge all motion."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10256FE","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> Accelerating electric charges produce electromagnetic waves around them. A great variety of radiations are electromagnetic waves: radio waves, microwaves, radiant heat, visible light, ultraviolet radiation, x rays, and gamma rays. These wavelengths vary from radio waves, the longest, to gamma rays, the shortest. In empty space, all electromagnetic waves move at the same speed -- the \"speed of light.\""},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10183A0","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> Whenever one thing exerts a force on another, an equal amount of force is exerted back on it."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10238D2","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> The observed wavelength of a wave depends upon the relative motion of the source and the observer. If either is moving toward the other, the observed wavelength is shorter; if either is moving away, the wavelength is longer. This is known as the Doppler Effect. Because the light seen from almost all distant galaxies has longer wavelengths than comparable light here on earth, astronomers believe that the whole universe is expanding."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1011B51","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> Waves can superpose on one another, bend around corners, reflect off surfaces, be absorbed by materials they enter, and change direction when entering a new material. All these effects vary with wavelength. The energy of waves (like any form of energy) can be changed into other forms of energy."}]},{"leaf":false,"text":"Forces of Nature","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1008B77","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"By the end of the 2nd grade all students will know that --<br /> Magnets can be used to make some things move without being touched."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10046CB","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"By the end of the 8th grade all students will know that --<br /> Every object exerts gravitational force on every other object. The force depends on how much mass the objects have and on how far apart they are. The force is hard to detect unless at least one of the objects has a lot of mass."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1000F57","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"By the end of the 8th grade all students will know that --<br /> The sun's gravitational pull holds the earth and other planets in their orbits, just as the planets' gravitational pull keeps their moons in orbit around them."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101AC54","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"By the end of the 8th grade all students will know that --<br /> Electric currents and magnets can exert a force on each other."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100BBAF","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> Gravitational force is an attraction between masses. The strength of the force is proportional to the masses and weakens rapidly with increasing distance between them."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10103D3","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> There are two kinds of charges -- positive and negative. Like charges repel one another, opposite charges attract. In materials, there are almost exactly equal proportions of positive and negative charges, making the materials as a whole electrically neutral. Negative charges, being associated with electrons, are far more mobile in materials than positive charges are. A very small excess or deficit of negative charges in a material produces noticeable electric forces."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101F8DE","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> Different kinds of materials respond differently to electric forces. In conducting materials such as metals, electric charges flow easily, whereas in insulating materials such as glass, they can move hardly at all. At very low temperatures, some materials become superconductors and offer no resistance to the flow of current. In between these extremes, semiconducting materials differ greatly in how well they conduct, depending on their exact composition."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101A14C","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> The forces that hold the nucleus of an atom together are much stronger than the electromagnetic force. That is why such great amounts of energy are released from the nuclear reactions in the sun and other stars."}]},{"leaf":false,"text":"Structure of Matter","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1010110","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"By the end of the 5th grade all students will know that --<br /> No matter how parts of an object are assembled, the weight of the whole object made is always the same as the sum of the parts; and when a thing is broken into parts, the parts have the same total weight as the original thing."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101774F","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"By the end of the 5th grade all students will know that --<br /> Materials may be composed of parts that are too small to be seen without magnification."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101256B","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"By the end of the 8th grade all students will know that --<br /> All matter is made up of atoms, which are far too small to see directly through a microscope. The atoms of any element are alike but are different from atoms of other elements. Atoms may stick together in well-defined molecules or may be packed together in large arrays. Different arrangements of atoms into groups compose all substances."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1000B73","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"By the end of the 8th grade all students will know that --<br /> Equal volumes of different substances usually have different masses."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1019D6B","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"By the end of the 8th grade all students will know that --<br /> Atoms and molecules are perpetually in motion. Increased temperature means greater average energy of motion, so most substances expand when heated. In solids, the atoms are closely locked in position and can only vibrate. In liquids, the atoms or molecules have higher energy, are more loosely connected, and can slide past one another; some molecules may get enough energy to escape into a gas. In gases, the atoms or molecules have still more energy and are free of one another except during occasional collisions."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1021581","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"By the end of the 8th grade all students will know that --<br /> The temperature and acidity of a solution influences reaction rates. Many substances dissolve in water, which may greatly facilitate reactions between them."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101B556","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"By the end of the 8th grade all students will know that --<br /> Scientific ideas about elements were borrowed from some Greek philosophers of 2,000 years earlier, who believed that everything was made from four basic substances: air, earth, fire, and water. It was the combination of these \"elements\" in different proportions that gave other substances their observable properties. The Greeks were wrong about those four, but now over 100 different elements have been identified -- some rare and some plentiful -- out of which everything is made. Because most elements tend to combine with others, few elements are found in their pure form."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100F170","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"By the end of the 8th grade all students will know that --<br /> No matter how substances within a closed system interact with one another, or how they combine or break apart, the total weight of the system remains the same. The idea of atoms explains the conservation of matter: If the number of atoms stays the same no matter how they are rearranged, then their total mass stays the same."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10134DF","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> Atoms are made of a positive nucleus surrounded by negative electrons. An atom's electron configuration, particularly the outermost electrons, determines how the atom can interact with other atoms. Atoms form bonds to other atoms by transferring or sharing electrons."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1011CC9","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> Protons and neutrons, having a mass nearly two thousand times greater than the electron, compose the nucleus of the atom. The number of protons in an atom, called the atomic number, equals the number of electrons in the electrically neutral atom. The nucleus is a small fraction of the total volume of the atom. Atoms change their charge by adding or losing electrons. These atoms are then called ions."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1022ABA","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> Neutrons have a mass that is nearly identical to that of protons, but neutrons have no electric charge. Although neutrons have little effect on how an atom interacts with others, they do affect the mass and stability of the nucleus. Isotopes of the same element have the same number of protons (and therefore of electrons) but differ in the number of neutrons."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100B09B","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> The nucleus of radioactive isotopes is unstable and spontaneously decays, emitting particles and/or wavelike radiation. It cannot be predicted exactly when, if ever, an unstable nucleus will decay, but a large group of identical nuclei decay at a predictable rate. This predictability of decay rate allows radioactivity to be used for estimating the age of materials that contain radioactive substances."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10267D9","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> Scientists continue to investigate atoms and have discovered even smaller constituents of which electrons, neutrons, and protons are made."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10204E6","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> The placement of elements on the periodic table of elements is determined by common chemical properties. The same sequence of properties appears over and over again in the list."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101887D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> Atoms often join with one another in various combinations in distinct molecules or in repeating three-dimensional crystal patterns. An enormous variety of biological, chemical, and physical phenomena can be explained by changes in the arrangement and motion of atoms and molecules."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101B8C5","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> The configuration of atoms in a molecule determines the molecule's properties. Shapes are particularly important in how large molecules interact with others."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10176A1","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> The rate of reactions among atoms and molecules depends on how often they encounter one another, which is affected by the concentration, pressure, and temperature of the reacting materials. Some atoms and molecules are highly effective encouraging the interaction of others."}]},{"leaf":false,"text":"Energy Transformations","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S101B4D4","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"By the end of the 8th grade all students will know that --<br /> Energy cannot be created or destroyed, but only changed from one form into another. Most of what goes on in the universe — from exploding stars and biological growth to the operation of machines and the motion of people — involves some form of energy being transformed into another. Energy in the form of heat is almost always one of the products of an energy transformation. Energy appears in different forms. Heat energy is in the disorderly motion of molecules; chemical energy is in the arrangement of atoms; mechanical energy is in moving bodies or in elastically distorted shapes; gravitational energy is in the separation of mutually attracting masses."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1012104","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"By the end of the 8th grade all students will know that --<br /> Heat can be transferred through materials by the collisions of atoms (conduction) or across space through radiation. If the material is fluid, currents will be set up in it that aid the transfer of heat (convection)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1004EDB","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> Whenever the amount of energy in one place or form diminishes, the amount in other places or forms increases by the same amount. (The Law of Conservation of Energy)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100C3C6","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> Heat energy in a material consists of the disordered motions of its atoms or molecules. In any interactions of atoms or molecules, the statistical odds are that they will end up with less order than they began -- that is, with the heat energy spread out more evenly. With huge numbers of atoms and molecules, the greater disorder is almost certain. This disorder is called entropy."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101E01A","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> Transformations of energy usually produce some energy in the form of heat, which spreads around by radiation, conduction or convection into cooler places. Although just as much total energy remains, its being spread out more evenly means less can be done with it."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101806D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> Different energy levels are associated with different configurations of atoms and molecules. Some changes of configuration require an input of energy whereas others release energy."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10156D5","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> When energy of an isolated atom or molecule changes, it does so in a definite jump from one value to another, with no possible values in between. The change in energy occurs when radiation is absorbed or emitted, so the radiation also has distinct energy values. As a result, the light (radiation) emitted or absorbed by separate atoms or molecules (as in a gas) can be used to identify what the substance is."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10202F9","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> Energy is released whenever the nuclei of very heavy atoms, such as uranium or plutonium, split into middleweight ones (a process known as \"fission\"), or when very light nuclei, such as those of hydrogen and helium, combine into heavier ones (a process known as \"fusion\"). The energy released in each nuclear reaction is very much greater than the energy given off in each chemical reaction."}]}]},{"leaf":false,"text":"C. The Living Environment","children":[{"leaf":false,"text":"Diversity of Life","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S101FEAF","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"By the end of the 2nd grade all students will know that --<br /> Some animals and plants are alike in the way they look and in the things they do, and others are very different from one another."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101D408","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"By the end of the 2nd grade all students will know that --<br /> Plants and animals have features [adaptations] that help them live [survive] in different environments."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1023A23","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"By the end of the 2nd grade all students will know that --<br /> Stories sometimes give plants and animals attributes they really do not have."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100CF9F","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"By the end of the 5th grade all students will know that --<br /> A great variety of kinds of living things can be sorted into groups in many ways using various features to decide which things belong to which group."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101AEB7","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"By the end of the 5th grade all students will know that --<br /> Features used for grouping depend on the purpose of the grouping."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1014497","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"By the end of the 8th grade all students will know that --<br /> One of the most general distinctions among organisms is between plants, which use sunlight to make their own food, and animals, which consume energy-rich foods. Some kinds of organisms, many of them microscopic, cannot be neatly classified as either plants or animals."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1014402","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"By the end of the 8th grade all students will know that --<br /> Animals and plants have a great variety of body plans and internal structures that contribute to their being able to make or find food and reproduce."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100A311","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"By the end of the 8th grade all students will know that --<br /> Similarities among organisms are found in internal anatomical features, which can be used to infer the degree of relatedness among organisms. In classifying organisms, biologists consider details of internal and external structures to be more important than behavior or general appearance."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100ADF6","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"By the end of the 8th grade all students will know that --<br /> For sexually reproducing organisms, a species comprises all organisms that can mate with one another to produce fertile offspring."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100A47E","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"By the end of the 8th grade all students will know that --<br /> All organisms, including the human species, are part of and depend on two main interconnected global food webs. One includes microscopic ocean plants, the animals that feed on them, and finally the animals that feed those animals. The other web includes land plants, the animals that feed on them, and so forth. The cycles continue indefinitely because organisms decompose after death to return food material to the environment."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101F54F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> The variation of organisms within a species increases the likelihood that at least some members of the species will survive under changed environmental conditions, and a great diversity of species increases the chance that at least some living things will survive in the face of large changes in the environment."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1002294","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> The degree of kinship between organisms or species can be estimated from the similarities of their DNA sequences, which often closely matches their classification based on anatomical similarities."}]},{"leaf":false,"text":"Heredity","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S101170F","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"By the end of the 2nd grade all students will know that --<br /> There is variation among individuals of one kind within a population."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1011E18","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"By the end of the 2nd grade all students will know that --<br /> Offspring are very much, but not exactly, like their parents and like one another."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10054B5","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"By the end of the 8th grade all students will know that --<br /> In some kinds of organisms, all genes come from a single parent, whereas in organisms that have sexes, typically half of the genes come from each parent."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101F634","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"By the end of the 8th grade all students will know that --<br /> In sexual reproduction, a single specialized cell from a female merges with a specialized cell from a male. As the fertilized egg, carrying genetic information from each parent, multiplies to form the complete organism with about a trillion cells, the same genetic information is copied in each cell."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101B56C","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"By the end of the 8th grade all students will know that --<br /> New varieties of cultivated plants and domestic animals have resulted from selective breeding for particular traits."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101064F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> Some new gene combinations make little difference, some can produce organisms with new and perhaps enhanced capabilities, and some can be deleterious."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1019558","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> The sorting and recombination of genes in sexual reproduction results in a great variety of possible gene combinations from the offspring of any two parents."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1000F49","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> The information passed from parents to offspring is coded in DNA molecules."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101E71A","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> Genes are segments of DNA molecules. Inserting, deleting, or substituting DNA segments can alter genes. An altered gene may be passed on to every cell that develops from it. The resulting features may help, harm, or have little or no effect on the offspring's success in its environment."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1018756","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> Gene mutations can be caused by such things as radiation and chemicals. When they occur in sex cells, the mutations can be passed on to offspring; if they occur in other cells, they can be passed on to descendant cells only. The experiences an organism has during its lifetime can affect its offspring only if the genes in its own sex cells are changed by the experience."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1025423","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> The many body cells in an individual can be very different from one another, even though they are all descended from a single cell and thus have essentially identical genetic instructions. Different genes are turned on and other genes are repressed as cells develop and specialize."}]},{"leaf":false,"text":"Interdependence of Life","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S101FA95","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"By the end of the 2nd grade all students will know that --<br /> Animals eat plants or other animals for food and may also use plants (or even other animals) for shelter and nesting."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1019DB4","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"By the end of the 2nd grade all students will know that --<br /> Living things are found in a variety of places everywhere in the world. There are different kinds of living things in different places."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101B5DA","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"By the end of the 5th grade all students will know that --<br /> Organisms interact with one another in various ways besides providing food. Many plants depend on animals for carrying their pollen to other plants or for dispersing their seeds."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101489E","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"By the end of the 8th grade all students will know that --<br /> In all environments — freshwater, marine, forest, desert, grassland, mountain, and others — organisms with similar needs may compete with one another for resources, including food, space, water, air, and shelter. In any particular environment, the growth and survival of organisms depend on the physical conditions."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1021252","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"By the end of the 8th grade all students will know that --<br /> Two types of organisms may interact with one another in several ways: they may be in a producer/consumer, predator/prey, or parasite/host relationship. Or one organism may scavenge or decompose another. Relationships may be competitive or mutually beneficial. Some species have become so adapted to each other that neither could survive without the other."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100CB00","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> Ecosystems can be reasonably stable over hundreds or thousands of years. As any population of organisms grows, it is held in check by one or more environmental factors: depletion of food or nesting sites, increased loss to increased numbers of predators, or parasites. If a disaster such as flood or fire occurs, the damaged ecosystem is likely to recover in stages that eventually result in a system similar to the original one."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10199C6","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> Like many complex systems, ecosystems tend to have cyclic fluctuations around a state of rough equilibrium. In the long run, however, ecosystems always change when climate changes or when one or more new species appear as a result of migration or local evolution."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1006AD2","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> Human beings are part of the earth's ecosystems. Human activities can, deliberately or inadvertently, alter the equilibrium in ecosystems."}]},{"leaf":false,"text":"Evolution of Life","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S100CB7E","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"By the end of the 2nd grade all students will know that --<br /> Different plants and animals external features that help them thrive in different kinds of places."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10220DE","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"By the end of the 8th grade all students will know that --<br /> Small differences between parents and offspring can accumulate (through selective breeding) in successive generations so that descendants are very different from their ancestors."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10162ED","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"By the end of the 8th grade all students will know that --<br /> Individual organisms with certain traits are more likely than others to survive and have offspring. Changes in environmental conditions can affect the survival of individual organisms and entire species."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101CE42","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"By the end of the 8th grade all students will know that --<br /> Many thousands of layers of sedimentary rock provide evidence for the long history of the earth and for the long history of changing life forms whose remains are found in the rocks. More recently deposited rock layers are more likely to contain fossils resembling existing species."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100E0E3","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> The basic idea of biological evolution is that the earth's present-day species developed from earlier, distinctly different species."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101B5DE","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> Molecular evidence substantiates the anatomical evidence for evolution and provides additional detail about the sequence in which various lines of descent branched off from another."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1016FDA","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> Natural selection provides the following mechanism for evolution: Some variation in heritable characteristics exists within every species, some of these characteristics give individuals an advantage over others in surviving and reproducing, and the advantaged offspring, in turn, are more likely than others to survive and reproduce. The proportion of individuals that have advantageous characteristics will increase."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1008355","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> Heritable characteristics can be observed at molecular and whole-organism levels -- in structure, chemistry, or behavior. These characteristics strongly influence what capabilities an organism will have and how it will react, and therefore influence how likely it is to survive and reproduce."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1020B2D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> New heritable characteristics can result from new combinations of existing genes or from mutations of genes in reproductive cells. Changes in other cells of an organism cannot be passed on to the next generation."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10076CA","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> Natural selection leads to organisms that are well-suited for survival in particular environments. Chance alone can result in the persistence of some heritable characteristics having no survival or reproductive advantage or disadvantage for the organism. When an environment changes, the survival value of some inherited characteristics may change."}]},{"leaf":false,"text":"Cells","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1022E0C","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"By the end of the 8th grade all students will know that --<br /> All living things are composed of cells, from just one to many millions, whose details usually are visible only through a microscope. Different body tissues and organs are made up of different kinds of cells. The cells in similar tissues and organs in other animals are similar to those in human beings but differ somewhat from cells found in plants."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1020FD1","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"By the end of the 8th grade all students will know that --<br /> Cells continually divide to make more cells for growth and repair. Various organs and tissues function to serve the needs of cells for food, air, and waste removal."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101C588","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"By the end of the 8th grade all students will know that --<br /> Within cells, many of the basic functions of organisms — such as extracting energy from food and getting rid of waste — are carried out. The way in which cells function is similar in all living organisms."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1014E7B","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"By the end of the 8th grade all students will know that --<br /> About two thirds of the weight of cells is accounted for by water, which gives cells many of their properties."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1011C20","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> Every cell is covered by a membrane that controls what can enter and leave the cell. In all but quite primitive cells, a complex network of proteins provides organization and shape and, for animal cells, movement."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1018041","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> Within the cell are specialized parts for the transport of materials, energy capture and release, protein building, waste disposal, information feedback, and even movement. In addition to these basic cellular functions common to all cells, most cells in multicellular organisms perform some special functions that others do not."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1019B92","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> The work of the cell is carried out by the many different types of molecules it assembles, mostly proteins. Protein molecules are long, usually folded chains made from 20 different kinds of amino-acid molecules. The function of each protein molecule depends on its specific sequence of amino acids and the shape the chain takes is a consequence of attractions between the amino acids in the chain."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101071B","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> The genetic information in DNA molecules provides instructions for assembling protein molecules. The code used is virtually the same for all life forms."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1009E3D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> Gene mutation in a cell can result in uncontrolled cell division, called cancer. Exposure of cells to certain chemicals and radiation increases mutations and thus increases the chance of cancer."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100A2AF","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> Most cells function best within a narrow range of temperature and acidity. At very low temperatures, reaction rates are too slow. High temperatures and/or extremes of acidity can irreversibly change the structure of most protein molecules. Even small changes in acidity can alter the molecules and how they interact. Both single cells and multicellular organisms have molecules that help to keep the cell's acidity within a narrow range."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1015416","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> A living cell is composed of a small number of chemical elements, mainly carbon, hydrogen, nitrogen, oxygen, phosphorous, and sulfur. Carbon, because of its small size and four available bonding electrons, can join to other carbon atoms in chains and rings to form large and complex molecules."}]},{"leaf":false,"text":"Flow of matter and energy","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S100315D","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"By the end of the 8th grade all students will know that --<br /> Food provides the fuel and the building material for all organisms. Plants use the energy from light to make sugars from carbon dioxide and water. This food can be used immediately or stored for later use. Organisms that eat plants break down the plant structures to produce the materials and energy they need to survive. Then they are consumed by other organisms."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1006A2C","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"By the end of the 8th grade all students will know that --<br /> Over a long time, matter is transferred from one organism to another repeatedly and between organisms and their physical environment. As in all material systems, the total amount of matter remains constant, even though its form and location change."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10126D8","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"By the end of the 8th grade all students will know that --<br /> Energy can change from one form to another in living things. Animals get energy from oxidizing their food, releasing some of its energy as heat. Almost all food energy comes originally from sunlight."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10161EE","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> At times, environmental conditions are such that plants and marine organisms grow faster than decomposers can recycle them back to the environment. Layers of energy-rich organic material have been gradually turned into great coal beds and oil pools by the pressure of the overlying earth. By burning these fossils fuels, people are passing most of the stored energy back into the environment as heat and releasing large amounts of carbon dioxide."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100B749","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> The amount of life any environment can support is limited by the available energy, water, oxygen, and minerals, and by the ability of ecosystems to recycle the residue of dead organic materials. Human activities and technology can change the flow and reduce the fertility of the land."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101559C","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> The chemical elements that make up the molecules of living things pass through food webs and are combined and recombined in different ways. At each link in a food web, some energy is stored in newly made structures but much is dissipated into the environment as heat. Continual input of energy from sunlight keeps the process going."}]}]},{"leaf":false,"text":"D. The Human Organism","children":[{"leaf":false,"text":"Human Identity","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1021D01","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"By the end of the 2nd grade all students will know that --<br /> People have different external features, such as the size, shape, and color of hair, skin, and eyes, but they are more like one another than like other animals."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1017A28","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"By the end of the 2nd grade all students will know that --<br /> People need water, food, air, waste removal, and a particular range of temperatures in their environment, just as other animals do."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10053E4","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"By the end of the 2nd grade all students will know that --<br /> People tend to live in families and communities in which individuals have different roles."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100DFAC","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"By the end of the 5th grade all students will know that --<br /> Human beings have made tools and machines to sense and do things that they could not otherwise sense or do at all, or as quickly, or as well."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100936E","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"By the end of the 5th grade all students will know that --<br /> Artifacts and preserved remains provide some evidence of the physical characteristics and possible behavior of human beings who lived a very long time ago."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100A2A3","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"By the end of the 8th grade all students will know that --<br /> Human beings have many similarities and differences. The similarities make it possible for human beings to reproduce and to donate blood and organs to one another throughout the world. Their differences provide the ability for adaptive change."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10242A6","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"By the end of the 8th grade all students will know that --<br /> Like other animals, human beings have body systems for obtaining and providing energy, defense, reproduction, and the coordination of body functions."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1009A05","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> The similarity of human DNA sequences and the resulting similarity in cell chemistry and anatomy identify human beings as a single species."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1007E8D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> Written records and photographic and electronic devices enable human beings to share, compile, use, and misuse great amounts of information and misinformation. No other species uses such technologies."}]},{"leaf":false,"text":"Basic Functions","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1018F66","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"By the end of the 2nd grade all students will know that --<br /> The human body has parts that help it seek, find, and take in food when it feels hunger--eyes and noses for detecting food, legs to get to it, arms to carry it away, and a mouth to eat it."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1018882","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"By the end of the 2nd grade all students will know that --<br /> The brain enables human beings to think and sends messages to other body parts to help  them work properly."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1008562","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"By the end of the 5th grade all students will know that --<br /> Skin protects the body from harmful substances and other organisms and from drying out."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101D38F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> Reproduction is necessary for the survival of any species. Sexual behavior depends strongly on cultural, personal, and biological factors."}]},{"leaf":false,"text":"Learning","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1005614","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"By the end of the 2nd grade all students will know that --<br /> People use their senses to find out about their surroundings and themselves. Different senses give different information. Sometimes a person can get different information about the same thing by moving closer to it or further away from it."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1006008","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"By the end of the 2nd grade all students will know that --<br /> Some of the things people do, like playing soccer, reading, and writing, must be deliberately learned. Practicing helps people to improve. How well one learns sometimes depends on how one does it and how often and how hard one tries to learn."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1005DCD","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"By the end of the 2nd grade all students will know that --<br /> People can learn from each other by telling and listening, showing and watching, and imitating what others do."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1019769","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"By the end of the 5th grade all students will know that --<br /> Human beings have different interests, motivations, skills, and talents."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10187E0","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> Differences in the behavior of individuals arise from the interaction of heredity and experience -- the effect of each depends on what the other is. Even instinctive behavior may not develop well if the individual is exposed to abnormal conditions."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10114A3","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> The expectations, moods, and prior experiences of human beings can affect how they interpret new perceptions or ideas. People tend to ignore evidence that challenges their beliefs and to accept evidence that supports them. The context in which something is learned may limit the contexts in which the learning can be used."}]},{"leaf":false,"text":"Physical Health","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1003A04","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"By the end of the 2nd grade all students will know that --<br /> Eating a variety of healthful foods and getting enough exercise and rest help people to stay healthy."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101A2BF","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"By the end of the 2nd grade all students will know that --<br /> Some diseases are caused by germs, some are not. Diseases caused by germs may be spread by people who have them. Washing one's hands with soap and water reduces the number of germs that can get into the body or that can be passed on to other people."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10133DB","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"By the end of the 5th grade all students will know that --<br /> Food provides energy and materials for growth and repair of body parts. Vitamins and minerals, present in small amounts in foods, are essential to keep everything working well. As people grow up, the amounts and kinds of food and exercise needed by the body may change."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1015365","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"By the end of the 5th grade all students will know that --<br /> Tobacco, alcohol, other drugs, and certain poisons in the environment (pesticides, lead) can harm human beings and other living things."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100ACCF","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"By the end of the 5th grade all students will know that --<br /> There are some diseases that human beings can catch only once. After they've recovered they don't get sick from them again. There are many diseases that can be prevented by vaccination, so that people don't catch them even once."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101F7B5","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> Faulty genes can cause body parts or systems to work poorly. Some genetic diseases appear only when an individual has inherited a certain gene from both parents."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101BA31","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"By the end of the 12th grade all students will know that --<br /> Some viral diseases, such as AIDS, destroy critical cells of the immune system, leaving the body unable to deal with multiple infection agents and cancerous cells."}]},{"leaf":false,"text":"Human Development","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10003D6","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"By the end of the 5th grade all students will know that --<br /> Human beings live longer than most other animals, but all living things die."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10139BE","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"By the end of the 5th grade all students will know that --<br /> There is a usual sequence of physical and mental development among human beings, although individuals differ in exactly when they learn things."}]}]}]