[{"leaf":false,"text":"Earth and Space Science","children":[{"leaf":false,"text":"Essential Concepts and/or Skills: Understand and apply knowledge of properties of earth materials.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11402D1","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"Earth materials are solid rocks and soils, water and the gases of the atmosphere. The varied materials have different physical and chemical properties."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11402D2","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"Soils have properties of color and texture, capacity to retain water, and ability to support the growth of many kinds of plants, including those in our food supply."}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Understand and apply knowledge of observable information about daily and seasonal weather conditions.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11402D3","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"Weather changes from day to day and over the seasons."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11402D4","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"The sun provides the light and heat necessary to maintain the temperature of the earth."}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Understand and apply knowledge of events that have repeating patterns.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11402D5","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"Seasons of the year, day and night are events that are repeated in regular patterns."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11402D6","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"The sun's position in the sky can be observed and described."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11402D7","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"The sun can only be seen during our daylight hours. We are unable to see the sun at night because of the rotation of the earth."}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Understand and apply knowledge of properties and uses of earth materials.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11402DD","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"The different physical and chemical properties of earth materials make them useful in different ways, for example, as building materials, as sources of fuel, or for growing the plants we use as foods."}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Understand and apply knowledge of processes and changes on or in the earth's land, oceans, and atmosphere.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11402DE","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"The surface of the earth changes. Some changes are due to slow processes, such as erosion and weathering, and some changes are due to rapid processes such as landslides, volcanic eruptions, floods and earthquakes."}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Understand and apply knowledge of fossils and the evidence they provide of past life on earth.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11402DF","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"Fossils provide evidence of plants and animals that lived long ago and the nature of the environment at that time."}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Understand and apply knowledge of weather and weather patterns.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11402E0","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"Weather is always changing and can be described by measurable quantities such as temperature, wind direction and speed and precipitation."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11402E1","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"Large masses of air with certain properties move across the surface of the earth. The movement and interaction of these air masses is used to forecast the weather."}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Understand and apply knowledge of the properties, movements, and locations of objects in our solar system.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11402E2","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"Most objects in the solar system are in regular and predictable motion. The rotation of the earth on its axis every 24 hours produces the day-and-night cycle. To people on the earth this turning of the planet makes it seem as though the sun, planets, and stars are orbiting the earth once a day."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11402E3","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"The sun appears to move across the sky in the same way every day. Its apparent path changes slowly across the seasons."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11402E4","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"The moon's orbit around the earth once in about 28 days changes what part of the moon is lighted by the sun and how much of that part can be seen from the earth – the phases of the moon."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11402E5","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"Eight planets and many other objects revolve around our Sun in predictable patterns. These planets and objects are composed of varied materials."}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Understand and apply knowledge of the structure and processes of the earth system and the processes that change the earth and its surface.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11402EB","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"The solid earth consists of layers including a lithosphere; a hot, convecting mantle and a dense metallic core."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11402EC","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Tectonic plates constantly move at rates of centimeters per year in response to movements in the mantle. Major geological events, such as earthquakes, volcanic eruptions, and mountain building, are results of these plate motions."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11402ED","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Land forms are the result of a combination of constructive and destructive forces. Constructive forces include crustal deformation, volcanic eruption, and deposition of sediment, while destructive forces include weathering and erosion."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11402EE","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Some changes in the earth can be described as the \"rock cycle.\"  Rocks at the earth's surface weather, forming sediments that are buried, then compacted, heated, and often re-crystallized into new rock. Eventually, those new rocks may be brought to the surface by the forces that drive plate motions, and the rock cycle continues."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11402EF","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Soil consists of weathered rocks and decomposed organic matter from dead plants, animals, and bacteria. Soils are often found in layers, with each having a different chemical composition and texture."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11402F0","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Living organisms have played many roles in the earth system, including affecting the composition of the atmosphere, producing some types of rocks, and contributing to the weathering of rocks."}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Understand and apply knowledge of the water cycle, including consideration of events that impact groundwater quality.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11402F1","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Water, which covers the majority of the earth's surface, circulates through the crust, oceans, and atmosphere in what is known as the \"water cycle.\" Water evaporates from the earth's surface, rises and cools as it rises to higher elevations, condenses as rain or snow, and falls to the surface where it collects in lakes, oceans, soil and in soil and rocks underground."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11402F2","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Water is a solvent. As it passes through the water cycle, especially as it moves on the earth's surface and underground, it dissolves minerals and gases and carries them to the oceans, rivers, and other surface water."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11402F3","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Natural and human forces can contribute to contamination of surface water and groundwater."}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Understand and apply knowledge of earth history based on physical evidence.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11402F4","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"The earth processes we see today including erosion, movement of tectonic plates, and changes in atmospheric composition are similar to those that occurred in the past."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11402F5","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Earth history is also influenced by occasional catastrophes such as the impact of an asteroid or a comet."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11402F6","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Fossils provide important evidence of how life and environmental conditions have changed."}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Understand and apply knowledge of the earth's atmospheric properties and how they influence weather and climate.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11402F7","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"The atmosphere is a mixture of nitrogen, oxygen, and trace gasses that include water vapor. The atmosphere has different properties at different elevations."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11402F8","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Global patterns of atmospheric movement influence local weather. Oceans have a major effect on climate because water in the oceans holds a large amount of heat."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11402F9","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Clouds, formed by the condensation of water vapor, affect weather and climate."}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Understand and apply knowledge of the components of our solar system.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11402FA","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"The earth is the third planet from the sun in a system that includes the moon, the sun, seven other planets and their moons, and smaller objects, such as asteroids and comets. The sun, an average star, is the central and largest body in the solar system."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11402FB","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Gravity is the force that keeps planets in orbit around the sun and governs the rest of the motion in the solar system. Gravity alone holds us to the earth's surface and explains the phenomena of the tides."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11402FC","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"The sun is the major source of energy for phenomena on the earth's surface, such as growth of plants, winds, ocean currents, and the water cycle. Seasons result from variations in the amount of the sun's energy hitting the surface, due to the tilt of the earth's rotation on its axis and the length of the day."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11402FD","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Most objects in the solar system are in regular and predictable motion. Those motions explain such phenomena as the day, the year, phases of the moon, and eclipses."}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Understand and apply knowledge of energy in the earth system.","children":[{"leaf":false,"text":"Principles that underlie the concept and/or skill include but are not limited to:<ul> <li>Internal sources of energy</li> <li>External sources of energy</li> <li>Plate tectonics</li> <li>Energy transfer in the atmosphere and ocean</li></ul>","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140303","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Earth systems have internal and external sources of energy, both of which create heat. The sun is the major external source of energy. Two primary sources of internal energy are the decay of radioactive isotopes and the gravitational energy from the earth's original formation."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140304","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"The outward transfer of Earth's internal heat drives convection circulation in the mantle that propels the plates comprising the earth's surface across the face of the globe."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140305","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Heating of the earth's surface and atmosphere by the sun drives convection within the atmosphere and oceans, producing winds and ocean currents."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140306","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Global climate is determined by energy transfer from the sun at and near the earth's surface. This energy transfer is influenced by dynamic processes such as cloud cover and the earth's rotation, and static conditions such as the position of mountain ranges and oceans."}]}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Understand and apply knowledge of Geochemical cycles.","children":[{"leaf":false,"text":"Principles that underlie the concept and/or skill include but are not limited to:<ul> <li>Elements/atoms within Earth reservoirs: Solid Earth, oceans, atmosphere, and organisms</li> <li>Movement of elements/atoms between reservoirs</li></ul>","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140308","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"The earth is a system containing essentially a fixed amount of each stable chemical atom or element. Each element can exist in several different chemical reservoirs. Each element on Earth moves among reservoirs in the solid Earth, oceans, atmosphere, and organisms as part of geochemical cycles."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140309","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Movement of matter between reservoirs is driven by the earth's internal and external sources of energy. These movements are often accompanied by a change in the physical and chemical properties of the matter. Carbon, for example, occurs in carbonate rocks such as limestone, in the atmosphere as carbon dioxide gas, in water as dissolved carbon dioxide, and in all organisms as complex molecules that control the chemistryof life."}]}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Understand and apply knowledge of the origin and evolution of the earth system.","children":[{"leaf":false,"text":"Principles that underlie the concept and/or skill include but are not limited to:<ul> <li>Formation of solar system</li> <li>Geologic time</li> <li>Interactions among hydrosphere, lithosphere and atmosphere</li> <li>Life: origin, evolution, and effect on Earth systems</li></ul>","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S114030B","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"The sun, the earth, and the rest of the solar system formed from a nebular cloud of dust and gas 10 to 15 billion years ago. The early Earth was very different from the planet on which we live today."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S114030C","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Geologic time can be estimated by observing rock sequences and using fossils to correlate the sequences at various locations. Current methods for measuring geologic time include using the known decay rates of radioactive isotopes present in rocks to measure the time since the rock was formed."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S114030D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Interactions among the solid Earth, the oceans, the atmosphere, and organisms have resulted in the ongoing evolution of the earth system. We can observe some changes such as earthquakes and volcanic eruptions on a human time scale, but many processes such as mountain building and plate movements take place over hundreds of millions of years."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S114030E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Evidence for one-celled forms of life—the microbes—extends back more than 3.5 billion years. The evolution of life caused dramatic changes in the composition of the earth's atmosphere, which did not originally contain oxygen."}]}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Understand and apply knowledge of the origin and evolution of the universe.","children":[{"leaf":false,"text":"Principles that underlie the concept and/or skill include but are not limited to:<ul> <li>Age and origin of the universe</li> <li>Universe and galaxies</li> <li>Star formation</li></ul>","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140310","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"The origin of the universe remains one of the greatest questions in science. The \"big bang\" theory places the origin between 10 and 20 billion years ago, when the universe began in a hot dense state: According to this theory, the universe has been expanding ever since."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140311","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Early in the history of the universe, matter—primarily the light atoms hydrogen and helium — clumped together through gravitational attraction to form countless trillions of stars. Billions of galaxies, each of which is a gravitationally bound cluster of billions of stars, now form most of the visible mass in the universe."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140312","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Stars produce energy from nuclear reactions, primarily the fusion of hydrogen to form helium. These and other processes in stars have led to the formation of all the other elements."}]}]}]},{"leaf":false,"text":"Life Science","children":[{"leaf":false,"text":"Essential Concepts and/or Skills: Understand and apply knowledge of the characteristics of living things and how living things are both similar to and different from each other and from non-living things.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S114027F","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"Living things share some common characteristics that are both similar to and different from non-living things."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140280","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"Different species of plants and animals have different observable characteristics by which they can be classified."}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Understand and apply knowledge of life cycles of plants and animals.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140281","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"Plants and animals have life cycles that include being born, developing into adults, reproducing, and eventually dying."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140282","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"Plants and animals closely resemble their parents."}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Understand and apply knowledge of the basic needs of plants and animals and how they interact with each other and their physical environment.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140283","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"Organisms have basic needs. For example, animals need air, water, and food; plants require air, water, nutrients, and light."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140284","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"Organisms interact with each other and their physical environment."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140285","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"Organisms can survive only in environments in which their needs can be met."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140286","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"The world has many different environments, and distinct environments support the life of different types of organisms."}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Understand and apply knowledge of ways to help take care of the environment.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140287","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"Chapter 12 of the Iowa Administrative Code states that science instruction shall include conservation of natural resources; and environmental awareness."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140288","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"Humans depend on their natural and constructed environments."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140289","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"Humans change environments in ways that can be either beneficial or detrimental to themselves or other organisms."}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Understand and apply knowledge of basic human body structures (human body parts and their functions).","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S114028A","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"Humans have distinct body structures for functions including but not limited to thinking, walking, holding, seeing and talking."}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Understand and apply knowledge of good health habits.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S114028B","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"See 21st Century Skills of the Iowa Core Curriculum."}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Understand and apply knowledge of organisms and their environments, including:<ul> <li>Structures, characteristics, and adaptations of organisms that allow them to function and survive within their habitats.</li> <li>How individual organisms are influenced by internal and external factors.</li> <li>The relationships among living and non-living factors in terrestrial and aquatic ecosystems.</li></ul>","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S114028C","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"Animals depend on plants. Some animals eat plants for food. Other animals eat animals that eat the plants."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S114028D","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"An organism's patterns of behavior are related to the nature of that organism's environment, including the kinds and numbers of other organisms present, the availability of food and resources, and the physical characteristics of the environment. When the environment changes, some plants and animals survive and reproduce, others die or move to new locations."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S114028E","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"All organisms cause changes in the environment in which they live. Some of these changes are detrimental to the organism or other organisms, whereas others are beneficial."}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Understand and apply knowledge of environmental stewardship.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S114028F","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"Chapter 12 of the Iowa Administrative Code states that science instruction shall include conservation of natural resources; and environmental awareness."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140290","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"Humans change environments in ways that can be either beneficial or detrimental to themselves or other organisms."}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Understand and apply knowledge of basic human body systems and how they work together.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140291","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"The human organism has systems which interact with one another. These systems include circulatory, respiratory, digestive, musculoskeletal, etc."}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Understand and apply knowledge of personal health and wellness issues.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140292","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"See 21st Century Skills of the Iowa Core Curriculum."}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Understand and apply knowledge of the basic components and functions of cells, tissues, organs, and organ systems.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140293","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Living systems at all levels of organization demonstrate the complementary nature of structure and function. Important levels of organization for structure and function include cells, organs, tissues, organ systems, whole organisms, and ecosystems."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140294","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"All organisms are composed of cells. Most organisms are single cells; other organisms, including humans are multi-cellular."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140295","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Cells carry on the many functions needed to sustain life. They grow and divide, thereby producing more cells. This requires that they take in nutrients, which they use to provide energy for the work that cells do and to make the materials that a cell or an organism needs."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140296","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Specialized cells perform specialized functions in multi-cellular organisms. Groups of specialized cells cooperate to form a tissue, such as muscle. Different tissues are, in turn, grouped together to form larger functional units, called organs. Each type of cell, tissue, and organ has a distinct structure and set of functions that serve the organism as a whole."}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Understand and apply knowledge of how different organisms pass on traits (heredity).","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140297","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Every organism requires a set of instructions for specifying its traits. Heredity is the passage of these instructions from one generation to another."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140298","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Hereditary information is contained in genes, located in the chromosomes of each cell. Each gene carries a single unit of information. An inherited trait of an individual can be determined by one or by many genes, and a single gene can influence more than one trait. A human cell contains many thousands of different genes."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140299","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"The characteristics of an organism can be described in terms of a combination of traits. Some traits are inherited and others result from interactions with the environment."}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Understand and apply knowledge of the complementary nature of structure and function and the commonalities among organisms.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S114029A","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Living systems at all levels of organization demonstrate the complementary nature of structure and function. Important levels of organization for structure and function include cells, organs, tissues, organ systems, whole organisms, and ecosystems. Organisms are classified according to common characteristics."}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Understand and apply knowledge of:<ul> <li>interdependency of organisms, changes in environmental conditions, and survival of individuals and species.</li> <li>the cycling of matter and energy in ecosystems.</li></ul>","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S114029B","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"All organisms must be able to obtain and use resources, grow, reproduce, and maintain stable internal conditions while living in a constantly changing external environment."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S114029C","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Regulation of an organism's internal environment involves sensing the internal environment and changing physiological activities to keep conditions within the range required to survive."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S114029D","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Behavior is one kind of response an organism can make to an internal or environmental stimulus. A behavioral response requires coordination and communication on many levels, including cells, organ systems, and whole organisms. Behavioral response is a set of actions determined in part by heredity and in part from experience."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S114029E","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Species acquire many of their unique characteristics through biological adaptation which involves the selection of naturally occurring variations in populations."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S114029F","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Biological adaptations include changes in structures, behaviors, or physiology that enhance survival and reproductive success in a particular environment."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11402A0","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"For ecosystems, the major source of energy is sunlight. Energy entering ecosystems as sunlight is transferred by producers into chemical energy through photosynthesis. That energy then passes from organism to organism in food webs."}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Understand and demonstrate knowledge of the social and personal implications of environmental issues.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11402A1","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Chapter 12 of the Iowa Administrative Code states that science instruction shall include conservation of natural resources; and environmental awareness."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11402A2","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"The number of organisms an ecosystem can support depends on the resources available and abiotic factors, such as quantity of light and water, range of temperatures, and soil composition. Given adequate biotic and abiotic resources and no disease or predators, populations (including humans) increase at rapid rates. Lack of resources and other factors, such as predation and climate, limit the growth of populations in specific niches in the ecosystem."}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Understand and apply knowledge of the functions and interconnections of the major human body systems including the breakdown in structure or function that disease causes.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11402A3","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"The human organism has systems for digestion, respiration, reproduction, circulation, excretion, movement, control, and coordination, and for protection from disease. These systems interact with one another."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11402A4","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Disease is a breakdown in structures or functions of an organism. Some diseases are the result of intrinsic failures of the system. Others are the result of damage by infection by other organisms."}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Understand and apply knowledge of the cell.","children":[{"leaf":false,"text":"Principles that underlie the concept and/or skill include but are not limited to:<br /><br /> Structures and functions<ul> <li>Cell structures underlie functions</li> <li>Cell membranes; absorption and diffusion</li> <li>Basic cell processes</li></ul>","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11402B9","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Cells have particular structures that underlie their functions. Every cell is surrounded by a membrane that separates it from the outside world. Inside the cell is a concentrated mixture of thousands of different molecules which form a variety of specialized structures, notably the nucleus, mitochondria, ribosomes, chloroplasts, and the endoplasmic reticulum. Some cells have external structures facilitating movement (cilia and flagella)."}]},{"leaf":false,"text":"Principles that underlie the concept and/or skill include but are not limited to:<br /><br /> Functions and chemical reactions<ul> <li>Enzymes catalyze reactions</li> <li>Food molecules (macromolecules) break down to provide molecules for synthesis</li> <li>Cell respiration breaks down complex molecules to provide energy</li></ul>","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11402BA","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Most cell functions involve chemical reactions. Food molecules taken into cells react to provide the chemical constituents needed to synthesize other molecules. Both breakdown and synthesis are made possible by protein catalysts, called enzymes."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11402BB","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"The chemical bonds of food molecules contain energy. Energy is released when the bonds of food molecules are broken and new compounds with lower energy bonds are formed. Cells temporarily store this energy in phosphate bonds of a small high-energy compound called ATP."}]},{"leaf":false,"text":"Principles that underlie the concept and/or skill include but are not limited to:<br /><br /> Cells grow and divide<ul> <li>Cells grow and divide in a cell cycle</li></ul>","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11402BC","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Cell regulation allows cells to respond to their environment and to control and coordinate cell growth and division. Environmental factors can influence cell division."}]},{"leaf":false,"text":"Principles that underlie the concept and/or skill include but are not limited to:<br /><br /> Photosynthesis<ul> <li>Photosynthesis links sun energy to usable energy</li> <li>Basic process of photosynthesis</li></ul>","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11402BD","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Plant cells contain chloroplasts as sites of photosynthesis. Plants and many microorganisms use solar energy to combine molecules of carbon dioxide and water into complex, energy rich organic compounds and release oxygen to the environment."}]}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Understand and apply knowledge of the molecular basis of heredity.","children":[{"leaf":false,"text":"Principles that underlie the concept and/or skill include but are not limited to:<br /><br /> Genetic information in cells<ul> <li>DNA structure specifies genetic information in genes</li> <li>Genes direct and control protein synthesis</li> <li>DNA mutations</li></ul>","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11402BE","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"In all organisms, the instructions for specifying the characteristics of the organism are carried in DNA, a large polymer formed from subunits of four kinds (A, G, C, and T). The chemical and structural properties of DNA explain how the genetic information that underlies heredity is both encoded in genes (as a string of molecular \"letters\") and replicated (by a templating mechanism). DNA mutations occur spontaneously at low rates. Some of these changes make no difference to the organism, whereas others can change cells and organisms. Some mutations can be caused by environmental factors."}]},{"leaf":false,"text":"Principles that underlie the concept and/or skill include but are not limited to:<br /><br /> DNA, chromosomes, and sexual reproduction<ul> <li>DNA forms chromosomes.</li> <li>Organisms have two copies of each chromosome.</li> <li>Humans have 22 pairs plus two sex chromosomes.</li> <li>Sex cells (sperm and egg) transmit genetic information through the processes of meiotic cell division and fertilization.</li></ul>","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11402BF","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Each DNA molecule in a cell forms a single chromosome. Most of the cells in a human contain two copies of each of 22 different chromosomes plus two chromosomes that determine sex: a female contains two X chromosomes and a male contains one X and one Y. Transmission of genetic information to offspring occurs through meiosis that produces egg and sperm cells that contain only one representative from each chromosome pair. An egg and a sperm unite to form a new individual."}]},{"leaf":false,"text":"Principles that underlie the concept and/or skill include but are not limited to:<br /><br /> Basic Inheritance Patterns<ul> <li>Variability occurs as a result of fertilization</li> <li>Basic patterns of inheritance can be identified</li></ul>","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11402C0","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"The fact that an organism is formed from cells that contain two copies of each chromosome, and therefore two copies of each gene, explains many features of heredity, such as how variations that are hidden in one generation can be expressed in the next. Different genes coding for the same feature code for it in different ways thus leading to identifiable patterns in heritable traits. These patterns of inheritance can be identified and predicted."}]}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Understand and apply knowledge of biological evolution.","children":[{"leaf":false,"text":"Principles that underlie the concept and/or skill include but are not limited to:<br /><br /> Species evolution<ul> <li>Species evolve over time</li> <li>Evolution is consequence of: Population potential, genetic variability, finite resources and environmental selection</li></ul>","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11402C1","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Species evolve over time. Evolution is the consequence of the interactions of (1) the potential for a species to increase its numbers, (2) the genetic variability of offspring due to mutation and recombination of genes, (3) a finite supply of the resources required for life, and (4) the ensuing selection by the environment of those offspring better able to survive and leave offspring."}]},{"leaf":false,"text":"Principles that underlie the concept and/or skill include but are not limited to:<br /><br /> Natural Selection<ul> <li>Natural selection scientifically explains the fossil record</li> <li>Natural selection explains molecular similarity of diverse species</li> <li>Natural selection is a mechanism for evolution leading to organism diversity</li></ul>","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11402C2","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Natural selection and its evolutionary consequences provide a scientific explanation for the fossil record of ancient life forms, as well as for the striking molecular similarities observed among the diverse species of living organisms. The great diversity of organisms is the result of more than 3.5 billion years of evolution that has filled every available niche with life forms."}]},{"leaf":false,"text":"Principles that underlie the concept and/or skill include but are not limited to:<br /><br /> Relations to common ancestor<ul> <li>Current diverse species are related by descent from common ancestors</li></ul>","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11402C3","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"The millions of different species of plants, animals, and microorganisms that live on earth today are related by descent from common ancestors."}]},{"leaf":false,"text":"Principles that underlie the concept and/or skill include but are not limited to:<br /><br /> Biological classification<ul> <li>Biological classification is based on evolutionary relationships</li> <li>Species is the most fundamental classification unit</li></ul>","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11402C4","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Biological classifications are based on how organisms are related. Organisms are classified into a hierarchy of groups and subgroups based on similarities in development and DNA sequences which reflect their evolutionary relationships. Species is the most fundamental unit of classification."}]}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Understand and apply knowledge of the inter-dependence of organisms.","children":[{"leaf":false,"text":"Principles that underlie the concept and/or skill include but are not limited to:<br /><br /> Materials cycling<ul> <li>Atoms and molecules cycle (examples: carbon, nitrogen, oxygen cycles)</li></ul>","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11402C5","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"The atoms and molecules on the earth cycle among the living and nonliving components of the biosphere."}]},{"leaf":false,"text":"Principles that underlie the concept and/or skill include but are not limited to:<br /><br /> Energy flow<ul> <li>Energy transformation from producers through levels of consumer and decomposers</li></ul>","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11402C6","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Energy flows through ecosystems in one direction, from photosynthetic organisms to herbivores to carnivores and decomposers. These tropic levels can be illustrated by food chains and food webs."}]},{"leaf":false,"text":"Principles that underlie the concept and/or skill include but are not limited to:<br /><br /> Organism interrelationships<ul> <li>Cooperation and competition within ecosystems</li> <li>Interrelationships and interdependency lead to long term stable systems</li></ul>","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11402C7","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Organisms both cooperate and compete in ecosystems. The interrelationships and interdependencies of these organisms may generate ecosystems that are stable for hundreds or thousands of years."}]},{"leaf":false,"text":"Principles that underlie the concept and/or skill include but are not limited to:<br /><br /> Humans modify ecosystems<ul> <li>Human modification of ecosystems</li> <li>Habitat destruction threatens global stability</li></ul>","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11402C8","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Human beings live within the world's ecosystems. Increasingly, humans modify ecosystems as a result of population growth, technology, and consumption. Human destruction of habitats through direct harvesting, pollution, atmospheric changes, and other factors is threatening current global stability, and if not addressed, ecosystems will be irreversibly affected."}]}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Understand and apply knowledge of matter, energy, and organization in living systems.","children":[{"leaf":false,"text":"Principles that underlie the concept and/or skill include but are not limited to:<br /><br /> Sunlight energy conversion<ul> <li>Living systems require continuous energy input</li> <li>Sunlight serves as the original energy source for life</li> <li>Plants photosynthesize producing building blocks for making macromolecules and storing energy in chemical bonds </li> <li>Cell respiration releases chemical bond energy stored during photosynthesis</li></ul>","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11402C9","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Living systems require a continuous input of energy, derived primarily from the sun, to maintain their chemical and physical organization. Plants capture energy by absorbing light and using it to form strong (covalent) chemical bonds between the atoms of carbon containing (organic) molecules. These molecules can be used to assemble larger molecules (proteins, DNA, sugars, and fats). The chemical energy stored in bonds between the atoms can be used as sources of energy for life processes."}]},{"leaf":false,"text":"Principles that underlie the concept and/or skill include but are not limited to:<br /><br /> Limiting factors<ul> <li>Ecosystem and population limiting factors</li> <li>Ecosystems have finite resources</li> <li>Environmental factors and finite resources influence ecosystem interactions</li></ul>","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11402CA","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Living organisms have the capacity to produce populations of infinite size, but environments and resources are finite. The distribution and abundance of organisms and populations in ecosystems are limited by the availability of matter and energy and the ability of the ecosystem to recycle materials."}]},{"leaf":false,"text":"Principles that underlie the concept and/or skill include but are not limited to:<br /><br /> Matter and energy flow and conservation<ul> <li>Living systems require continuous energy input.</li> <li>Matter and energy are conserved as they flow through and between organisms</li> <li>Some energy dissipates into the environment as heat</li></ul>","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11402CB","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"All matter tends toward more disorganized states. Living systems require a continuous input of energy to maintain their chemical and physical organizations."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11402CC","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"As matter and energy flows through different levels of organization of living systems--cells, organs, organisms, communities—and between living systems and the physical environment, chemical elements are recombined in different ways. Each recombination results in storage and dissipation of energy into the environment as heat. Matter and energy are conserved in each change."}]}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Understand and apply knowledge of the behavior of organisms.","children":[{"leaf":false,"text":"Principles that underlie the concept and/or skill include but are not limited to:<br /><br /> Nervous systems and behavior<ul> <li>Nerve cell structure and function</li> <li>Nerve cell communications through neurotransmitters</li> <li>Sensor organs are specialized cells detecting environmental input</li></ul>","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11402CD","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Multicellular animals have nervous systems that generate behavior. Nervous systems are formed from specialized cells that conduct signals rapidly through the long cell extensions that make up nerves. The nerve cells communicate with each other by secreting specific excitatory and inhibitory molecules. In sense organs, specialized cells detect light, sound, and specific chemicals and enable animals to monitor what is going on in the world around them."}]},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11402B8","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Principles that underlie the concept and/or skill include but are not limited to:<br /><br /> The Human Organism – Basic Functions<ul> <li>The human immune system protects against microscopic and foreign substances entering the body and from cancer cells arising within</li> <li>The hormonal system exerts its influence by chemicals circulating in the blood</li> <li>Coordinated systems (nervous, muscular and bone) are necessary for locomotion</li></ul>"}]}]},{"leaf":false,"text":"Physical Science","children":[{"leaf":false,"text":"Essential Concepts and/or Skills: Understand and apply knowledge of observable and measurable properties of objects.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140220","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"Objects have many observable properties including size, weight, shape, color, temperature and the ability to react with other substances. Those properties can be measured using tools such as rulers, balances and thermometers."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140221","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"Objects are made of one or more materials."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140222","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"Objects can be described by the properties of the materials from which they are made. Properties can be used to separate or sort a group of objects or materials."}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Understand and apply knowledge of characteristics of liquids and solids.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140223","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"Materials can exist in different states – solid, liquid, and gas."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140224","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"Some common materials, such as water, can be changed from one state to another by heating or cooling."}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Understand and apply knowledge of the positions and motions of objects.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140225","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"The position of an object can be described by locating it relative to its background."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140226","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"An object's motion can be described by observing and measuring its position over time."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140227","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"An object's position or movement can be changed by pushing or pulling."}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Understand and apply knowledge of how to describe and identify substances based on characteristic properties.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140228","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"It may be necessary to use magnification to observe the component parts of some materials."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140229","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"A substance has characteristic properties. A mixture of substances often can be separated into the original substances using one or more of the characteristic properties."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S114022A","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"The properties of a substance can be measured using tools and technology."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S114022B","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"When a new material (compound) is made by chemically combining two or more materials, it has properties that are different from the original materials. For that reason, many different materials can be made from a small number of basic materials."}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Understand and apply knowledge of states of matter and changes in states of matter.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S114022C","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"Materials can exist in different states – solid, liquid and gas. Some common materials can be changed from one state to another by heating or cooling."}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Understand and apply knowledge of the concept of conservation of mass/matter.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S114022D","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"When something is broken into parts, the parts have the same total mass as the original item."}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Understand and apply knowledge of sound, light, electricity, magnetism, and heat.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S114022E","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"Sound is produced when vibrations from objects travel through a medium and are received. Sound can vary in volume. The pitch of a sound can be varied by changing the rate of vibration."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S114022F","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"Light travels in a straight line until it strikes an object. Light can be reflected by a mirror, refracted by a lens, or absorbed by an object."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140230","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"Electricity in circuits can produce light, heat, sound, and magnetic effects. Electricity can only flow through a closed circuit."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140231","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"Magnets attract and repel each other and certain kinds of other materials."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140232","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"Heat can be produced in many ways, such as burning, rubbing, or mixing one substance with another. Heat can move from one object to another by conduction."}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Understand and apply knowledge of how forces are related to an object's motion.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140233","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"The motion of an object can be described by its position, direction of motion, and speed. That motion can be measured and represented on a graph."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140234","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"Changes in speed or direction of motion are caused by forces. The greater the force, the greater the change in motion. The more massive an object, the less effect a given force will have in changing its motion."}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Understand and apply knowledge of:<ul> <li>elements, compounds, mixtures, and solutions based on the nature of their physical and chemical properties.</li> <li>physical and chemical changes and their relationship to the conservation of matter and energy.</li></ul>","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140235","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"A substance has characteristic properties, such as density, a boiling point, and solubility, all of which are independent of the amount of the sample. A mixture of substances often can be separated into the original substances using one or more of the characteristic properties."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140236","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Substances react chemically in characteristic ways with other substances to form new substances (compounds) with different characteristic properties. In chemical reactions, the total mass is conserved. Substances often are placed in categories or groups if they react in similar ways; metals is an example of such a group."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140237","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Chemical elements do not break down during normal laboratory reactions involving such treatments as heating, exposure to electric current, or reaction with acids. There are more than 100 known elements that combine in a multitude of ways to produce compounds, which account for the living and nonliving substances that we encounter."}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Understand and apply knowledge of forms of energy and energy transfer.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140238","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Energy is a property of many substances and is associated with heat, light, electricity, mechanical motion, sound, nuclei, and the nature of a chemical. Energy is transferred in many ways."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140239","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Heat moves in predictable ways, flowing from warmer objects to cooler ones, until both reach the same temperature."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S114023A","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Light interacts with matter by transmission (including refraction), absorption, or scattering (including reflection). To see an object, light from that object- emitted by or scattered from it- must enter the eye."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S114023B","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Electrical circuits provide a means of transferring electrical energy when heat, light, sound, and chemical changes are produced."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S114023C","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"In most chemical and nuclear reactions, energy is transferred into or out of a system. Heat, light, mechanical motion, or electricity might all be involved in such transfers."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S114023D","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"The sun is a major source of energy for changes on the earth's surface. The sun loses energy by emitting light. A tiny fraction of that light reaches the earth, transferring energy form the sun to the earth. The sun's energy arrives as light with a range of wavelengths, consisting of visible light, infrared, and ultraviolet radiation."}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Understand and apply knowledge of motions and forces.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S114023E","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"The motion of an object can be described by its position, direction of motion, and speed. That motion can be measured and represented on a graph."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S114023F","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"An object that is not being subjected to a force will continue to move at a constant speed and in a straight line."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140240","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"If more than one force acts on an object along a straight line, then the forces will reinforce or cancel one another, depending on their direction and magnitude. Unbalanced forces will cause changes in speed or direction of an object's motion."}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Understand and apply knowledge of the structure of atoms.","children":[{"leaf":false,"text":"Principles that underlie the concept and/or skill include but are not limited to:<ul><li>Atomic structure</li></ul>","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140253","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Matter is made of minute particles called atoms, and atoms are composed of even smaller components. These components have measurable properties, such as mass and electrical charge. Each atom has a positively charged nucleus surrounded by negatively charged electrons. The electric force between the nucleus and electrons holds the atom together."}]},{"leaf":false,"text":"Principles that underlie the concept and/or skill include but are not limited to:<ul> <li>Atomic nucleus (composition and size)</li> <li>Isotopes (related to relative mass)</li></ul>","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140254","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"The atom's nucleus is composed of protons and neutrons, which are much more massive than electrons. When an element has atoms that differ in the number of neutrons, these atoms are called different isotopes of the element."}]},{"leaf":false,"text":"Principles that underlie the concept and/or skill include but are not limited to:<ul> <li>Nuclear forces: Fission and Fusion</li></ul>","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140255","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"The nuclear forces that hold the nucleus of an atom together, at nuclear distances, are usually stronger than the electric forces that would make it fly apart. Nuclear reactions convert a fraction of the mass of interacting particles into energy, and they can release much greater amounts of energy than atomic interactions. Fission is the splitting of a large nucleus into smaller pieces. Fusion is the joining of two nuclei at extremely high temperature and pressure, and is the process responsible for the energy of the sun and other stars."}]},{"leaf":false,"text":"Principles that underlie the concept and/or skill include but are not limited to:<ul> <li>Radioactive isotopes</li> <li>Predictable rates of decay</li></ul>","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140256","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Radioactive isotopes are unstable and undergo spontaneous nuclear reactions, emitting particles and/or wavelike radiation. The decay of any one nucleus cannot be predicted, but a large group of identical nuclei decay at a predictable rate. This predictability can be used to estimate the age of materials that contain radioactive isotopes."}]}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Understand and apply knowledge of the structure and properties of matter.","children":[{"leaf":false,"text":"Principles that underlie the concept and/or skill include but are not limited to:<ul> <li>Valence electrons</li> <li>Chemical bonds</li></ul>","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140257","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Atoms interact with one another by transferring or sharing electrons that are the furthest from the nucleus. These outer electrons govern the chemical properties of the element."}]},{"leaf":false,"text":"Principles that underlie the concept and/or skill include but are not limited to:<ul> <li>Periodic table</li> <li>Periodic trends</li></ul>","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140258","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"An element is composed of a single type of atom. When elements are listed in order according to the number of protons (called the atomic number), repeating patterns of physical and chemical properties identify families of elements with similar properties. This \"Periodic Table\" is a consequence of the repeating pattern of outermost electrons and their permitted energies."}]},{"leaf":false,"text":"Principles that underlie the concept and/or skill include but are not limited to:<ul> <li>Molecular and ionic structures</li> <li>Physical properties of chemical compounds</li></ul>","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140259","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Bonds between atoms are created when electrons are paired up by being transferred or shared. A substance composed of a single kind of atom is called an element. The atoms may be bonded together into molecules or crystalline solids. A compound is formed when two or more kinds of atoms bind together chemically."}]},{"leaf":false,"text":"Principles that underlie the concept and/or skill include but are not limited to:<ul> <li>States of matter</li> <li>Relationship between pressure and volume of gasses</li></ul>","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S114025A","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Solids, liquids, and gases differ in the distances and angles between molecules or atoms and, therefore, the energy that binds them together. In solids the structure is nearly rigid; in liquids molecules or atoms move around each other but do not move apart; and in gases molecules or atoms move almost independently of each other and are mostly far apart."}]},{"leaf":false,"text":"Principles that underlie the concept and/or skill include but are not limited to:<ul> <li>Hydrocarbon compounds</li></ul>","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S114025B","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Carbon atoms can bond to one another in chains, rings, and branching networks to form a variety of structures, including synthetic polymers, oils, and the large molecules essential to life."}]}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Understand and apply knowledge of chemical reactions.","children":[{"leaf":false,"text":"Principles that underlie the concept and/or skill include but are not limited to:<ul> <li>Conservation of matter</li> <li>Common reactions</li></ul>","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S114025C","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"\"Chemical reactions\" is an essential concept of a world-class secondary science curriculum. Included in \"chemical reactions\" is the following content:<br /> Chemical reactions occur all around us, for example in health care, cooking, cosmetics, and automobiles. Complex chemical reactions involving carbon-based molecules take place constantly in every cell in our bodies."}]},{"leaf":false,"text":"Principles that underlie the concept and/or skill include but are not limited to:<ul> <li>Thermochemistry</li></ul>","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S114025D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Chemical reactions may release or consume energy. Some reactions such as the burning of fossil fuels release large amounts of energy by losing heat and by emitting light. Light can initiate many chemical reactions such as photosynthesis and the evolution of urban smog."}]},{"leaf":false,"text":"Principles that underlie the concept and/or skill include but are not limited to:<ul> <li>Types of reactions</li> <li>Acids and bases</li> <li>Common reactions in living systems</li></ul>","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S114025E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"A large number of important reactions involve the transfer of either electrons (oxidation/reduction reactions) or hydrogen ions (acid/base reactions) between reacting ions, molecules, or atoms. In other reactions, chemical bonds are broken by heat or light to form very reactive radicals with electrons ready to form new bonds. Radical reactions control many processes such as the presence of ozone and greenhouse gases in the atmosphere, burning and processing of fossil fuels, the formation of polymers, and explosions"}]},{"leaf":false,"text":"Principles that underlie the concept and/or skill include but are not limited to:<ul> <li>Reaction rates and equilibrium</li></ul>","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S114025F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Chemical reactions can take place in time periods ranging from the few femtoseconds (10-15 seconds) required for an atom to move a fraction of a chemical bond distance to geologic time scales of billions of years. Reaction rates depend on how often the reacting atoms and molecules encounter one another, on the temperature, and on the properties--including shape--of the reacting elements."}]}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Understand and apply knowledge of motions and forces.","children":[{"leaf":false,"text":"Principles that underlie the concept and/or skill include but are not limited to:<ul> <li>Motions</li> <li>Forces</li> <li>Newton's Laws</li></ul>","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140260","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Objects change their motion only when a net force is applied. Laws of motion are used to calculate precisely the effects of forces on the motion of objects. The magnitude of the change in motion can be calculated using the relationship F = ma, which is independent of the nature of the force. Whenever one object exerts force on another, a force equal in magnitude and opposite in direction is exerted on the first object."}]},{"leaf":false,"text":"Principles that underlie the concept and/or skill include but are not limited to:<ul> <li>Gravitation</li> <li>Mass vs weight</li></ul>","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140261","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Gravitation is a universal force that each mass exerts on any other mass. The strength of the gravitational attractive force between two masses is proportional to the masses and is inversely proportional to the square of the distance between them."}]},{"leaf":false,"text":"Principles that underlie the concept and/or skill include but are not limited to:<ul> <li>Electric & magnetic forces</li></ul>","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140262","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"The electric force is a universal force that exists between any two charged objects. Opposite charges attract while like charges repel. The strength of the force is proportional to the charges, and, as with gravitation, inversely proportional to the square of the distance between them."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140263","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Between any two charged particles, electric force is vastly greater than the gravitational force. Most observable forces such as those exerted by a coiled spring or friction may be traced to electric forces acting between atoms and molecules."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140264","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Electricity and magnetism are two aspects of a single electromagnetic force. Moving electric charges produce magnetic forces, and moving magnets produce electric forces. These effects help students to understand electric motors and generators."}]}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Understand and apply knowledge of conservation of energy and increase in disorder.","children":[{"leaf":false,"text":"Principles that underlie the concept and/or skill include but are not limited to:<ul> <li>Types of energy</li> <li>Energy transformations</li> <li>Conservation of energy</li></ul>","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140265","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"\"Conservation of energy and increase in disorder\" is an essential concept of a world-class secondary science curriculum. Included in \"conservation of energy and increase in disorder\" is the following content:<br /> The total energy of the universe is constant. Energy can be transferred by collisions in chemical and nuclear reactions, by light waves and other radiations, and in many other ways. However, it can never be destroyed. As these transfers occur, the matter involved becomes steadily less ordered."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140266","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"All energy can be considered to be either kinetic energy, which is the energy of motion; potential energy, which depends on relative position; or energy contained by a field, such as electromagnetic waves."}]}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Understands and applies knowledge of interactions of energy and matter.","children":[{"leaf":false,"text":"Principles that underlie the concept and/or skill include but are not limited to:<ul> <li>Wave phenomena</li> <li>Energy and matter</li> <li>Electromagnetic waves</li></ul>","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140267","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"\"Interactions of energy and matter\" is an essential concept of a world-class secondary science curriculum. Included in \"interactions of energy and matter\" is the following content:<br /> Waves, including sound and seismic waves, waves on water, and light waves have energy and can transfer energy when they interact with matter."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140268","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Electromagnetic waves result when a charged object is accelerated or decelerated. Electromagnetic waves include radio waves (the longest wavelength), microwaves, infrared radiation (radiant heat), visible light, ultraviolet radiation, x-rays, and gamma rays. The energy of electromagnetic waves is carried in packets whose magnitude is inversely proportional to the wavelength."}]}]}]},{"leaf":false,"text":"Science as Inquiry","children":[{"leaf":false,"text":"Essential Concepts and/or Skills: Ask questions about objects, organisms, and events in the environment.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11401E3","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"Students should answer their questions by seeking information from their own observations, investigations and from reliable sources of scientific information."}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Plan and conduct simple investigations.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11401E4","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"In earliest years, investigations are largely based on direct observations.  As students develop, they design and conduct simple investigations to answer questions."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11401E5","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"It is important to follow appropriate safety procedures when conducting investigations."}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Use tools to gather data and extend the senses.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11401E6","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"Students use tools such as rulers, thermometers, watches, balances, spring scales, magnifiers and microscopes to extend their senses and their abilities to gather data."}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Use mathematics in scientific inquiry.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11401E7","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"Students use tools such as rulers, thermometers, watches, balances, spring scales, magnifiers and microscopes to extend their senses and their abilities to gather data."}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Use data to construct reasonable explanations.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11401E8","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"Students should learn what constitutes evidence."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11401E9","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"Students' explanations should reflect the evidence they have obtained."}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Communicate investigations and explanations.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11401EA","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"Students should begin to develop the abilities to communicate, critique, and analyze their work and the work of other students."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11401EB","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"Students should communicate orally, through writing or through drawings."}]},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11401BF","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"Essential Concepts and/or Skills: Follow appropriate safety procedures when conducting investigations."},{"leaf":false,"text":"Essential Concepts and/or Skills: Identify and generate questions that can be answered through scientific investigations.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11401EC","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"Students ask questions that they can answer with scientific knowledge combined with their own observations."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11401ED","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"Students recognize that different questions lead to different types of investigations."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140201","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Students should develop the ability to refine and refocus broad and ill-defined questions. An important aspect of this ability consists of clarifying questions and inquiries and directing them toward objects and phenomena that can be described, explained, or predicted by scientific investigations."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140202","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Students should develop the ability to connect their questions with scientific ideas, concepts, and quantitative relationships that guide investigations."}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Recognize that scientists perform different types of investigations.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11401EE","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"Types of investigations include describing objects, events, and organisms; classifying them; and doing a fair test (experimenting), depending on the types of questions they want to answer."}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Plan and conduct scientific investigations.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11401EF","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"Students should engage in systematic observation, making accurate measurements, and identifying and controlling variables."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11401F0","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"Students understand the concept of a fair test."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11401F1","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"Students follow appropriate safety procedures when conducting investigations."}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Use appropriate tools and techniques to gather, process, and analyze data.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11401F2","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"Students enhance their skills with tools such as rulers, thermometers, balances, spring scales, magnifiers and microscopes."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11401F3","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"Students are introduced to the use of computers and calculators for conducting investigations."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11401F4","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"Students' use of appropriate tools is guided by the questions asked and the investigations students design."}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Incorporate mathematics in science inquiries.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11401F5","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"Mathematics is used to gather, organize and present data and to construct convincing explanations."}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Use evidence to develop reasonable explanations.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11401F6","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"Students should determine what constitutes evidence."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11401F7","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"Students should judge the merits or strengths of the data and information used to make explanations."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11401F8","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"Students' explanations should reflect the evidence they have obtained in their investigations."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11401F9","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"Students should check their explanations against scientific knowledge, their own experiences, and observations of others."}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Communicate scientific procedures and explanations.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11401FA","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"Students should communicate, critique, and analyze their work and the work of other students."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11401FB","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"Students should share procedures and explanations through various means of communication."}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Design and conduct different kinds of scientific investigations.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11401FC","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Students understand that different kinds of questions suggest different kinds of scientific investigations."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11401FD","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Students should develop general abilities such as making systematic observations, taking accurate measurements, and identifying and controlling variables."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11401FE","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Students should develop the ability to clarify ideas that are influencing and guiding their inquiry, and to understand how those ideas compare with current scientific knowledge."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11401FF","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Students formulate questions, design investigations, execute investigations, interpret data, use evidence to generate explanations, propose alternative explanations, and critique explanations and procedures."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140200","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Students use appropriate safety procedures when conducting investigations."}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Essential Concepts and/or Skills: Understand that different kinds of questions suggest different kinds of scientific investigations.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140203","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Some investigations involve observing and describing objects, organisms and events; some involve collecting specimens; some involve experiments; some involve seeking more information; some involve discovery of new objects and phenomena; and some involve making models."}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Select and use appropriate tools and techniques to gather, analyze and interpret data.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140204","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"The use of tools and techniques, including computers, will be guided by the questions asked and the investigations students design. Students should be able to access, gather, store, retrieve, and organize data, using computer hardware and software designed for these purposes."}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Incorporate mathematics in scientific inquiry.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140205","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Mathematics is used to gather, organize and present data and to construct convincing explanations."}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Use evidence to develop descriptions, explanations, predictions, and models.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140206","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Students should base their explanations on observations and they should be able to differentiate between description and explanation."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140207","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Developing explanations establishes connections between the content of science and the contexts in which students develop new knowledge."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140208","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Models are often used to think about processes that happen too slowly, too quickly, or on too small a scale to observe directly, or are too vast to be changed deliberately, or are potentially dangerous."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1140209","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Different models can be used to represent the same thing."}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Think critically and logically to make the relationships between evidence and explanations.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S114020A","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Students decide what evidence should be used and develop the ability to account for anomalous data."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S114020B","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Students should be able to review data from an experiment, summarize the data, and form a logical argument between cause and effect relationships."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S114020C","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Students should begin to state some explanations in terms of relationships between two or more variables."}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Recognize and analyze alternative explanations and predictions.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S114020D","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Students should develop the ability to listen to and respect the explanations proposed by other students. They should remain open to and acknowledge different ideas and explanations, be able to accept the skepticism of others, and consider alternative explanations."}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Communicate and defend procedures and explanations.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S114020E","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Students should become competent in communicating experimental methods, describing observations and summarizing the results of investigations. Explanations can be communicated through various methods."}]},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11401CF","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Essential Concepts and/or Skills: Use appropriate safety procedures when conducting investigations."},{"leaf":false,"text":"Essential Concepts and/or Skills: Identify questions and concepts that guide scientific investigations.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11401D7","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Students formulate a testable hypothesis and demonstrate the logical connections between the scientific concepts guiding a hypothesis and the design of an experiment. They should demonstrate appropriate procedures, a knowledge base, and conceptual understanding of scientific investigations. The key is that the student demonstrates knowledge of the scientific concepts through the investigation."}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Design and conduct scientific investigations.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11401D8","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Designing and conducting a scientific investigation requires introduction to the major concepts in the area being investigated, proper equipment, safety precautions, assistance with methodological problems, recommendations for use of technologies, clarification of ideas that guide the inquiry, and scientific knowledge obtained from sources other than the actual investigation. The investigation may also require student clarification of the question, method, controls, and variables; student organization and display of data; student revision of methods and explanations; and a public presentation of the results with a critical response from peers. Regardless of the scientific investigation performed, students must use evidence, apply logic, and construct an argument for their proposed explanations."}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Use technology and mathematics to improve investigations and communications.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11401D9","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"A variety of technologies, such as hand tools, measuring instruments, and calculators should be an integral component of scientific investigations. The use of computers for the collection, analysis, and display of data is also a part of this concept."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11401DA","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Mathematics is essential to asking and answering questions about the natural world. Mathematics can be used to ask questions; to gather, organize, and present data; and to structure convincing explanations."}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Formulate and revise scientific explanations and models using logic and evidence.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11401DB","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Student inquiries should culminate in formulating an explanation or model. Models should be physical, conceptual, and mathematical. In the process of answering the questions, the students should engage in discussions and arguments that result in the revision of their explanations. These discussions should be based on scientific knowledge, the use of logic, and evidence from their investigation."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11401DC","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Thinking critically about evidence includes deciding what evidence should be used and accounting for anomalous data. Specifically, students should be able to review data from a simple experiment, summarize the data, and form a logical argument about the cause-and-effect relationships in the experiment."}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Recognize and analyze alternative explanations and models.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11401DD","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"This aspect of the standard emphasizes the critical abilities of analyzing an argument by reviewing current scientific understanding, weighing the evidence, and examining the logic so as to decide which explanations and models are best. In other words, although there may be several plausible explanations, they do not all have equal weight. Students should be able to use scientific criteria to find the preferred explanations."}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Communicate and defend a scientific argument.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11401DE","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Students in school science programs should develop the abilities associated with accurate and effective communication. These include writing and following procedures, expressing concepts, reviewing information, summarizing data, using language appropriately, developing diagrams and charts, explaining statistical analysis, speaking clearly and logically, constructing a reasoned argument, and responding appropriately to critical comments."}]},{"leaf":false,"text":"Essential Concepts and/or Skills: Understand about scientific inquiry.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11401DF","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Scientists usually inquire about how physical, living, or designed systems function."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11401E0","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Scientists conduct investigations for a wide variety of reasons."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11401E1","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Scientific explanations must abide by the rules of evidence, be open to possible modifications, and satisfy other criteria."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S11401E2","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Results of scientific inquiry - new knowledge and methods - emerge from different types of investigations and public communication among scientists."}]}]},{"leaf":false,"text":"Integrated Standard: History and Nature of Science","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11401B5","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Understand significance of historical scientific events and technological advances; recognize/relate contributions of other cultures, groups and individuals; work as part of a team; build on work of others; engage in peer review; use logical arguments; rely on evidence; recognize/use new information; change hypotheses; identify/evaluate \"great leaps\"; recognize/evaluate what is and is not science."}]},{"leaf":false,"text":"Integrated Standard: Science as Inquiry","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11401B6","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Identify questions and related concepts; design and conduct scientific investigations; use technology and mathematics; formulate and revise scientific explanations and models; recognize and analyze alternative explanations and models, communicate and defend a scientific argument, observe; experiment, measure, graph, evaluate, discuss/debate, research, collect/analyze data, imagine, diagram, concept map, engage in peer review, recognize experimental error, reflect, and predict."}]},{"leaf":false,"text":"Integrated Standard: Science and Technology","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11401B7","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Identify problem or design an opportunity; propose a design and choose between alternative solutions; implement proposed solution; evaluate solution and its consequences; communicate a problem, process, and solution; use computer software, device interfaces, lab equipment, calculators, and GPS; use presentation software and hardware, communications equipment, and remote sensing equipment; generate and manipulate data; describe the connection between technology and the state of current knowledge."}]},{"leaf":false,"text":"Integrated Standard: Science in Personal and Social Perspectives","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S11401B8","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Make appropriate personal/lifestyle/technology choices, evaluate, observe, discuss/debate, recognize interactions and interdependencies at all levels, explain, describe environmental effects of public policy, choose appropriate course(s) of action."}]}]