[{"leaf":false,"text":"Produce","children":[{"leaf":false,"text":"1.\tUse selected materials to produce works of art. <ul>Examples:\twater-soluble paint, clay</ul>","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S112A882","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"<ul><li>Creating works of art using a variety of traditional processes</li></ul> <ul>Examples:\tcrayon-resist paintings, folding and curling different kinds of paper </ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112A883","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"<ul><li>Creating two- and three-dimensional art forms</li></ul> <ul>Examples:\tfinger paintings, paper collages, clay pinch pots </ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112A884","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"<ul><li>Recognizing safe and proper use and care of basic tools, materials, and supplies, including scissors, pencils, crayons, markers, glue, paints, paintbrushes, and clay</li></ul> <ul>Example:\tproperly holding and using scissors to cut paper </ul>"}]},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112A885","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"2.\tUse line, shape, color, texture, and repetition to produce works of art. <ul>Examples:\tline—curved, straight, jagged, zigzag, bumpy, wavy;<br /> shape—circle, triangle, square;<br /> color—primary, secondary;<br /> texture—rough, smooth, soft, furry;<br /> repetition—pattern </ul>"},{"leaf":false,"text":"3.\tCreate works of art to communicate ideas and moods.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S112A887","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"<ul><li>Producing expressive portraits</li></ul>"}]},{"leaf":false,"text":"1.\tCreate works of art using a variety of techniques. <ul>Example:\tcreating prints and collages using found objects</ul>","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S112A891","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"<ul><li>Creating works of art using a variety of subject matter, including still life paintings and portraits</li></ul> <ul>Examples:\tstill life painting of fruit in a bowl, family portraits </ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112A892","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"<ul><li>Producing three-dimensional works of art</li></ul> <ul>Examples:\tfound-object sculptures, clay sculptures such as pinch pots </ul>"}]},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112A893","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"2.\tApply primary, secondary, and neutral colors; line direction; form; and space to create works of art. <ul>Examples:\tprimary and secondary colors—mixing primary colors to achieve secondary \tcolors in paintings of aliens,<br /> neutral colors—creating and painting sculptures similar to Charles Lucas' \toutdoor sculpture The New Breed,<br /> line direction—creating paintings similar to Piet Mondrian's  \tBroadway Boogie Woogie,<br /> form—creating a work of art similar to Frederick Roth's sculpture \tColumbia Lion,<br /> space—creating figures using found objects such as spools and cardboard \ttubes</ul>"},{"leaf":false,"text":"1.\tApply a variety of procedures, methods, and subject matter in the production of two-dimensional works of art, including landscapes, still lifes, and relief prints. <ul>Example:\tproducing paintings, drawings, and relief prints of family life and neighborhood play </ul>","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S112A89B","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"<ul><li>Producing three-dimensional works of art</li></ul> <ul>Example:\tpinching and pulling clay to create clay dinosaurs </ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112A89C","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"<ul><li>Demonstrating appropriate safety, care, and use of printmaking and sculptural materials and equipment</li></ul> <ul>Examples:\tprintmaking inks, carving instruments, wire sculptures  </ul>"}]},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112A89D","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"2.\tApply analogous and intermediate colors, symmetrical balance, and geometric and organic shapes in the production of works of art. <ul>Examples:\tmonoprint of butterfly, landscapes with intermediate color schemes, Georgia O'Keeffe's flower images in pastel drawings</ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112A89E","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"3.\tExpress ideas, feelings, and moods through traditional and digital media in creating works of art. <ul>Examples:\tshowing happiness by using traditional media such as crayons or paints in the production of a portrait based on Paul Klee's Senecio or Head of a Man, using digital drawing and painting programs to generate ideas in the production of a fantasy cityscape</ul>"},{"leaf":false,"text":"1.\tUtilize a variety of processes and media in the production of artwork. <ul>Examples:\tproducing a drawing using markers and crayons, creating a painting using watercolors and pastels on watercolor paper </ul>","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S112A8A8","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"<ul><li>Utilizing digital processes to produce works of art</li></ul> <ul>Example:\tusing a paint program to design a digital quilt </ul>"}]},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112A8A9","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"2.\tProduce works of art depicting genre subject matter. <ul>Examples:\tinteriors in the paintings of Benny Andrews and Pieter Brueghel, landscapes of Grandma Moses (Anna Mary Robertson), portraits of daily life by Norman Rockwell</ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112A8AA","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"3.\tApply the elements of art and principles of design, including complementary and monochromatic color schemes, value, contrast, and asymmetrical balance in works of art. <ul>Examples:\tusing positive and negative space or complementary color schemes to create contrast in designs, using gray scales, mixing white to create tints and black to create shades</ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112A8AB","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"4.\tCreate symbolic works of art to communicate ideas. <ul>Example:\tusing personal symbols to create a medieval family crest or heraldry</ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112A8AC","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"5.\tDemonstrate appropriate safety, care, and use of art materials and equipment."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112A8B3","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"1.\tProduce two- and three-dimensional works of art with a variety of traditional and digital processes, materials, subject matter, and techniques. <ul>Examples:\tprocesses—using a digital camera to create images to be digitally altered;<br /> materials—creating papier-mâché animals;<br /> subject matter—creating portraits, landscapes, still lifes, interiors, or \tseascapes;<br /> techniques—layering materials such as cardboard, \trubber, fabric, paper clips, and papers to create a collagraph </ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112A8B4","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"2.\tUse traditional and digital media in the production of graphic design to communicate ideas and feelings. <ul>Example:\tdesigning posters, book covers, or logos on the themes of recycling, drug awareness, or endangered species</ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112A8B5","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"3.\tApply the elements of art and principles of design, including rhythm, movement, and emphasis, in the creation of works of art. <ul>Examples:\tproducing collages or paintings similar to those of Romare Bearden and Piet Mondrian that were inspired by music, creating works of art similar to Diego Rivera's works that were inspired by everyday life experiences in Mexico </ul>"},{"leaf":false,"text":"1.\tUtilize the elements of art and principles of design and the structures and functions of art to communicate personal ideas. <ul>Example:\tcreating a painting, drawing, or sculpture in reaction to world events, drug awareness, or medical issues</ul>","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S112ABBB","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"<ul><li>Creating works of art utilizing a variety of traditional found and recyclable objects</li></ul> <ul>Example:\tusing Samuel \"Sambo\" Mockbee's architectural structures as motivation to produce recycled structures </ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112ABBC","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"<ul><li>Producing one-point perspective drawings</li></ul> <ul>Example:\tdrawing cubes using a vanishing point </ul>"}]},{"leaf":false,"text":"2.\tApply variety and unity in the production of two- and three-dimensional works of art. <ul>Example:\tusing Joan Miró's Horse Carnival of Harlequins to create a circus, carnival, zoo painting, or diorama </ul>","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S112ABBE","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"<ul><li>Producing moving and stationary sculptures</li></ul> <ul>Examples:\tmobiles, totem poles, origami paper sculptures, clay coil or slab-built pottery </ul>"}]},{"leaf":false,"text":"1.\tCreate works of art utilizing a variety of traditional and nontraditional media and techniques. <ul>Examples:\ttorn-paper collage, weaving, wire sculpture, clay relief</ul>","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S112ABC9","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"<ul><li>Applying steps artists use in the production of art, including conceptualizing ideas and forms, refining ideas and forms, and reflecting on and evaluating both the process of production and the product</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112ABCA","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"<ul><li>Applying the elements of art and principles of design to the production of two- and three-dimensional artwork</li></ul> <ul>Examples:\ttwo-dimensional—monochromatic paintings, found or natural object \tprints, texture-rubbing compositions;<br /> three-dimensional—papier-mâchè masks, clay whistles </ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112ABCB","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"<ul><li>Creating original multimedia works of art</li></ul> <ul>Examples:\ttelevision broadcasts, digital imaging, multimedia presentations </ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112ABCC","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"<ul><li>Creating original works of art using observational skills</li></ul> <ul>Examples:\tdrawing a shoe; painting a still life; creating a landscape in mixed-media; creating timed, gesture studies of a figure </ul>"}]},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112ABCD","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"2.\tProduce works of art using one- and two-point perspectives. <ul>Example:\tdrawing a cityscape or still life of geometric shapes that uses a vanishing point and horizontal line</ul>"}]},{"leaf":false,"text":"Respond","children":[{"leaf":false,"text":"4.\tIdentify line, shape, color, texture, and repetition in works of art.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S112A889","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"<ul><li>Identifying similarities and differences in works of art</li></ul> <ul>Examples:\tshape, color, size </ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112A88A","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"<ul><li>Identifying media used in a work of art</li></ul> <ul>Examples:\tpaint, clay, crayons </ul>"}]},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112A88B","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"5.\tIdentify moods, feelings, and emotions generated by a work of art. <ul>Examples:\thappiness, sadness</ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112A894","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"3.\tIdentify neutral colors, form, and space in works of art. <ul>Examples:\tneutral colors—Georges Braques' Cubist still life paintings,<br /> form—Pueblo Indian ceramic storyteller sculptures,<br /> space—Alexander Calder's mobiles</ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112A895","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"4.\tRecognize similarities and differences in media, visual and tactile characteristics, and natural or man-made forms used in artwork. <ul>Examples:\tmedia—differences between tempera and watercolor paints,<br /> visual and tactile characteristics—Jacob Lawrence's collages versus Frank \tStella's and George Seurat's paintings,<br /> natural or man-made forms—texture of pine cone versus texture of concrete \tblock</ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112A896","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"5.\tDescribe moods, feelings, and emotions depicted by a work of art. <ul>Examples:\tdark room representing loneliness, sunny sky representing cheerfulness</ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112A89F","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"4.\tExplain similarities and differences in works of art, including color schemes, symmetrical balance, and geometric and organic shapes. <ul>Examples:\tnaming similarities and differences in works by Eric Carle and Peter Max depicting butterflies, discussing organic shapes in Henry Moore's sculpture Working Model for Oval with Points and geometric shapes in David Smith's Cubi series sculptures</ul>"},{"leaf":false,"text":"5.\tDescribe the media technique used in a specific work of art. <ul>Example:\tdescribing the technique of pointillism used by Georges Seurat in A Sunday on La Grande Jatte</ul>","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S112A8A1","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"<ul><li>Identifying the technique of spatial relationships, including foreground, middle ground, and background</li></ul> <ul>Example:\tidentifying overlapping shapes that create depth in Grant Wood's landscapes </ul>"}]},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112A8A2","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"6.\tRelate moods, feelings, and emotions generated by a work of art to life experiences. <ul>Example:\trelating happy moods and feelings of children at play as depicted in Winslow Homer's Snap the Whip to those of contemporary neighborhood children at play </ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112A8AD","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"6.\tCompare works of art in terms of complementary color schemes, value, contrast, and asymmetrical balance. <ul>Example:\tcomparing elements of art and principles of design used to depict water in Winslow Homer's Gulf Stream and Katsushika Hokusai's The Great Wave</ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112A8AE","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"7.\tIdentify symbols and signs depicting specific ideas, moods, feelings, and emotions generated by a work of art. <ul>Examples:\tsign depicting theme of love in Robert Indiana's Love sculpture, raising of the flag in the National Iwo Jima Memorial Monument generating feelings of patriotism </ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112A8AF","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"8.\tIdentify ideas and feelings expressed by individual artists in works of art. <ul>Examples:\tfeeling of triumph in Emmanuel Leutze's painting George Washington Crossing the Delaware, feeling of happiness in Robert Henri's Laughing Child</ul>"},{"leaf":false,"text":"4.\tDescribe how the elements of art and principles of design, including rhythm, movement, and emphasis, are used in a specific work of art. <ul>Examples:\tmovement as depicted in the use of line and painting techniques in Wassily Kandinsky's abstract works, emphasis as depicted in Giorgio de Chirico's  The Nostalgia of the Infinite, rhythm as depicted in Jackson Pollock's Autumn Rhythm, movement in Glenna Goodacre's sculpture Puddle Jumpers </ul>","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S112A8B7","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"<ul><li>Critiquing works of art orally or in writing, using the elements of art and principles of design</li></ul> <ul>Example:\treflecting upon the creative process and success of personal works of art in an electronic portfolio </ul>"}]},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112A8B8","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"5.\tDescribe functions of art within the total environment, including functional sculptures, urban improvement, and transportation. <ul>Examples:\tfunctional sculptures—fountains, benches, playground equipment; urban improvement—murals on walls; transportation—bridges </ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112A8B9","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"6.\tCompare different interpretations of the same subject or theme in art. <ul>Example:\tlandscapes by Impressionist and Hudson River School artists</ul>"},{"leaf":false,"text":"3.\tExplain the elements of art and principles of design, including variety and unity in a work of art. <ul>Examples:\tvariety—shapes and lines in Joan Miró's Composition, unity—black lines in Henri Matisse's Purple Robe and Anemones</ul>","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S112ABC0","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"<ul><li>Applying appropriate vocabulary in discussing a work of art</li></ul>"}]},{"leaf":false,"text":"4.\tCritique personal works of art orally or in writing according to specified criteria, including elements of art, principals of design, technical skill, and creativity.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S112ABC2","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"<ul><li>Organizing the progression of artwork in a personal portfolio</li></ul>"}]},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112ABCE","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"3.\tApply appropriate vocabulary in discussing a work of art. <ul>Examples:\tdiscussing the use of cool colors, organic shapes, and flat perspective in Marc Chagall's Green Violinist; explaining movement in Giacomo Balla's Dynamism of a Dog on a Leash</ul>"},{"leaf":false,"text":"4.\tDiscuss strengths and weaknesses of a personal portfolio or other work of art.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S112ABD0","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"<ul><li>Defining the four-step process of critical analysis, including describing what is seen, analyzing how each artist arranged the elements of art and principles of design, interpreting expressive intent and purpose, and judging the effectiveness of communication</li></ul> <ul>Example:\tanalyzing Miriam Schapiro's The Poet #2 by asking \"What do I see in the painting?,\" \"How did the artist organize the elements of art and principles of design?,\" \"What is the message that the artist is trying to convey?,\" and \"How effective is the artwork?\" </ul>"}]}]},{"leaf":false,"text":"Understand","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S112A88C","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"6.\tIdentify artistic characteristics of cultures, times, and places. <ul>Examples:\tcultures—designs on tribal masks of Africa and carnival masks of Brazil,<br /> times—line quality of prehistoric cave drawings,<br /> places—architectural design of medieval castles in Europe </ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112A88D","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"7.\tIdentify examples of visual arts within the community. <ul>Examples:\tarchitecture, murals, environmental sculptures, digital media productions</ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112A88E","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"8.\tIdentify works of art viewed by using digital media tools and products. <ul>Example:\tusing the Internet to participate in interactive museum programs</ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112A88F","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"9.\tIdentify similarities among the visual arts and other disciplines. <ul>Examples:\tlanguage arts—viewing illustrations in literary selections by authors or \tillustrators such as Eric Carle, Gerald McDermott, and Dr. Seuss; social studies—identifying similarities and differences in clothing styles worn \tby people of various time periods, cultures, and professions</ul>"},{"leaf":false,"text":"6.\tRecognize artistic characteristics of various cultures, times, and places. <ul>Examples:\tcultures—dots in Aboriginal dream paintings,<br /> times—fashion depicted in Early American paintings,<br /> places—pyramids of Egypt</ul>","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S112A898","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"<ul><li>Using digital media to view works of art</li></ul> <ul>Example:\tusing a CD-ROM to view characteristics of works of art</ul>"}]},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112A899","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"7.\tIdentify visual arts professions within a community. <ul>Examples:\tlandscape architects, sculptors, interior designers, museum curators</ul>"},{"leaf":false,"text":"7.\tDescribe artistic styles of various cultures, times, and places. <ul>Examples:\tcultures—Japanese painting techniques,<br /> times—mosaics of the Roman Empire,<br /> places—architectural structures of the Middle East and Russia</ul>","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S112A8A4","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"<ul><li>Describing ways in which visual arts connect to other disciplines</li></ul> <ul>Example:\tdescribing Edgar Degas' ballerina works in relation to dance, Pablo Picasso's Three Musicians in relation to instrumental music, and George Rouault's clowns in relation to costumes in theatre productions </ul>"}]},{"leaf":false,"text":"8.\tIdentify ways art reflects and records history. <ul>Examples:\tpictographs created by Plains Indians, glyphs created by Mayan Indians, paintings and sculptures of the American West created by Frederic Remington</ul>","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S112A8A6","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"<ul><li>Using digital media to view works of art</li></ul>"}]},{"leaf":false,"text":"9.\tContrast artistic styles of various cultures, times, and places. <ul>Examples:\tcultures—Asian landscapes versus Albert Bierstadt's American landscapes, times—art deco interiors versus minimalist interiors, places—paintings of covered bridges in rural areas versus suspension bridges in urban areas</ul>","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S112A8B1","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"<ul><li>Using digital media to compare artistic styles of various works of art</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112A8B2","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"<ul><li>Identifying symbols from different cultures, times, and places that portray common themes</li></ul> <ul>Examples:\tcolor purple relating to royalty, arrow or spear symbolizing the hunt </ul>"}]},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112A8BA","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"7.\tUtilize community resources to identify works of art from various cultures, times, and places. <ul>Examples:\tguest artists, artists-in-residence, museums, libraries, universities </ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112A8BB","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"8.\tIdentify works of art from various artists that were inspired by the environments in which they were created. <ul>Example:\tAlabama artists inspired by their heritage and environment, including Howard Finster's painting Coke Bottle, Jimmy Lee Sudduth's painting Cotton Pickers, and Frank Fleming's sculpture Storyteller </ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112ABC3","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"5.\tIdentify societal values, beliefs, and everyday experiences expressed through works of art. <ul>Examples:\tsatire expressed in editorial cartoons, societal values expressed by the digital animation industry</ul>"},{"leaf":false,"text":"6.\tDescribe works of art according to the style of various cultures, times, and places. <ul>Examples:\tcultures—artistic styles of Native American cultures of the Southwestern and \tPacific Northwestern United States, times—Asher B. Durand's early nineteenth-century painting Kindred Spirits, places—gargoyles and sculptures known as grotesques from European \tcountries</ul>","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S112ABC5","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"<ul><li>\tDescribing ways in which the subject matter of other disciplines is interrelated with the visual arts</li></ul> <ul>Examples:\tmathematics—Mavrits Cornelis (M. C.) Esher and tesselations;<br /> language arts—Patricia Pollaco and book illustrations;<br /> social studies—Matthew Brady and Civil War photography;<br /> science—transformation of shapes to forms, circles to spheres, squares \tto cubes, and triangles to pyramids </ul>"}]},{"leaf":false,"text":"7.\tAssociate a particular artistic style with an individual artist. <ul>Examples:\tClaude Monet with Impressionism, Claes Oldenberg with pop art, Alfred Leslie with photorealism</ul>","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S112ABC7","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"<ul><li>•\tUsing traditional and digital media to arrange works of art according to culture, theme, and historical period</li></ul> <ul>Example:\tarranging works of art within a specific art movement or on a timeline </ul>"}]},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112ABD1","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"5.\tDefine the appropriate technical terminology in creating a work of art. <ul>Example:\texplaining the terms greenware and bisque-fired when discussing the creation of a piece of pottery</ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112ABD2","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"6.\tDiscuss ways in which the subject matter of other disciplines is connected with the visual arts. <ul>Examples:\tconnection of plants and animals in a rainforest to Henri Rousseau's The Peaceable Kingdom; relationship of music to Wassily Kandinsky's paintings; relationship of measurement, scales, and proportion to Chuck Close's portraits </ul>"},{"leaf":false,"text":"7.\tDescribe historical and cultural influences on works of art. <ul>Examples:\thistorical—creating a computer presentation depicting works of art of the Civil \tWar, cultural—comparing the impact of racism in Faith Ringgold's Flag Quilt and \tWilliam Johnson's Moon Over Harlem </ul>","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S112ABD4","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"<ul><li>Identifying various art periods and movements</li></ul> <ul>Examples:\tperiods—comparing Mayan temples and Egyptian pyramids or\tRenaissance and twentieth-century paintings, movements—comparing Impressionism and Cubism or Surrealism and \tRealism </ul>"}]}]},{"leaf":false,"text":"Level I Visual Arts","children":[{"leaf":false,"text":"Produce","children":[{"leaf":false,"text":"1.\tCreate original works of art from direct observation.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S112ABD7","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"<ul><li>Organizing spatial relationships utilizing linear and atmospheric perspective </li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112ABD8","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"<ul><li>Creating the illusion of three-dimensional forms through tonal rendering</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112ABD9","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"<ul><li>Incorporating traditional categories of subject matter into original works of art</li></ul> <ul>Examples:\tdrawing a still life, painting a landscape, sculpting a portrait </ul>"}]},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112ABDA","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2.\tCreate original works of art using reflective ideas, personal experiences, and imaginary content. <ul>Examples:\treactions to current events, cultural traditions, fantasy</ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112ABDB","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3.\tApply steps artists use in the production of art, including conceptualizing ideas and forms, refining ideas and forms, and reflecting on and evaluating both the process of production and the product."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112ABDC","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4.\tApply the elements of art and principles of design to the production of two- and three-dimensional artwork."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112ABDD","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"5.\tDemonstrate the use of traditional, digital, and multimedia techniques to create works of art. <ul>Examples:\ttwo-dimensional expression in books, comic strips, and timelines; enhancement of images in a digital imaging program; three-dimensional expression in dioramas, masks, puppets, mobiles, stabiles, scenery, and props</ul>"},{"leaf":false,"text":"6.\tDemonstrate safe and responsible handling of art materials, including cleanup, storage, and replenishment of supplies where applicable.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S112ABDF","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"<ul><li>Identifying safety and environmental regulations</li></ul>"}]}]},{"leaf":false,"text":"Respond","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S112ABE1","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"7.\tDescribe personal, sensory, emotional, and intellectual responses to the visual qualities of a work of art."},{"leaf":false,"text":"8.\tEvaluate selected works of art to determine the effectiveness of their organization.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S112ABE3","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"<ul><li>Describing the subject matter, elements of art, principles of design, media, technique, and style used in selected works of art</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112ABE4","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"<ul><li>Analyzing the formal organization of subject matter, elements of art, and principles of design in selected works of art to determine structural relationships</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112ABE5","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"<ul><li>Interpreting expressive intentions and purposes in selected works of art</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112ABE6","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"<ul><li>Describing the effectiveness of expressive and meaningful communication in selected works of art</li></ul>"}]},{"leaf":false,"text":"9.\tCompare works of art with functional and natural objects, aesthetic components, and formal qualities. <ul>Examples:\tstylized lines in automobiles; shapes and forms of appliances; shape, line, form, volume, and color of a tree</ul>","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S112ABE8","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"<ul><li>Identifying aesthetic components and formal qualities in man-made and natural objects</li></ul> <ul>Examples:\tcomparing a Henry Moore sculpture with bones, comparing David Hockney's Grand Canyon series to rock formations </ul>"}]}]},{"leaf":false,"text":"Understand","children":[{"leaf":false,"text":"10.\tUtilize specialized terminology from art history, aesthetics, criticism, and production in discussions of works of art.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S112ABEB","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"<ul><li>Defining visual arts terminology to include the elements of art and principles of design</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112ABEC","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"<ul><li>Describing the intrinsic qualities of a work of art</li></ul> <ul>Example:\tdivisionist color in Camille Pissaro's Impressionist paintings </ul>"}]},{"leaf":false,"text":"11.\tDescribe historical themes, symbols, and styles associated with works of art from various cultures, times, and places, including major periods and movements.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S112ABEE","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"<ul><li>Identifying the style associated with selected works of major artists</li></ul> <ul>Examples:\tRichard Estes—photorealism, Helen Frankenthaler—color field, Vincent van Gogh—post-Impressionism </ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112ABEF","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"<ul><li>Describing the extrinsic context qualities of a work of art</li></ul> <ul>Example:\toptical color mixing theory as depicted in works by Berthe Morisot such as Jeune Fille au chien (Young Girl with a Dog) </ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112ABF0","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"<ul><li>Using digital processes or media to identify symbols and styles associated with works of art from various periods</li></ul> <ul>Example:\tusing the Internet to view, collect, or find examples of Renaissance art and architecture </ul>"}]}]}]},{"leaf":false,"text":"Level II Visual Arts","children":[{"leaf":false,"text":"Produce","children":[{"leaf":false,"text":"1.\tCreate works of art with a variety of visual relationships.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S112ABF3","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"<ul><li>Organizing formal relationships in works of art</li></ul> <ul>Examples:\tcolor contrasts, differences in shape and size, repetition of textures and patterns</ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112ABF4","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"<ul><li>Organizing subject relationships in works of art</li></ul> <ul>Examples:\tmother and child, man-made objects in a landscape </ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112ABF5","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"<ul><li>Describing how visual relationships create meaning in works of art</li></ul>"}]},{"leaf":false,"text":"2.\tProduce works of art using a variety of techniques.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S112ABF7","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"<ul><li>Determining the appropriateness of techniques used to create a work of art</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112ABF8","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"<ul><li>Demonstrating technical proficiency in the production and presentation of a work of art</li></ul> <ul>Examples:\tskillful use of printmaking tools, properly matting two-dimensional works of art</ul>"}]},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112ABF9","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3.\tDemonstrate safe handling of tools according to studio and environmental practices, procedures, and regulations. <ul>Examples:\tproperly using and disposing of hazardous chemicals or fluids, using flame-retardant cabinets, utilizing ventilation systems </ul>"}]},{"leaf":false,"text":"Respond","children":[{"leaf":false,"text":"4.\tEvaluate student works of art orally or in writing according to specified criteria.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S112ABFC","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"<ul><li>Identifying criteria for judging works of art</li></ul> <ul>Examples:\tcraftsmanship, originality, technique, content </ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112ABFD","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"<ul><li>Comparing a finished personal work of art with its intended content or design</li></ul>"}]},{"leaf":false,"text":"5.\tDescribe various artistic contributions to environmental and social issues. <ul>Examples:\tFrederic Olmstead's design of Central Park, Frank Lloyd Wright's Falling Water, Jacob Lawrence's Migration series</ul>","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S112ABFF","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"<ul><li>Explaining the role of works of art placed in the environment</li></ul> <ul>Examples:\tMaya Lin's Vietnam Veterans Memorial in Washington, D.C.; Lin's Civil Rights Memorial in Montgomery, Alabama; AIDS (acquired immunodeficiency syndrome) Quilt Memorial; Robert Smithson's Spiral Jetty</ul>"}]},{"leaf":false,"text":"6.\tProduce a reflective narrative that critically analyzes selected works of art.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S112AC01","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"<ul><li>Identifying the elements of art and principles of design</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112AC02","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"<ul><li>Interpreting the subject matter, purpose, and expressive content of a work of art</li></ul>"}]}]},{"leaf":false,"text":"Understand","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S112AC08","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"7.\tUse appropriate visual arts terminology in response to works of art, including the elements of art and principles of design."},{"leaf":false,"text":"8.\tDescribe stylistic characteristics of selected works of art and architecture. <ul>Examples:\tRaphael's (Raffaello Sanzio) Madonnas in the High Renaissance, Cathedral of Notre Dame in Gothic architecture, Charles Demuth's painting I Saw the Figure Five in Gold </ul>","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S112AC0A","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"<ul><li>Analyzing major works of art and architecture from various cultures, times, and places to understand forms, subjects, themes, and symbols</li></ul> <ul>Examples:\tParthenon in Athens, Greece; Kremlin in Moscow, Russia</ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112AC0B","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"<ul><li>Using a variety of resource media in researching stylistic characteristics of selected art, artists, cultures, times, and places</li></ul> <ul>Example:\tcreating a multimedia presentation, storyboard, poster, or research paper to identify characteristics of Jacob Lawrence's Harlem series paintings</ul>"}]},{"leaf":false,"text":"9.\tIdentify various uses of the visual arts in business and industry. <ul>Examples:\tdeveloping logos and advertisements, designing buildings and other structures</ul>","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S112AC0D","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"<ul><li>Identifying arts careers in business and industry</li></ul> <ul>Examples:\tdance—choreographer, dance educator; music—conductor, composer; theatre—set designer, artistic director; visual arts—textile designer, museum curator</ul>"}]},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112AC0E","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"10.\tCompare ways of producing, responding, and understanding in the visual arts with other arts disciplines, the humanities, and other academic subject areas. <ul>Examples:\tprocess of writing compared to process of forming works of art; rhythms in visual arts, dance, and music compared to rhythms in poetry; color theory in art compared to color theory in science</ul>"}]}]},{"leaf":false,"text":"Level III Visual Arts","children":[{"leaf":false,"text":"Produce","children":[{"leaf":false,"text":"1.\tCreate works of art that communicate specific concepts, emotions, and intentions.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S112AC11","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"<ul><li>Selecting appropriate subject matter as a basis for meaningful and expressive compositions</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112AC12","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"<ul><li>Organizing subject matter and formal qualities in a work of art into meaningful and expressive compositions</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112AC13","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"<ul><li>Employing a diverse range of traditional media, digital media, and multimedia; techniques; styles; tools; concepts; and processes in producing meaningful and expressive compositions</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112AC14","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"<ul><li>Producing a thematically related body of work</li></ul>"}]},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112AC15","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2.\tEmploy a diverse range of traditional media, digital media, multimedia, techniques, styles, tools, concepts, and processes in producing meaningful and expressive compositions."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112AC16","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3.\tProduce a self-critique of a work in progress."},{"leaf":false,"text":"4.\tDemonstrate independent research related to studio work. <ul>Example:\tresearching masks of various cultures to determine emotional and stylistic characteristics that might influence or inspire the making of a mask</ul>","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S112AC18","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"<ul><li>Maintaining a self-directed sketchbook or journal</li></ul>"}]}]},{"leaf":false,"text":"Respond","children":[{"leaf":false,"text":"5.\tApply the four-step process of critical analysis to works of art, including describing what is seen, analyzing how each artist arranged the elements of art and principles of design, interpreting expressive intent and purpose, and judging the effectiveness of communication.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S112AC1B","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"<ul><li>Analyzing selected works of art for visual and functional differences</li></ul> <ul>Example:\tcomparing decorative ceramic vessels and utilitarian pottery</ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112AC1C","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"<ul><li>Describing visual and functional qualities of composition</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112AC1D","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"<ul><li>Producing a reflective narrative that critically analyzes the organizational effectiveness and artistic choices of personal and peer works of art</li></ul>"}]},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112AC1E","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"6.\tRespond orally and in writing to ideas of selected critics, historians, aestheticians, and artists. <ul>Example:\tdiscussing criteria for valuing works of art from Kenneth Clark's What is a Masterpiece?</ul>"}]},{"leaf":false,"text":"Understand","children":[{"leaf":false,"text":"7.\tExplain purpose, function, and meaning of selected works of art from a variety of cultures, times, and places.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S112AC21","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"<ul><li>Describing characteristics of works of art that are common to a cultural group or historical period</li></ul> <ul>Examples:\tcultural—use of animals in Eskimo masks, absence of representations of \tanimals or human form in Islamic art;<br /> historical—inclusion of concepts of war and politics in  \tFrancisco de Goya's paintings </ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112AC22","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"<ul><li>Comparing works of art with different styles</li></ul> <ul>Examples:\tCeltic knot designs with rose windows, African masks with Kabuki masks </ul>"}]},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112AC23","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"8.\tCompare modes of artistic expression used in art and other academic disciplines. <ul>Examples:\tcomparing improvisation in music, visual arts, dance, and theatre; comparing narrative art to literature, a painting of historic events to social sciences, op art to the science of optics, or tessellations to geometric shapes and designs</ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112AC24","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"9.\tOrganize research about art, artists, cultures, times, and places into a product or presentation. <ul>Examples:\tproducing a digital presentation comparing the use of logos in advertising, writing a research paper comparing art and its social context</ul>"}]}]},{"leaf":false,"text":"Level IV Visual Arts","children":[{"leaf":false,"text":"Produce","children":[{"leaf":false,"text":"1.\tProduce a thematically related body of work.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S112AC27","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"<ul><li>Describing the results of researching the works of other artists or cultures for inspiration</li></ul>"}]},{"leaf":false,"text":"2.\tOrganize subject matter and formal qualities into meaningful and expressive compositions.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S112AC29","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"<ul><li>Generating alternative design solutions to visual arts problems</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112AC2A","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"<ul><li>Solving visual arts problems using analysis, synthesis, and evaluation</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112AC2B","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"<ul><li>Defending personal choices in creative visual compositions</li></ul> <ul>Examples:\toral critiques, written reflections</ul>"}]},{"leaf":false,"text":"3.\tAssemble a portfolio of personal works of art that includes a concentration in a specific theme or medium.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S112AC2D","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"<ul><li>Demonstrating advanced skill with at least three visual arts media</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112AC2E","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"<ul><li>Writing an artist's statement for a personal portfolio</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112AC2F","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"<ul><li>Documenting personal works of art</li></ul> <ul>Example:\tusing slides or electronic images to depict works of art</ul>"}]},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112AC30","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4.\tOrganize an exhibition of works of art, including publicizing an exhibition, composing an exhibition statement, and completing a self-evaluation of an exhibition. <ul>Examples:\texhibiting works of art on bulletin boards with content documentation, displaying works of art for competition, showcasing works of art with interdisciplinary connections in media centers  </ul>"}]},{"leaf":false,"text":"Respond","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S112AC32","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"5.\tRelate ideas of selected critics, historians, aestheticians, and artists to specific works of art. <ul>Examples:\tHarold Rosenburg on Willem de Kooning's action paintings; critical writings on contemporary art and artists in local, regional, and national periodicals; Public Broadcasting System's American Masters series on nineteenth-century American authors</ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112AC33","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"6.\tInterpret expressive intentions and purposes in selected works of art based on intrinsic and extrinsic conditions. <ul>Example:\tlooking at Vincent Van Gogh's The Night Café and reading his letter to Theo about his intentions in creating the painting</ul>"}]},{"leaf":false,"text":"Understand","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S112AC35","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"7.\tAnalyze specific works of art to determine the relationship between intrinsic qualities and historical and cultural context. <ul>Examples:\tFrancisco Goya's The Third of May and the Napoleonic Invasion of Spain, Diego Rivera's murals and the history of Mexico, Bayoux Tapestry and the Battle of Hastings, Native American paintings and the Battle of the Little Bighorn</ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112AC36","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"8.\tAnalyze artists' choices in order to interpret meanings, ideas, attitudes, views, and intentions in works of art. <ul>Examples:\tchoice of media, subject matter, signs, symbols, source of inspiration</ul>"},{"leaf":false,"text":"9. Explain the importance of major works of art and architecture.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S112AC38","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"<ul><li>Describing the stylistic impact of selected works of art</li></ul> <ul>Examples:\tClaude Monet's Impression, Sunrise; Egyptian obelisk </ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112AC39","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"<ul><li>Describing the social, cultural, historical, and political context of selected works of art</li></ul> <ul>Examples:\timpact of Jacque-Louis David's Oath of the Horatii on French society and painting styles, adoption of Greek temples as architectural models in later cultures</ul>"}]},{"leaf":"true","id":"http://asn.jesandco.org/resources/S112AC3A","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"},{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"10.\tCompare the creative processes of visual arts with other arts disciplines, the humanities, and other academic areas. <ul>Examples:\tcomparing creative problem-solving models with the scientific method, comparing the drafting process in writing with the composition process in visual arts </ul>"}]}]}]