[{"leaf":false,"text":"Economics Standard One: Students will analyze the potential costs and benefits of personal economic choices in a market economy [Microeconomics].","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1141B1C","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"K-3a: Students will understand that individuals and families with limited resources undertake a wide variety of activities to satisfy their wants."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1141B1D","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"K-3b: Students will apply the concept that economic choices require the balancing of costs incurred with benefits received."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1141B1E","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"4-5a: Students will understand that prices in a market economy are determined by the interaction of supply and demand, with governments intervening to deal with market failures."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1141B1F","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"4-5b: Students will understand that consumers and producers make economic choices based on supply, demand, access to markets, and the actions of the government."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1141B20","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"6-8a: Students will analyze how changes in technology, costs, and demand interact in competitive markets to determine or change the price of goods and services."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1141B21","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"9-12a: Students will demonstrate how individual economic choices are made within the context of a market economy in which markets influence the production and distribution of goods and services."}]},{"leaf":false,"text":"Economics Standard Two: Students will examine the interaction of individuals, families, communities, businesses, and governments in a market economy [Macroeconomics].","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1141B22","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"K-3a: Students will understand how barter, money, and other media are employed to facilitate the exchange of resources, goods, and services."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1141B23","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"4-5a: Students will understand the role of banks and other financial institutions in the economy."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1141B24","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"6-8a: Students will analyze the role of money and banking in the economy, and the ways in which government taxes and spending affect the functioning of market economies."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1141B25","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"9-12a: Students will develop an understanding of how economies function as a whole, including the causes and effects of inflation, unemployment, business cycles, and monetary and fiscal policies."}]},{"leaf":false,"text":"Economics Standard Three: Students will understand different types of economic systems and how they change [Economic systems].","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1141B26","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"K-3a: Students will identify human wants and the various resources and strategies which have been used to satisfy them over time."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1141B27","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"4-5a: Students will identify different means of production, distribution, and exchange used within economic systems in different times and places."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1141B28","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"6-8a: Students will demonstrate the ways in which the means of production, distribution, and exchange in different economic systems have a relationship to cultural values, resources, and technologies."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1141B29","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"9-12a: Students will analyze the wide range of opportunities and consequences resulting from the current transitions from command to market economies in many countries."}]},{"leaf":false,"text":"Economics Standard Four: Students will examine the patterns and results of international trade [International trade].","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1141B2A","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"K-3a: Students will understand that the exchange of goods and services around the world creates economic interdependence between people in different places."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1141B2B","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"4-5a: Students will demonstrate how international trade links countries around the world and can improve the economic welfare of nations."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1141B2C","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"6-8a: Students will examine how nations with different economic systems specialize and become interdependent through trade and how government policies allow either free or restricted trade."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1141B2D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"9-12a: Students will analyze and interpret the influence of the distribution of the world's resources, political stability, national efforts to encourage or discourage trade, and the flow of investment on patterns of international trade."}]}]