[{"leaf":false,"text":"Science Standard 1 Nature and Application of Science and Technology","children":[{"leaf":false,"text":"Understandings and Abilities of Scientific Inquiry","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E744","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"1. Understand that: Scientific investigations, whether conducted by students or scientists, involve asking a question about the natural world."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E763","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"Be able to: Generate questions and predictions using observations and exploration about the natural world."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E745","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"2. Understand that: In a science investigation, a fair test is one in which all of the conditions are kept constant except the one condition being investigated."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E764","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"Be able to: Generate and follow simple plans using systematic observations to explore questions and predictions."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E746","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"3. Understand that: The purpose of accurate observations and data collection is to provide evidence. Scientists use tools to enhance their senses in order to obtain more evidence."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E765","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"Be able to: Collect data using observations, simple tools and equipment. Record data in tables, charts, and bar graphs. Compare data with others to examine and question results."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E747","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"4. Understand that: Scientists use observations from investigations and knowledge that is already known to develop an explanation."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E766","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"Be able to: Construct a simple explanation by analyzing observational data. Revise the explanation when given new evidence or information gained from other resources or from further investigation."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E748","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"5. Understand that: The purpose of communicating with others is to share evidence and conclusions. Scientists communicate the results of their investigations to others."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E767","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"Be able to: Share simple plans, data, and explanations with an audience and justify the results using the evidence from the investigation."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E749","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"6. Understand that: The use of mathematics, reading, writing, and technology are important in conducting scientific inquiries."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E768","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"Be able to: Use mathematics, reading, writing, and technology when conducting an investigation and communicating the results."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E74A","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"1. Understand that: Scientific investigations involve asking a focused scientific question. Investigations differ depending upon the question being asked."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E769","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"Be able to: Generate focused questions and informed predictions about the natural world."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E74B","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"2. Understand that: Fair test design supports the validity of the investigation. Sometimes it is not possible to know everything that will have an effect on the investigation or control all conditions."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E76A","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"Be able to: Design and conduct simple to multi-step investigations in order to test predictions. Keep constant all but the condition being tested."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E74C","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"3. Understand that: The purpose of accurate data collection is to provide evidence to compare with the prediction."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E76B","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"Be able to: Accurately collect data using observations, simple tools and equipment. Display and organize data in tables, charts, diagrams, and bar graphs or plots over time. Compare and question results with and from others."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E74D","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"4. Understand that: The body of scientific knowledge grows as scientists ask questions, conduct investigations, develop explanations and compare results with what is already known."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E76C","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"Be able to: Construct a reasonable explanation by analyzing evidence from the data. Revise the explanation after comparing results with other sources or after further investigation."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E74E","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"5. Understand that: The purpose of communicating is to share and justify results. Scientists communicate their results to others, including the details that allow others to replicate the results."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E76D","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"Be able to: Communicate procedures, data, and explanations to a variety of audiences. Justify the results by using evidence to form an argument."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E74F","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"6. Understand that: The use of mathematics, reading, writing, and technology are important in conducting scientific inquiries."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E76E","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"Be able to: Use mathematics, reading, writing, and technology when conducting scientific inquiries."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E750","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"1. Understand that: Scientific investigations involve asking testable questions. Different kinds of questions suggest different scientific investigations. The current body of scientific knowledge guides the investigation."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E76F","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Be able to: Frame and refine questions that can be investigated scientifically, and generate testable hypotheses."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E751","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"2. Understand that: A valid investigation controls variables. Different experimental designs and strategies can be developed to answer the same question."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E770","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Be able to: Design and conduct investigations with controlled variables to test hypotheses."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E752","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"3. Understand that: In a scientific investigation, data collection involves making precise measurements and keeping accurate records so that others can replicate the experiment."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E771","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Be able to: Accurately collect data through the selection and use of tools and techniques appropriate to the investigation. Construct tables, diagrams and graphs, showing relationships between two variables, to display and facilitate analysis of data. Compare and question results with and from other students."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E753","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"4. Understand that: There is much experimental and observational evidence that supports a large body of knowledge. The scientific community supports known information until new experimental evidence arises that does not match existing explanations. This leads to the evolution of the scientific body of knowledge."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E772","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Be able to: Form explanations based on accurate and logical analysis of evidence. Revise the explanation using alternative descriptions, predictions, models and knowledge from other sources as well as results of further investigation."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E754","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"5. Understand that: Evaluating the explanations proposed by others involves examining and comparing evidence, identifying faulty reasoning, pointing out statements that go beyond the evidence, and suggesting alternative explanations for the same observations. Conflicting data or conflicting interpretations of the same data suggest the need for further investigation. Continued investigation can lead to greater understanding and resolution of the conflict."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E773","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Be able to: Communicate scientific procedures, data, and explanations to enable the replication of results. Use computer technology to assist in communicating these results. Critical review is important in the analysis of these results."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E755","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"6. Understand that: Scientific habits of mind and other sources of knowledge and skills are essential to scientific inquiry. Habits of mind include tolerance of ambiguity, skepticism, openness to new ideas, and objectivity. Other knowledge and skills include mathematics, reading, writing, and technology."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E774","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Be able to: Use mathematics, reading, writing, and technology when conducting scientific inquiries."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E756","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. Understand that: Scientists conduct investigations for a variety of reasons including to explore new phenomena, to replicate other's results, to test how well a theory predicts, to develop new products, and to compare theories."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E775","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Be able to: Identify and form questions that generate a specific testable hypothesis that guide the design and breadth of the scientific investigation."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E757","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. Understand that: Science is distinguished from other ways of knowing by the use of empirical observations, experimental evidence, logical arguments and healthy skepticism."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E776","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Be able to: Design and conduct valid scientific investigations to control all but the testable variable in order to test a specific hypothesis."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E758","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. Understand that: Theories in science are well-established explanations of natural phenomena that are supported by many confirmed observations and verified hypotheses. The application of theories allows people to make reasonable predictions. Theories may be amended to become more complete with the introduction of new evidence."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E777","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Be able to: Collect accurate and precise data through the selection and use of tools and technologies appropriate to the investigations. Display and organize data through the use of tables, diagrams, graphs, and other organizers that allow analysis and comparison with known information and allow for replication of results."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E759","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. Understand that: Investigating most real-world problems requires building upon previous scientific findings and cooperation among individuals with knowledge and expertise from a variety of scientific fields. The results of scientific studies are considered valid when subjected to critical review where contradictions are resolved and the explanation is confirmed."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E778","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Be able to: Construct logical scientific explanations and present arguments which defend proposed explanations through the use of closely examined evidence."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E75A","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"5. Understand that: In communicating and defending the results of scientific inquiry, arguments must be logical and demonstrate connections between natural phenomena, investigations, and the historical body of scientific knowledge. (American Association for the Advancement of Science, 2001)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E779","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Be able to: Communicate and defend the results of scientific investigations using logical arguments and connections with the known body of scientific information."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E75B","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"6. Understand that: Knowledge and skill from sources other than science are essential to scientific inquiry. These include mathematics, reading, writing, and technology."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E77A","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Be able to: Use mathematics, reading, writing and technology when conducting scientific inquiries."}]},{"leaf":false,"text":"Science, Technology, and Society","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E75C","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"1. People have invented new technologies to solve problems."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E75D","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"2. Tools are useful in science to help gather data for observations and measurements and provide a safe means of conducting an investigation."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E75E","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"1. Science and technology are related. Technology provides the tools needed for science to investigate questions and may provide solutions to society's problems, wants, or needs. Not all technological solutions are effective, uniformly beneficial, or equally available to everyone."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E75F","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"1. Advances in technology can expand the body of scientific knowledge. Technological tools allow people to observe objects and phenomena that otherwise would not be possible. Technology enhances the quality, accuracy, speed and analysis of data gathered."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E760","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"2. Science and technology in society are driven by the following factors: economical, political, cultural, social, and environmental. Increased scientific knowledge and technology create changes that can be beneficial or detrimental to individuals or society through impact on human health and the environment."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E761","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. The pursuit of science can generate the need for advanced technology. Advanced technology, in turn, can provide the opportunity to pursue new scientific knowledge."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E762","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. The social, economic, and political forces of a society have a significant influence on what science and technology programs are pursued, funded, and implemented."}]},{"leaf":false,"text":"History and Context of Science","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E77B","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"1. People from all parts of the world practice science and make many important scientific contributions."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E77C","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"2. Much has been learned about the natural world but there is still much to understand."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E77D","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"1. Contributions by individuals have been essential in advancing the body of scientific knowledge."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E77E","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"1. Over the course of human history, contributions to science have been made by different people from different cultures. Studying some of these contributions and how they came about provides insight into the expansion of scientific knowledge."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E77F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. New disciplines of science emerge as older disciplines interface into an integrated study of the natural world. As the body of scientific knowledge grows, the boundaries between individual disciplines diminish."}]}]},{"leaf":false,"text":"Science Standard 2 Materials and Their Properties","children":[{"leaf":false,"text":"Properties and Structure of Materials","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7A1","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"1. Materials can be described and classified according to the following physical properties: size, shape, mass, texture, color, and material composition. Students can observe materials' physical properties by using tools that include rulers, balances, thermometers and hand lenses."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7A2","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"2. Materials exist in one of three states – solid, liquid, or gas. Solids and liquids have easily observable properties and may change from one form to the other."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7A3","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"3. Physical properties of materials can be changed by exposure to water, heat, light, or by cutting, mixing, and grinding."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7A4","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"1. Observable physical properties can be used to classify materials. These physical properties may include solubility, mass, magnetism, and electrical conductivity. Tools such as graduated cylinders, balances, rulers, magnifiers, simple circuits, and magnets are used to study the physical properties."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7A5","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"2. Heating and cooling of materials may produce changes in the state of solids, liquids and gases."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7A6","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"1. All matter consists of particles too small to be seen with the naked eye. The arrangement, motion, and interaction of these particles determine the three states of matter (solid, liquid, and gas). Particles in all three states are in constant motion. In the solid state, tightly packed particles have a limited range of motion. In the liquid state, particles are loosely packed and move past each other. In the gaseous state, particles are free to move."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7A7","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"2. A phase change may occur when a material absorbs or releases heat energy. Changes in phase do not change the particles but do change how they are arranged."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7A8","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"3. Some physical properties, such as mass and volume, depend upon the amount of material. Other physical properties, such as density and melting point, are independent of the quantity of material. Density and melting point are unique physical properties for a material. Tools such as microscopes, scales, beakers, graduated cylinders, Celsius thermometers, and metric rulers are used to measure physical properties."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7A9","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"4. An important property of materials is their ability to conduct heat. Some materials, such as certain metals, are excellent conductors of heat while other materials, such as glass, are poor conductors (good thermal insulators)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7AA","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"5. Exposure to energy, such as light and heat, may change the physical properties of materials."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7AB","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. All matter is composed of minute particles called atoms. Most of the mass of an atom is concentrated in the nucleus. In the nucleus, there are neutrons with no electrical charge and positively charged protons. Negatively charged electrons surround the nucleus and overall, the atom is electrically neutral."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7AC","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. Elements and compounds are pure substances. Elements cannot be decomposed into simpler materials by chemical reactions. Elements can react to form compounds. Elements and/or compounds may also be physically combined to form mixtures."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7AD","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. Isotopes of a given element differ in the number of neutrons in the nucleus. Their chemical properties remain essentially the same."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7AE","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. The periodic table arranges the elements in order of atomic number (the number of protons). The elements are grouped according to similar chemical and physical properties. Properties vary in a regular pattern across the rows (periods) and down the columns (families or groups).  As a result, an element's chemical and physical properties can be predicted knowing only its position on the periodic table."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7AF","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"5. An atom's electron structure determines its physical and chemical properties. Metals have valence electrons that can be modeled as a sea of electrons where the valence electrons move freely and are not associated with individual atoms. These freely moving electrons explain the metallic properties such as conductivity, malleability, and ductility."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7B0","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"6. Ionic compounds form when atoms transfer electrons. Covalent compounds form when atoms share electrons. Both types of interactions generally involve valence electrons and produce chemical bonds that determine the chemical property of the compound."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7B1","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"7. A change in physical properties does not change the chemical composition of the substance. The physical properties of elements and compounds (such as melting and boiling points) reflect the nature of the interactions among their atoms, ions, or molecules and the electrical forces that exist between."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7B2","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"8. A change of phase may occur when there is a change in the potential energy of the atoms or molecules of a substance."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7B3","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"9. Temperature, pressure, and volume are important properties of a gas. A change in two of these properties results in predictable changes in the third."}]},{"leaf":false,"text":"Mixtures and Solutions","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E796","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"1. Most materials are physical mixtures. Physical mixtures can be composed of different kinds of materials, each having distinct physical properties. These physical property differences can be used to separate, sort, and group the materials of the mixture."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E797","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"2. Mixtures can consist of different combinations of solids and/or liquids. The characteristics of these resulting mixtures depend on the relative amounts and properties of the components."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E798","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"3. Physical properties can be used to separate mixtures through techniques such as filtration and evaporation."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E799","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"4. When a solid is dissolved in a liquid, a solution is formed that can be separated through the process of evaporation."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E79A","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"1. Mixtures can be homogeneous or heterogeneous. Mixtures may be solids, liquids, and/or gases. Most materials are physical mixtures consisting of different components in varying concentrations. The individual components can be separated using the components' unique physical properties."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E79B","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"2. Solutions are homogenous mixtures of two or more components. The properties of a solution depend on the nature and concentration of the solute(s) and the nature of the solvent(s)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E79C","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"3. The rate of solubility is influenced by temperature and the surface area of the solute."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E79D","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"4. Temperature of the solvent can affect the saturation point of the solution."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E79E","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"5. In mixtures, individual components move from areas of higher concentration to areas of lower concentration to eliminate concentration differences. Diffusion is the movement of individual components."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E79F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. Properties of solutions, such as pH, solubility, and electrical conductivity depend upon the concentration and interactions of the solute and solvents."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7A0","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. A variety of methods can be used to separate mixtures into their component parts based upon the chemical and physical properties of the individual components."}]},{"leaf":false,"text":"Conservation of Matter","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E792","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"1. The mass of an object remains unchanged when broken into parts. The sum of the parts equals the whole."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E793","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"1. The total mass of the mixture is equal to the sum of the masses of the components. Total mass is conserved when different substances are mixed."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E794","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. The total mass of the system remains the same regardless of how atoms and molecules in a closed system interact with one another, or how they combine or break apart."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E795","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. Radioactive isotopes are unstable and undergo spontaneous and predictable nuclear reactions emitting particles and/or radiation, and become new isotopes that can have very different properties. In these nuclear changes, the total of the mass and energy remains the same."}]},{"leaf":false,"text":"Chemical Reactions","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E78C","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. Chemical reactions result in new substances with properties that are different from those of the component parts (reactants)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E78D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. There are different types of chemical reactions. Precipitation reactions produce insoluble substances (e.g., double replacement). The transfer of electrons between atoms is a reduction-oxidation (redox) reaction (e.g., single-replacement combustion, synthesis, decomposition). Some acid/base reactions involve the transfer of hydrogen ions."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E78E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. The rate of a chemical reaction depends on the properties and concentration of the reactants, temperature, and the presence or absence of a catalyst."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E78F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. Energy is transformed in chemical reactions. Energy diagrams can illustrate this transformation. Exothermic reactions release energy. Endothermic reactions absorb energy."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E790","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"5. A catalyst lowers the activation energy of a chemical reaction. The catalyst remains unchanged and is not consumed in the overall reaction. Enzymes are protein molecules that catalyze chemical reactions in living systems."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E791","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"6. Certain small molecules (monomers) react with one another in repetitive fashion (polymerization) to form long chain macromolecules (polymers). The properties of the macromolecules depend on the properties of the molecules used in their formation and on the lengths and structure of the polymer chain. Polymers can be natural or synthetic."}]},{"leaf":false,"text":"Material Technology","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E786","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"1. The properties of materials influence their use. Some materials are more suitable for making a particular product or device."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E787","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"2. Technology has created new materials that can help people solve problems."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E788","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"1. Many materials can be recycled and used again (sometimes in different forms)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E789","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"1. Synthetic materials and/or modified natural materials are produced to make products used in everyday life."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E78A","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"2. The production of new materials has social, environmental, and other implications that require analyses of the risks and benefits."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E78B","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. Materials' properties determine their use. New materials can improve the quality of life. However, their development and production often raise social, economic, and environmental issues that require analyses of the risks and benefits."}]}]},{"leaf":false,"text":"Science Standard 3 Energy and Its Effects","children":[{"leaf":false,"text":"The Forms and Sources of Energy","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7EB","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"1. The Sun is a source of energy that lights and warms the Earth."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7EC","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"2. Objects that move (i.e., moving air, moving water) have energy because of their motion."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7ED","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"3. Heat energy is a form of energy that makes things warmer."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7EE","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"4. Electrical energy is a form of energy that is used to operate many of our tools and appliances."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7EF","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"1. Energy from the sun includes visible light, which consists of a combination of different colored light, and components that are not visible, which include infrared and ultraviolet light waves."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7F0","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"2. The energy of a moving object depends on its speed. Faster moving objects have more energy than slower moving objects."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7F1","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"3. Energy can be stored in an elastic material when it is stretched."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7F2","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"4. Sound is a form of energy that is produced by vibrating objects, and can be described by its pitch and its loudness (volume). Sound travels faster through some substances than others."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7F3","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"5. Heat energy raises the object's temperature or changes the state of the object (i.e., solid to liquid, liquid to gas)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7F4","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"6. The energy obtained from electrical outlets is electrical energy that was produced at an electrical power plant.  Electrical energy can be generated and then transmitted over great distances. Batteries are portable sources of electrical energy."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7F5","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"1. Energy from the Sun takes the form of electromagnetic waves such as infrared, visible, and ultraviolet electromagnetic waves. The radiation from the sun consists of a range of energies in the electromagnetic spectrum."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7F6","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"2. Mechanical energy comes from the motion (kinetic energy) and position (potential energy) of objects. Gravitational potential energy and elastic potential energy are important forms of potential energy that contribute to the mechanical energy of objects."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7F7","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"3. Sound energy is the energy that takes the form of mechanical waves passing through objects or substances. The energy delivered by a wave in a given unit of time is determined by the amplitude and frequency of the wave."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7F8","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"4. Heat energy comes from the random motion of the particles in an object or substance. Temperature is a measure of the motion of the particles.  The higher the temperature of the material, the greater the motion of the particles."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7F9","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"5. Electrical energy is a form of energy that can be transferred by moving charges through a complete circuit."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7FA","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. Electromagnetic waves carry a single form of energy called electromagnetic (radiant) energy."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7FB","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. An object has kinetic energy because of its linear motion, rotational motion, or both. The kinetic energy of an object can be determined knowing its mass and speed. The object's geometry also needs to be known to determine its rotational kinetic energy. An object can have potential energy when under the influence of gravity, elastic forces or electric forces and its potential energy can be determined from its position."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7FC","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. Mechanical waves result from the organized vibrations of molecules in substances. Kinetic energy can be transferred very quickly over large distances by mechanical waves."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7FD","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. Thermal (heat) energy is associated with the random kinetic energy of the molecules of a substance."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7FE","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"5. Magnetic energy and electrical energy are different aspects of a single electromagnetic energy, which results from the motion of electrical charges."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7FF","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"6. Chemical energy is derived from the making and breaking of chemical bonds."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E800","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"7. Nuclear energy is a form of potential energy that is released when a portion of the mass of the nucleus is converted to energy through nuclear fusion, nuclear fission, or radioactive decay."}]},{"leaf":false,"text":"Forces and the Transfer of Energy","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7CD","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"1. The position of an object gives its location relative to where you are (e.g., above, below, in front, or behind). The motion of an object describes how its position is changing. Pushing or pulling on an object can change its position or motion."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7CE","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"2. When balanced forces act on an object it will remain at rest, but if unbalanced forces act on the object it will begin to move."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7CF","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"3. Energy of a moving object can be transferred to other objects (i.e., the energy of moving water can be used to turn a waterwheel)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7D0","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"4. Transferring heat energy to an object will make it feel warmer by raising its temperature and it may cause a change in the object's physical properties."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7D1","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"1. Force is any push or pull exerted by one object on another. Some forces (e.g., magnetic forces and gravity) can make things move without touching them."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7D2","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"2. The speeds of two or more objects can be compared (i.e., faster, slower) by measuring the distance traveled in a given unit of time, or by measuring the time needed to travel a fixed distance."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7D3","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"3. A force must be applied to change the speed of a moving object or change its direction of motion. Larger forces will create greater changes in an object's speed in a given unit of time."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7D4","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"4. Pushing and pulling forces can be used to transfer energy from one object to another."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7D5","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"5. The transfer of heat energy may produce changes in the state of a substance."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7D6","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"6. The energy of electricity is transferred to electrical devices through simple closed circuits (simple series or simple parallel circuits)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7D7","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"7. Some materials allow electricity to flow freely (conductors), while other materials inhibit the flow of electricity (insulators)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7D8","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"8. Some materials are magnetic and can be pushed or pulled by other magnets."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7D9","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"1. When the forces acting on an object are balanced, its motion will not change. Unbalanced forces will cause the object's motion to change. Changes in motion depend upon the size and direction of the total unbalanced force exerted on the object."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7DA","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"2. Gravity is a force that acts between masses over very large distances. Near the Earth's surface, gravity pulls objects and substances vertically downward."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7DB","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"3. Forces can be used to transfer energy from one object to another. Simple machines are used to transfer energy in order to simplify difficult tasks."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7DC","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"4. When energy from the sun is transferred to objects and substances, it can be transformed into a variety of energy forms."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7DD","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"5. Light energy radiates from a source and travels in straight lines. Light is reflected, refracted, transmitted, and absorbed differently by different materials. To see an object, light energy emitted or reflected from the object must enter the eye."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7DE","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"6. The addition or removal of heat energy from a material changes its temperature or its physical state."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7DF","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"7. Heat energy is transported by conduction, convection, and radiation. Heat energy transfers from warmer substances to cooler substances until they reach the same temperature."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7E0","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"8. Electrical systems can be designed to perform a variety of tasks. Series or parallel circuits can be used to transfer electrical energy to devices. Electrical circuits require a complete loop through which the electrical charges can pass."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7E1","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"9. Moving electric charges produce magnetic fields."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7E2","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. Forces change the motion of objects. Newton's Laws can be used to predict these changes."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7E3","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. Forces are mechanisms that can transfer energy from one object to another. A force acting on an object and moving it through a distance does work on that object and changes its kinetic energy, potential energy, or both. Power indicates the rate at which forces transfer energy to an object or away from it."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7E4","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. The momentum of an object can be determined from the object's velocity and it's mass. An impulse represents how much the momentum of an object changes when a force acts on it. The impulse can be used to estimate the size of the force acting on the object."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7E5","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. The Law of Conservation of Momentum can be used to predict the outcomes of collisions between objects and can aid in understanding the energy transfers and energy transformations in these collisions."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7E6","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"5. Gravity is a universal force of attraction that each mass exerts on any other mass. The strength of the force depends on the masses of the objects and the distance between them. The force of gravity is generally not important unless at least one of the two masses involved is huge (a star, the Earth or another planet or a moon)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7E7","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"6. Electric forces between charged objects are attractive or repulsive. The electric forces between electrons and protons are attractive, determine the structure of atoms, and are involved in all chemical reactions. The electromagnetic forces acting between atoms or molecules are much stronger than the gravitational forces between the same atoms or molecules and are responsible for many common forces such as friction, tensions and supporting forces."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7E8","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"7. Electromagnetic forces are responsible for the physical properties of materials (e.g., the boiling point of a liquid) and the mechanical properties of materials (e.g., surface tension)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7E9","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"8. Electric currents create magnetic fields, and changing magnetic fields induce electric currents. The electric and magnetic forces that result from this interaction are the basis for electric motors, electric generators, and other modern technologies."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7EA","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"9. The nuclear forces that hold the nucleus of an atom together are much stronger than the repulsive electric forces acting between the protons that would make the nucleus fly apart, therefore, most atoms have stable nuclei."}]},{"leaf":false,"text":"Energy Interacting With Materials; the Transformation and Conservation of Energy","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7C0","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"1. When light hits an object, the light energy can become heat energy."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7C1","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"1. When light strikes an object, the light can reflect off of its surface or pass into the object. The light that passes into the object can pass through it or be absorbed by the material that makes up the object. Light usually refracts when passing from one material into another."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7C2","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"2. When light is absorbed by a material, most of its energy is changed (transformed) into heat energy. Heat energy can also be produced by electrical and mechanical machines and by one object rubbing against another object."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7C3","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"3. Electrical energy in circuits can be changed (transformed) into light, heat, sound, and the energy of motion."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7C4","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"1. Energy can be transformed from one form into another. Energy transformations often take place while energy is being transferred to another object or substance. Energy transformations and energy transfers can be used to explain how energy flows through a physical system (e.g., photosynthesis, weathering, electrical circuits)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7C5","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"2. When a substance absorbs heat energy, or when a different form of energy is absorbed by the substance and is transformed into heat energy, the substance usually expands. The particles within the substance do not expand but the space between the particles increases."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7C6","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"3. Materials may absorb some frequencies of light but not others. The selective absorption of different wavelengths of white light determines the color of most objects."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7C7","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. Energy cannot be created nor destroyed. Energy can be transferred from one object to another and can be transformed from one form to another, but the total amount of energy never changes. Recognizing that energy is conserved, the processes of energy transformation and energy transfer can be used to understand the changes that take place in physical systems."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7C8","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. Most of the changes that occur in the universe involve the transformation of energy from one form to another. Almost all of these energy transformations lead to the production of some heat energy, whether or not heat energy is the desired output of the transformation process."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7C9","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. Waves (e.g., sound and seismic waves, waves in water, and electromagnetic waves) carry energy that can have important consequences when transferred to objects or substances."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7CA","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. When waves interact with materials, the energy they transfer often leads to the formation of other forms of energy. These interactions, which depend upon the nature of the material and the wavelength of the waves, can be used to create practical devices (e.g., sonar and ultra sound imaging, solar cells, remote control units, and communication devices)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7CB","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"5. Through reflection and refraction, electromagnetic waves can be redirected to produce concentrated beams or images of their source."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7CC","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"6. When radiant energy is absorbed or emitted by individual atoms or molecules, the changes in energy involve the jump of an electron from one distinct energy level to another.  These energy changes, which are characteristic of the atom or molecule, can be used to identify the material."}]},{"leaf":false,"text":"The Production, Consumption and Application of Energy","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7B9","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"1. Moving air, moving water, and sunlight contain energy that can be put to our use."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7BA","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"1. The production of most of the energy that we use in our daily lives comes from energy stored in natural resources. The quantity of these resources is limited, so it is important to conserve our natural resources by using them wisely."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7BB","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"1. Energy sources can be renewable or finite. Most energy used by industrial societies is derived from fossil fuel sources. Such sources are inherently limited on the Earth and are unevenly distributed geographically. Renewable energy sources vary in their availability and ease of use."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7BC","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"2. Technological advances throughout history have led to the discovery and use of different forms of energy, and to more efficient use of all forms of energy. These technological advances have led to increased demand for energy and have had both beneficial and detrimental effects on society."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7BD","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"3. Responsible use of energy requires consideration of energy availability, efficiency of its use, the environmental impact, and possible alternate sources."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7BE","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. Demand for energy by society leads to continuous exploration in order to expand supplies of fossil fuels. Nuclear energy is an alternative form of energy. Through the use of fission reactors, nuclear energy is already widely used for the generation of electrical energy. Additional technologies are being developed to increase the use of other alternate energy sources."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E7BF","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. The increase in energy demand and the new technologies being developed to meet these needs and improve the efficiencies of energy systems have social and environmental consequences. Societal expectations for a sustainable environment will require new, cleaner technologies for the production and use of energy."}]}]},{"leaf":false,"text":"Science Standard 4 Earth in Space","children":[{"leaf":false,"text":"The Earth/Moon/Sun System","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E81A","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"1. The shape of the Earth is similar to a sphere."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E81B","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"2. From Earth many objects may be seen in the sky including the Sun, the Moon, stars, and man-made objects."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E81C","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"3. The Sun and Moon appear to move slowly across the sky."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E81D","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"4. The pattern of day and night repeats every 24 hours. The Sun can only be seen in the daytime."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E81E","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"5. The Moon can be observed sometimes at night and sometimes during the day."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E81F","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"6. The appearance of the Moon changes in a cycle that takes about a month."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E820","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"1. The apparent path of the Sun, as seen from Earth, is from east to west. Over the course of a day, half of the Earth is always illuminated by the Sun causing day, and the half not illuminated by the Sun experiences nighttime."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E821","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"2. The cycle from day to night is caused by the Earth's rotation. Earth undergoes one complete rotation about every 24 hours."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E822","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"3. The Moon orbits the Earth. The appearance of the Moon changes as it moves through its orbit. These changes are called phases."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E823","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"4. The Sun is much larger than the Moon. Although the Moon is closer to Earth than the Sun, the two appear to be the same size when viewed from Earth. This is because objects appear smaller as the distance from the viewer increases."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E824","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"1. The Sun is a star that gives off radiant energy that drives Earth systems and is essential for life. The amount of radiant energy Earth receives from the Sun throughout the year is nearly constant."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E825","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"2. The tilt of Earth's axis of rotation as it orbits the Sun points in the same direction with respect to the stars. The tilt and the orbital motion of Earth around the Sun cause variation in the amount of solar radiation striking a location on the Earth's surface which results in variation in the length of day/night and seasons."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E826","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"3. Moon phases occur because the relative positions of Earth, Moon, and Sun change, thereby enabling us to see different amounts of the Moon's surface."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E827","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"4. The Moon is a natural satellite of Earth and is different than the Earth in size, atmosphere, gravity, and surface features."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E828","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"5. Tides are caused by the gravitational interactions of the Sun, Moon and Earth.  The Moon has a greater impact on tides because of its proximity to Earth."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E829","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. The source of the Sun's energy is the fusion of hydrogen atoms into helium, a process common in relatively young stars."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E82A","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. The Sun's influence on Earth include gravity, (which maintains Earth's orbit), electromagnetic radiation (which provides energy for living things), and energetic particles such as coronal mass ejections that can cause electromagnetic disturbances."}]},{"leaf":false,"text":"The Solar System","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E813","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"1. Earth is one of the planets in our Solar System that orbits the Sun. The Sun we see during the day is our nearest star. Stars we see at night lie outside our Solar System."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E814","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"1. The Sun is by far the most massive object in the Solar System, therefore gravitationally dominating all other members of the Solar System."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E815","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"2. The Solar System consists of comets, asteroids, planets, and their respective satellites, most of which orbit the Sun on a plane called the ecliptic. The planets in our Solar System revolve in the same direction around the Sun in elliptical orbits that are very close to being in the same plane. Most planets rotate in the same direction with respect to the Sun."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E816","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"3. Planets can be categorized as inner or outer planets according to density, diameter and surface features."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E817","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"4. Planets and their moons have been shaped over time by common processes such as cratering, volcanism, erosion, and tectonics. The presence of life on a planet can contribute to its unique development."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E818","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. The motion and the basic elements (periodic table) that comprise our Solar System are consistent with the theory that the Solar System emerged from a large disk of gas and dust."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E819","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. The Earth's atmosphere, crust, and interior have changed since the formation of the planets. Driven by internal heat (radioactive decay and heat from accretion), the Earth's layers have separated by density into a solid core, molten mantle, and crust of solid rock composed of plates."}]},{"leaf":false,"text":"Stars and Galaxies","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E80D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. The Universe consists of billions of galaxies, each of which is a gravitationally bound collection of stars."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E80E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. As a force, gravity causes tides, pulls matter together to make spherical stars and planets, maintains the orbits of planets, and gathers cosmic gas and dust to form stars and star systems."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E80F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. Stars are separated by vast distances. Light which reaches Earth from distant galaxies is millions of years old and is actually a view of the past."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E810","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. The Sun and our Solar System are part of the Milky Way galaxy consisting of billions of other stars that appear to be made of the same elements found on Earth."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E811","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"5. Most elements are formed as a result of natural astronomical processes, either in the Big Bang itself or in the natural evolution of stars."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E812","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"6. The Big Bang Theory is a core scientific theory that is supported by a large body of evidence and is well accepted by the scientific community. It states that the Universe began in a hot dense state of energy and matter, and the Universe has been expanding ever since."}]},{"leaf":false,"text":"Technology and Applications","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E806","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"1. Binoculars allow people to observe objects in the sky from Earth."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E807","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"1. Humanity's view of the Solar System has expanded enormously as a result of our exploration of outer space. The Hubble telescope gives us a better view of the many planets than the view we have from the Earth. Robot probes, sent to planets, send back close-up pictures of their surfaces."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E808","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"2. Terrestrial telescopes allow people to observe objects in the sky from Earth."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E809","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"1. Technology, including humans landing on the Moon, robot landers and other space probes, satellites, and radio telescopes, allow scientists to investigate conditions on Earth and on other objects in the Solar System."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E80A","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"2. The technology used in space exploration expands our knowledge of the Universe and has many spin-offs related to everyday applications."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E80B","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. Spectroscopes are used to analyze starlight to reveal information about the composition and evolution of stars."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E80C","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. Technology is vital in investigating the Universe."}]}]},{"leaf":false,"text":"Science Standard 5 Earth's Dynamic Systems","children":[{"leaf":false,"text":"Components of Earth","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E835","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"1. Components of Earth's system include minerals, rocks, soil, water and air. These materials can be observed, sorted and/or classified based on their physical properties."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E836","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"2. Water can exist as a solid, liquid or gas and in different forms such as rain, snow and ice."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E837","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"3. Sand, clay and humus have distinct physical properties and are components of soils."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E838","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"4. A soil's composition varies from environment to environment."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E839","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"5. Soil type can be identified by testing for grain size and composition."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E83A","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"6. Rocks are natural combinations of minerals. Minerals can be classified according to their physical properties (i.e., luster, color and hardness)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E83B","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"1. Water exists in three states (solid, liquid and gas) that are dependent upon the surrounding temperature."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E83C","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"2. Rocks and minerals are broken down over time to clay and sand sized particles. These particles combine with plant remains to form soil."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E83D","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"3. The ability of water to pass through soil depends on the relative amounts of clay and sand in the soil."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E83E","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"1. Water exists on the Earth in reservoirs (on or within the Earth's surface and atmosphere). The total amount of water in these reservoirs does not change, however, the ratio of water in solid, liquid, or gaseous form varies over time and location."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E83F","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"2. The movement of water among the geosphere, hydrosphere and atmosphere affects such things as weather systems, ocean currents, and global climate."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E840","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"3. The formation of sediment and soil requires a long period of time as rocks are weathered, eroded and deposited."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E841","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"4. The atmosphere is a mixture having as its principle components a fixed ratio of nitrogen and oxygen and, depending on the location, variable amounts of carbon dioxide, water vapor, and dust particles."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E842","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. Minerals are the building blocks of rocks. Common rock-forming minerals found in Delaware (calcite, quartz, mica, feldspar, and hornblende) can be identified by their chemical and physical properties."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E843","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. Rocks can be classified as igneous, metamorphic and sedimentary based on the method of formation. The natural cycling of rocks includes the formation of new sediment though erosion and weathering and of new rock through heat and compaction of the sediment."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E844","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. Earth's geosphere is composed of layers of rocks which have separated due to density and temperature differences and classified chemically into a crust (which includes continental and oceanic rock), a hot, convecting mantle, and a dense metallic core."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E845","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. Continental and oceanic rock differ in overall composition, density and age. These differences help explain the distribution and configuration of land masses and ocean basins."}]},{"leaf":false,"text":"Interactions Throughout Earth's Systems","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E846","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"1. Weather influences plants, animals and human activity."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E847","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"2. People who work or play outdoors often dress and base their activities on the speed of the wind and the temperature of the air."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E848","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"3. Water from rain, lakes, and underground, is needed by plants, animals and people for their everyday activities."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E849","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"4. Clouds are shaped by winds and are made of small water droplets or ice crystals. Cloud shapes can be used to help forecast weather."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E84A","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"1. Earth is a dynamic system resulting from interactions among the geosphere, hydrosphere, atmosphere and biosphere."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E84B","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"2. Water reshapes Earth's land surface by eroding rock and soil in some areas and depositing them in other areas."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E84C","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"3. The flow of water can be affected by human activities, ground cover and the slope of the land affected."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E84D","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"4. Water in rivers and streams transports materials. As a general rule, when a stream enters a larger body of water, less massive materials in suspension will travel farther than more massive materials before settling."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E84E","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"5. The surface of Earth changes constantly. Some of these changes happen slowly and are difficult to detect on a daily basis. Other changes happen quickly and result from events (i.e., major storms and volcanoes)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E84F","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"6. Weather changes daily and seasonally. Weather in Delaware may change little from day to day, but can vary greatly when storm systems move into the area."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E850","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"7. Some weather events, such as snowstorms, hurricanes, thunderstorms or tornadoes are more likely to occur at different times of the year."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E851","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"8. Local weather at any point in time varies at different locations around the world."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E852","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"1. Water cycles from one reservoir to another through the processes of evaporation, transpiration, condensation and precipitation. Energy transfers and/or transformations are associated with each of these processes."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E853","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"2. Water within a watershed travels over and through the land at various speeds based on the rate of change in elevation and the permeability and porosity of the soil. Water carries with it products of human activity."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E854","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"3. Surface water always flows downhill. Areas of higher elevation separate watersheds. In Delaware, this water eventually reaches the Delaware River, the Delaware Bay, the Atlantic Ocean or the Chesapeake Bay."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E855","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"4. Constructive processes that build up the land and the destructive processes of weathering and erosion shape and reshape the land surface. The height of Earth landforms is a result of the difference between the rate of uplift and the rate of erosion at a particular location."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E856","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"5. Some Earth events such as El Nino, volcanism and global warming can affect the entire Earth system and are likely the result of complex interactions among Earth spheres."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E857","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"6. The atmosphere has properties that can be observed, measured, and used to predict changes in weather and to identify climatic patterns."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E858","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"7. The climate at a location on Earth is the result of several interacting variables such as latitude, altitude and/or proximity to water."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E859","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"8. Energy from the Sun heats the Earth unevenly causing pressure differences and air movements (convection currents) resulting in changing weather patterns."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E85A","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"9. Ocean currents, global winds, and storm systems, redistribute heat energy on Earth's surface and therefore affect weather and long-term climatic patterns of a region."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E85B","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"10. Uneven heating and cooling of the Earth's surface produce air masses that differ in density, humidity and temperature. The interaction of these air masses results in significant weather changes."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E85C","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"11. Past geological events and environments can be reconstructed by interpreting fossilized remains and successive layering of sedimentary rocks."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E85D","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"12. The fit of continental coastlines, the similarity of rock types and fossilized remains provide evidence that today's continents were once a single land mass. The continents moved to their current positions on plates driven by energy from Earth's interior."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E85E","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"13. Heat energy stored in the oceans and transferred by currents influence climate. A disruption of the circulation and temperature of the world's oceans would foster climate change and have environmental and economic consequences."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E85F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. Earth's four spheres interact as part of a dynamic system in which changes over time are the result of external and internal energy sources."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E860","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. Tectonic plates press against one another in some places (convergence), pull apart in other places (divergence), or slide past each other. These plate movements may result in the formation of mountain ranges, and can lead to earthquakes, volcanic eruptions, and tsunamis. The consequences of these events impact the surrounding atmosphere, geosphere, hydrosphere, and the life existing within them."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E861","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. Earthquakes result when rocks rupture and slide by one another releasing stored energy which travels through the geosphere in the form of waves. Local earthquake risks can be assessed and preparations made to minimize the hazards."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E862","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. The type and eruptive style of volcanoes is determined by the viscosity and gas pressure of the magma. The effects of these eruptions can have both local and global consequences."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E863","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"5. The atmosphere can be described as being in a state of dynamic equilibrium which is maintained in part by plate tectonic processes which recycle atmospheric gases trapped in the ground back into the atmosphere."}]},{"leaf":false,"text":"Technology and Applications","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E82F","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"1. Earth materials can be observed and described using simple tools (e.g., hand lens and balances)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E830","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"2. Weather can be observed, measured and described through the use of simple tools such as a thermometer, rain gauge and wind vane."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E831","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"1. Some satellites allow scientists to observe, over time, large-scale changes in the geosphere as well as the development of short term weather events."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E832","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"1. Global weather data from ground measurements, satellites and radar are recorded on maps, analyzed, and used to predict local weather."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E833","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"2. Water from some natural sources is unfit to drink and requires the use of specialized technology to analyze and purify it."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E834","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. Advances in science and technology (such as satellite imaging, Global Positioning Satellite (GPS), and Geographic Information Systems (GIS)) have improved our understanding of global and local changes that result from Earth system interactions, and our capacity to anticipate and mitigate natural hazards such as volcanoes and earthquakes."}]}]},{"leaf":false,"text":"Science Standard 6 Life Processes","children":[{"leaf":false,"text":"Structure/Function Relationship","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E887","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"1. Plants and animals are similar to and different from each other in observable structures and behavior. These characteristics distinguish them from each other and from nonliving things."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E888","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"2. Each plant or animal has different structures that serve different functions in growth, survival and reproduction."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E889","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"3. In animals the skeletal-muscular system provides structure, support and enables movement."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E88A","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"1. Structures that function for similar purposes in living things may have different appearances."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E88B","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"2. The digestive system has major structures that function to break down food for use in the body. The major parts of the digestive system include the mouth, esophagus, stomach, small intestine, and large intestine."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E88C","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"3. Organisms can be grouped based on similarities and differences in their structures and functions. These may include characteristics such as appendages, roots and leaves of plants, or the presence or lack of a backbone."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E88D","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"1. Living organisms share common characteristics that distinguish them from non-living, dead, and dormant things. They grow, consume nutrients, exchange gases, respond to stimuli, reproduce, need water, eliminate waste, and are composed of cell(s)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E88E","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"2. Living systems in all kingdoms demonstrate the complementary nature of structure and function. Important levels of organization for structure and function include cells, tissues, organs, organ systems, and organisms."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E88F","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"3. Most organisms are single celled while others are multi-cellular. Multi-cellular organisms consist of individual cells that cannot survive independently, while single-celled organisms are composed of one cell that can survive independently."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E890","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"4. The cell is the fundamental unit of life. Cells have basic needs for survival. They use energy, consume materials, require water, eliminate waste, and reproduce."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E891","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"5. Most cells contain a set of observable structures called organelles which allow them to carry out life processes. Major organelles include vacuoles, cell membrane, nucleus, and mitochondria. Plant cells have a cell wall and chloroplasts."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E892","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"6. The human body has systems that perform functions necessary for life. Major systems of the human body include the digestive, respiratory, reproductive, and circulatory systems."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E893","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. In order to establish and maintain their complex organization and structure, organisms must obtain, transform, and transport matter and energy, eliminate waste products, and coordinate their internal activities."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E894","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. Cells take highly varied forms in different plants, animals, and microorganisms. Structural variations among cells determine the function each cell performs."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E895","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. Cells have distinct and separate structures (organelles), which perform and monitor processes essential for survival of the cell (e.g., energy use, waste disposal, synthesis of new molecules, and storage of genetic material). The highly specific function of each organelle is directly related to its structure."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E896","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. The cell membrane is dynamic and interacts with internal membranous structures as materials are transported into and out of the cell."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E897","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"5. The transportation of materials across the membrane can be passive (does not require the expenditure of cellular energy), or active (requires the expenditure of cellular energy) depending upon membrane structure and concentration gradients."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E898","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"6. Cells store and use information to guide their functions. DNA molecules in each cell carry coded instructions for synthesizing protein molecules. The protein molecules have important structural and regulatory functions."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E899","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"7. Most multi-cellular animals have a nervous system composed of a brain and specialized cells that conduct signals rapidly through the long cell extensions that make up nerves. The nerve cells communicate with each other by secreting specific molecules (neurotransmitters)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E89A","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"8. In multi-cellular organisms, cells perform specialized functions as parts of sub-systems (e.g., tissues, organs, and organ systems), which work together to maintain optimum conditions for the benefit of the whole organism."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E89B","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"9. The endocrine system consists of glands which secrete chemical messengers (hormones) that are transported via the circulatory system and act on other body structures."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E89C","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"10. The immune system consists of cells, organs, and secretions that protect the organism from toxins, irritants, and pathogens."}]},{"leaf":false,"text":"Matter and Energy Transformations","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E87C","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"1. Plants and animals are living things. All living things have basic needs for survival including air, water, food (nutrients), space, shelter, and light."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E87D","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"2. In addition to basic needs for survival, living things have needs specific to the organism such as temperature range and food requirements."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E87E","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"1. Plants need the Sun's energy to grow and survive."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E87F","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"2. Animals need food to provide materials and energy for life which they derive directly or indirectly from plants."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E880","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"1. All organisms require energy. A general distinction among organisms is that plants use solar energy to make their own food (sugar) and animals acquire energy directly or indirectly from plants."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E881","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"2. Plants use the energy from sunlight, carbon dioxide, and water to produce sugars (photosynthesis). Plants can use the food (sugar) immediately or store it for later use."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E882","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"3. Most living things use sugar (from food) and oxygen to release the energy needed to carry out life processes (cellular respiration). Other materials from food are used for building and repairing cell parts."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E883","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. Cells carry out a variety of chemical transformations (i.e., cellular respiration, photosynthesis, and digestion) which allow conversion of energy from one form to another, the breakdown of molecules into smaller units, and the building of larger molecules from smaller ones. Most of these transformations are made possible by protein catalysts called enzymes."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E884","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. Plant cells contain chloroplasts, which convert light energy into chemical energy through the process of photosynthesis. This chemical energy is used by the plants to convert carbon dioxide and water into glucose molecules, that may be used for energy or to form plant structures. Photosynthesis adds oxygen to the atmosphere and removes carbon dioxide."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E885","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. All organisms, including plants, use the process of cellular respiration to transform stored energy in food molecules into usable energy. The energy produced is stored in the form of ATP and is used by organisms to conduct their life processes. Cellular respiration may require oxygen and adds carbon dioxide to the atmosphere."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E886","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. Photosynthesis and cellular respiration are complementary processes resulting in the flow of energy and the cycling of matter in ecosystems."}]},{"leaf":false,"text":"Regulation and Behavior","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E875","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"1. Senses help humans and other organisms detect internal and external cues."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E876","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"2. The brain receives signals from parts of the body via the senses. In response, the brain sends signals to parts of the body to influence reactions."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E877","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"1. An organism displays behaviors in response to internal cues, such as hunger, and external cues, such as light, temperature, or interaction with living things."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E878","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"2. There are similarities and differences in how organisms respond to internal and external cues. These behaviors may include strategies for acquiring food, building shelters, or evading predators."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E879","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"1. Regulation of an organism's internal environment involves sensing external changes in the environment and responding physiologically to keep conditions within the range required for survival (e.g., increasing heart rate with exertion)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E87A","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. The endocrine, nervous, and immune systems coordinate and help maintain homeostasis in humans and other organisms."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E87B","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. Multi-cellular animals have nervous systems that generate behavioral responses. These responses result from interactions between organisms of the same species, organisms of different species, and from environmental changes."}]},{"leaf":false,"text":"Life Processes and Technology Application","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E869","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"1. Technology expands the range of human senses."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E86A","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"2. Humans use devices and specialized equipment to ensure safety and to improve their quality of life (e.g., goggles, glasses, hearing aids, and wheelchairs)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E86B","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"3. The ability of an organism to meet its needs for survival is dependent upon its environment. Manipulation of the environment can positively or negatively affect the well being of various organisms that live there."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E86C","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"1. The development of safety devices and protective equipment has helped in the prevention of injuries."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E86D","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"2. Short term and long term studies are used to determine the effects of environmental changes (natural and man-made) on the health of the organisms within that environment."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E86E","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"1. Technological advances in medicine and improvements in hygiene have helped in the prevention and treatment of illness."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E86F","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"2. The functioning and health of organisms are influenced by many factors (i.e., heredity, diet, lifestyle, bacteria, viruses, parasites, and the environment). Certain body structures and systems function to protect against disease and injury."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E870","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"3. The environment may contain dangerous levels of substances in the water and soil that are harmful to organisms. Careful monitoring of these is important for healthy life processes."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E871","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. Certain chemicals, pathogens, and high-energy radiation seriously impair normal cell functions and the health of the organism."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E872","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. The scientific investigation of cellular chemistry enables the biotechnology industry to produce medicines, foods, and other products for the benefit of society."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E873","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. Many drugs exert their effects by mimicking or increasing the production or destruction of neurotransmitters."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E874","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. Biotechnology is a growing international field of research and industry. Many scientists, including those in Delaware, conduct cutting-edge research in biotechnology."}]}]},{"leaf":false,"text":"Science Standard 7 Diversity and Continuity of Living Things","children":[{"leaf":false,"text":"Reproduction, Heredity and Development","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8B7","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"1. The offspring of some plants and animals resemble the parents (i.e., a tree seedling resembles a mature tree)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8B8","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"2. The offspring of some plants and animals do not resemble the parents. Similarities between parents and their offspring become more apparent as their life cycle continues (i.e., caterpillars become butterflies)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8B9","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"3. All plants and animals go through a life cycle of birth, growth, development, reproduction, and death. This cycle is predictable and describable, but differs from organism to organism."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8BA","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"1. Physical characteristics are passed on from parent to offspring. Organisms with two parents inherit characteristics of both."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8BB","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"2. An organism's physical appearance can change without the change being passed on to its offspring (e.g., dyed hair, loss of a claw)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8BC","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"3. Most plants go through a life cycle of germination, growth, development, reproduction, and death."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8BD","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"1. Reproduction is a characteristic of all living systems and is essential to the continuation of every species."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8BE","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"2. Some organisms reproduce asexually involving one parent. Asexual reproduction results in offspring that are genetically identical to the parent organism (clones). This process is advantageous in maintaining the genetic make-up of organisms that are successful in a specific environment."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8BF","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"3. Some organisms reproduce sexually involving two parents. Sexual reproduction results in offspring that have greater genetic diversity than those resulting from asexual reproduction. One-half of the offspring's genetic information comes from the \"male\" parent and one-half comes from the \"female\" parent. These genetic differences help to ensure the survival of offspring in varied environments."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8C0","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"4. In sexual reproduction after the egg is fertilized, each of the new cells in the developing organism receives an exact copy of the genetic information contained in the nucleus of a fertilized egg."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8C1","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"5. Organisms have different reproductive strategies to ensure their offspring's survival. Some organisms produce many offspring and provide little parental care. Other organisms produce few offspring and invest much time and energy in care of their offspring."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8C2","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"6. Chromosomes are found in the nucleus of the cell and contain genes that are made of DNA. Inherited traits of individuals are controlled by genes."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8C3","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"7. Chromosomes can be arranged in pairs (one-half of each pair from each parent). These pairs are approximately the same size and shape, and have similar sequences of genes. Humans have 23 pairs (46) of chromosomes. Other organisms may have different numbers of chromosomes."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8C4","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"8. In humans, gender is determined by a pair of sex chromosomes. Females possess two X chromosomes; males an X and a Y chromosome. The sex of an embryo is determined by the sex chromosome found in the sperm cell."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8C5","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"9. Alternative versions of genes (different alleles) account for variations in inherited characteristics (i.e., flower color). Pairs of chromosomes that have the same allele present on both chromosomes are homozygous. Pairs of chromosomes with different alleles are heterozygous."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8C6","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"10. A dominant trait will be expressed if the organism is heterozygous or homozygous for the trait. A recessive trait will only be expressed if the organism is homozygous for the trait."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8C7","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"11. Mendelian genetics can be used to predict genotypes and phenotypes of offspring resulting from sexual reproduction."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8C8","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. Hereditary/genetic information in chromosomes is contained in molecules of DNA. Genes are sections of DNA that direct syntheses of specific proteins associated with traits in organisms. These consist of various combinations of four different nucleotides that encode this information through their sequences."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8C9","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. Known patterns of inheritance can be used to make predictions about genetic variation."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8CA","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. Mutations in DNA of organisms normally occur spontaneously at low rates, but can occur at higher rates (i.e., exposure to pathogens, radiation and some chemicals). Most mutations have no effect on the organism, but some may be beneficial or harmful depending on the environment."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8CB","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. Only random mutations in germ cells (gametes) can create the variation that is inherited by an organism's offspring. Somatic mutations are not inherited, but may lead to cell death, uncontrolled cell growth, or cancer."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8CC","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"5. During the cell cycle, DNA of the parent cell replicates and the cell divides into two cells that are identical to the parent. This process is used for growth and repair of body tissues and for asexual reproduction."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8CD","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"6. Meiosis is the production of sex cells (gametes). The production and release of these gametes is controlled by hormones. In meiosis, the number of chromosomes is reduced by one-half and chromosomes may randomly exchange homologous parts to create new chromosomes with combinations not necessarily found in the parent cell. Independent assortment of chromosomes during meiosis also increases heritable variations within the species."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8CE","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"7. Upon fertilization, the fusion of the gametes restores the original chromosome number, and new gene combinations lead to increased genetic variation, which, in turn, increases the likelihood of survival of the species."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8CF","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"8. The sex chromosomes contain different genes, and therefore, certain traits will show patterns of inheritance based on gender."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8D0","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"9. Embryological development in plants and animals involves a series of orderly changes in which cells divide and differentiate. Development is controlled by genes whose expression is influenced by internal factors (i.e., hormones) and may also be influenced by environmental factors (i.e., nutrition, alcohol, radiation, drugs, and pathogens). Alteration in this balance may interfere with normal growth and development."}]},{"leaf":false,"text":"Diversity and Evolution","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8A8","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"1. Many different kinds of plants and animals live throughout the world. These plants and animals can be grouped according to the characteristics they share."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8A9","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"1. Organisms of the same type vary in appearance. These variations may provide an advantage in reproduction and survival."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8AA","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"1. The Earth's present day species evolved from earlier, distinctly different species. Many thousands of layers of sedimentary rock provide evidence for the long history of the Earth and for the long history of changing life forms whose remains are found in the rocks. More recently deposited rock layers are more likely to contain fossils resembling existing species."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8AB","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"2. Natural selection is the process by which some individuals with certain traits are more likely to survive and produce greater numbers of offspring than other organisms of the same species. Competition for resources and mates and conditions in the environment can affect which individuals survive, reproduce and pass their traits on to future generations."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8AC","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"3. Small genetic differences between parents and offspring accumulate over many generations, and ultimately new species may arise."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8AD","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"4. Extinction of a species occurs when the environment changes and the adaptive characteristics of a species are insufficient to allow its survival. Most of the species that have lived on Earth no longer exist."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8AE","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"5. There is a wide diversity of organisms on Earth. These organisms may be classified in a number of ways. One classification system places organisms into five kingdoms (monera, protista, fungi, plantae, animalia) based on similarities in structure."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8AF","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"6. The great variety of body forms and structures found in difference species enable organisms to survive in diverse environments."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8B0","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. Evolution is a change in allelic frequencies of a population over time. The theory of evolution is supported by extensive biochemical, structural, embryological, and fossil evidence."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8B1","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. The great diversity of organisms is the result of more than 3.5 billion years of evolution that has filled available niches with life forms. The millions of different species of plants, animals, and microorganisms that live on Earth today are related by descent with modification from common ancestors."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8B2","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. The process of natural selection occurs when some heritable variations that arise from random mutation and recombination give individuals within a species some survival advantages over others. These offspring with advantageous adaptations are more likely to survive and reproduce than individuals without these adaptations, thus increasing the proportion of individuals within a population with these advantageous characteristics.  When populations become isolated, these changes may accumulate in each subpopulation, eventually resulting in new species."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8B3","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. Evolution does not proceed at the same rate in all populations; nor does it progress in a linear or set direction. Environmental changes have a strong influence on the evolutionary process. Other factors that influence evolution include: sexual selection, mutation, genetic drift, and genetic modification."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8B4","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"5. Organisms are classified into a hierarchy of groups and subgroups based on similarities in structure, comparisons in DNA and protein and evolutionary relationships."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8B5","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"6. Genetically diverse populations are more likely than genetically homogenous populations to survive changing environments."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8B6","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"7. Biological evolution is the foundation for modern biology and is used to make predictions for medical, environmental, agricultural and other societal purposes."}]},{"leaf":false,"text":"Technology Applications","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8A1","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"1. People use the variety of plants and animals found throughout the world for food, clothing, and shelter (e.g., silk for clothing, wood for building shelters)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8A2","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"1. Through the use of biotechnology, scientists engineer plants and manipulate growing conditions to meet human needs and wants (e.g., fruits without seeds, hydroponics)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8A3","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"1. Selective breeding is used to cultivate plants and domesticated animals with desirable traits."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8A4","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"2. Knowledge gained from research in genetics is being applied to areas of human health. Geneticists and genetic counselors may use pedigrees and Punnett squares to help predict the possibility of genetic disorders in future generations."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8A5","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. The expanding ability to manipulate genetic material, reproductive processes, and embryological development creates choices that raise ethical, legal, social, and public policy questions."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8A6","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. Recombinant DNA technology, which is a form of genetic engineering, involves the insertion of DNA from one cell into a cell of a different organism where the inserted DNA is expressed. Genetic engineering is being applied in biology, agriculture, and medicine in order to meet human wants and needs."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8A7","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. DNA is analyzed to determine evolutionary relationships, study populations, identify individuals, and diagnose genetic disorders."}]}]},{"leaf":false,"text":"Science Standard 8 Ecology","children":[{"leaf":false,"text":"Interactions within the Environment","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8EC","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"1. An interconnectedness exists among the living and nonliving parts of an environment. This interconnectedness can be observed by the changes made by plants and animals in their environment."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8ED","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"2. Plants and animals need enough space and resources to survive. Overcrowding leads to an increased need for resources."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8EE","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"1. People depend on living and nonliving resources to satisfy their need for food, shelter, and fuel."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8EF","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"2. All living organisms interact with the living and nonliving parts of their surroundings to meet their needs for survival. These interactions lead to a constant exchange of matter."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8F0","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"3. Adaptations in organisms enable them to live and reproduce in certain environments. Those organisms that are best suited for a particular environment have adaptations that allow them to compete for available resources and cope with the physical conditions of their immediate surroundings."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8F1","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"4. Changes in an organism's environment may be either beneficial or harmful. Organisms may be affected by other organisms, by various physical factors (e.g., rainfall, temperature), by physical forces (e.g., storms, earthquakes), and by daily, seasonal, and annual cycles."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8F2","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"5. In order to survive, populations within an ecosystem require a balance of resources."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8F3","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"1. All populations living together (biotic factors) and the physical factors with which they interact (abiotic factors) compose an ecosystem."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8F4","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"2. Ecosystems do not have precise boundaries. All ecosystems ultimately exchange materials with one another and all influence one another."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8F5","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"3. The Delaware Estuary is a semi-enclosed tidal body of water with a free connection to the ocean. This richly productive system, including the associated marshes, provides a variety of habitats for diverse species. This system is biologically and economically important."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8F6","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"4. A population consists of all individuals of a species that occur together at a given place and time. A species is a distinct biological grouping of organisms whose members interbreed in nature and produce fertile offspring."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8F7","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"5. The size of populations may change as a result of the interrelationships among organisms. These may include predator/prey ratios, availability of resources, and habitat changes."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8F8","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"6. In all environments organisms with similar needs may compete with one another for resources including food, water, air, space and shelter. This competition results in natural population fluctuations."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8F9","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"7. Overpopulation can lead to depletion of resources and potential extinction of species."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8FA","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"8. Organisms within an ecosystem may interact symbiotically through mutualism, parasitism, and commensalism."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8FB","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. Earth's ecosystems are interconnected by biological, chemical, and physical processes. Changes in one ecosystem may have local and/or global consequences."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8FC","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. Organisms both cooperate and compete in ecosystems. The interrelationships and interdependencies of these organisms may generate complex ecosystems that are stable over long periods of time and tend to have cyclic fluctuations around an equilibrium."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8FD","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. Ecosystems undergo major changes as a result of such factors as climate change, introduction of new species, and habitat destruction. These can be the result of natural processes and/ or human impact."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8FE","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. Changes in the physical, chemical, or biological conditions of an ecosystem can alter the diversity of species in the system. Over time, ecosystems change and populations of organisms adapt, move, or become extinct."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8FF","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"5. The carrying capacity for a specific population in an ecosystem depends on the resources available. Given adequate biotic and abiotic resources and no disease or predators, populations increase at rapid rates. Resources, (limiting factors), predation and climate, limit the growth of populations in specific niches in an ecosystem."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E900","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"6. Populations can increase through exponential growth. Higher populations result in competition for limited resources and increases in environmental pollution."}]},{"leaf":false,"text":"Energy Flow and Material Cycles in the Environment","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8E0","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"1. All animals depend on plants. Some animals eat plants for food. Other animals eat animals that have eaten plants."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8E1","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"1. Plants need energy from the Sun, water and nutrients for growth and survival."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8E2","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"2. Animals eat plants or other animals that have eaten plants. Animals obtain energy and materials for body repair and growth from food."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8E3","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"3. Dead plants and animals are broken down by decomposers."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8E4","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"1. In most ecosystems, energy enters as sunlight and is transformed by producers into a biologically usable form of matter through photosynthesis. That matter and energy then passes from organism to organism through food webs. Some energy is released from the system as heat."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8E5","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"2. Over time, matter is transferred repeatedly from one organism to another and between organisms and their physical environment. As in all material systems, the total amount of matter remains constant, even though its form and location change."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8E6","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"3. All organisms, including humans, are part of and depend on food webs. Food webs recycle matter continuously as organisms are decomposed after death to return food materials to the environment where it re-enters a food web."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8E7","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. The Law of Conservation of Matter applies to ecosystems. Matter needed to sustain life in ecosystems is continually recycled (e.g., carbon cycle, water cycle, nitrogen cycle, mineral cycles) among organisms and between organisms and the environment."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8E8","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. The Law of Conservation of Energy applies to ecosystems. All energy is conserved as it passes from the Sun through an ecosystem. During energy transformations, some energy is converted to unusable heat. A continual input of energy from the Sun keeps the process going."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8E9","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. At each level of a food pyramid some energy is stored, but much is dissipated as heat. Consequently the number of trophic levels is finite, and the number of individuals in a population that feed at higher levels is limited."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8EA","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. Biomagnification is an increase in the concentration of a chemical in a biological organism over time, compared to the chemical's concentration in the environment. Compounds accumulate in living things any time they are taken up and stored faster than they are broken down (metabolized) or excreted. Biomagnification increases as trophic levels increase."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8EB","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"5. Understanding the process of biomagnification is very important in protecting human beings and other organisms from the adverse effects of chemical exposure, and has become a critical consideration in the regulation of chemical use."}]},{"leaf":false,"text":"Human Impact","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8D5","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"1. Many natural resources are limited. The amount available can be made to last longer by decreasing the use of some resources or by reusing or recycling certain materials."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8D6","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"1. Human activities may cause pollution of air, water and soil."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8D7","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"2. Different technologies are used to access resources to meet human wants and needs. In many cases the environment is affected and resources become limited. Some activities may include burning of fossil fuels, logging, building of highways, shopping centers, and dams, introduction of one species to control another species, spraying of insects, as well as some aspects of farming."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8D8","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"1. Humans can alter the biotic and abiotic factors within an ecosystem thereby creating changes to the overall system."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8D9","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"2. The introduction of competing species, removal of natural habitat, alteration of native landscapes due to urban, industrial and agricultural activities, over-harvesting of species, alteration of waterways and removal of natural predators, etc., are actions that have a lasting impact on ecosystems."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8DA","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"3. Individuals and policymakers make decisions regarding the use of resources based on estimated personal and societal benefits and risks. Impacts on environmental systems result from these decisions."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8DB","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. Exponential growth of the global human population and the resulting increase in consumption places severe stress on finite resources."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8DC","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. Human decisions concerning the use of resources can affect the stability and biodiversity of the ecosystems and the natural recycling processes which maintain the quality of air, water, and land."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8DD","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. Human activities have a major effect on other species. For example, increased land use reduces habitat available to other species, pollution changes the chemical composition of air, soil, and water, and introduction of non-native species disrupts the ecological balance."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8DE","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. Advances in technology can help mitigate human impact on the environment and increase the carrying capacity of the ecosystem."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103E8DF","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"5. People manage the Earth and its resources by preservation, conservation, appropriate utilization, and restoration. The complexity and interaction of these ecosystems requires individual and collaborative efforts on a local, regional, national, and international scale."}]}]}]