[{"leaf":false,"text":"Geography Standard One: Students will develop a personal geographic framework, or \"mental map,\" and understand the uses of maps and other geo-graphics [MAPS].","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1141B06","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"K-3a: Students will understand the nature and uses of maps, globes, and other geo-graphics."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1141B07","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"4-5a: Students will demonstrate development of mental maps of Delaware and of the United States which include the relative location and characteristics of major physical features, political divisions, and human settlements."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1141B08","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"6-8a: Students will demonstrate mental maps of the world and its sub-regions which include the relative location and characteristics of major physical features, political divisions, and human settlements."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1141B09","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"9-12a: Students will identify geographic patterns which emerge when collected data is mapped, and analyze mapped patterns through the application of such common geographic principles as<ul> <li>Hierarchy (patterns at a detailed scale may be related to patterns at a more general scale)</li> <li>Accessibility (how easily one place can be reached from another)</li> <li>Diffusion (how people or things move in certain directions at certain speeds)</li> <li>Complimentarity (the mutual exchange of people or goods among places usually occurs over the shortest possible distances)</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1141B0A","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"9-12b: Students will apply the analysis of mapped patterns to the solution of problems."}]},{"leaf":false,"text":"Geography Standard Two: Students will develop a knowledge of the ways humans modify and respond to the natural environment [ENVIRONMENT].","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1141B0B","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"K-3a: Students will distinguish different types of climate and landforms and explain why they occur."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1141B0C","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"4-5a: Students will apply a knowledge of topography, climate, soils, and vegetation of Delaware and the United States to understand how human society alters, and is affected by, the physical environment."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1141B0D","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"6-8a: Students will apply a knowledge of the major processes shaping natural environments to understand how different peoples have changed and been affected by, physical environments in the world's sub-regions."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1141B0E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"9-12a: Students will understand the Earth's physical environment as a set of interconnected systems (ecosystems) and the ways humans have perceived, reacted to, and changed environments at local to global scales."}]},{"leaf":false,"text":"Geography Standard Three: Students will develop an understanding of the diversity of human culture and the unique nature of places [PLACES].","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1141B0F","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"K-3a: Students will identify types of human settlement, connections between settlements, and the types of activities found in each."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1141B10","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"4-5a: Students will understand the reasons for the locations of human activities and settlements and the routes connecting them in Delaware and in the United States."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1141B11","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"6-8a: Students will identify and explain the major cultural patterns of human activity in the world's sub-regions."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1141B12","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"9-12a: Students will understand the processes which result in distinctive cultures, economic activity, and settlement form in particular locations across the world."}]},{"leaf":false,"text":"Geography Standard Four: Students will develop an understanding of the character and use of regions and the connections between and among them [REGIONS].","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1141B13","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"K-3a: Students will use the concepts of place and region to explain simple patterns of connections between and among places across the country and the world."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1141B14","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"4-5a: Students will apply geographic skills to develop a profile of the local community by placing it in the context of physical, cultural, and other types of regions."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1141B15","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"6-8a: Students will understand the processes affecting the location of economic activities in different world regions."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1141B16","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"6-8b: Students will explain how conflict and cooperation among people contributes to the division of the Earth's surface into distinctive cultural regions and political territories."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1141B17","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"9-12a: Students will apply knowledge of the types of regions and methods of drawing boundaries to interpret the Earth's changing complexity."}]}]