[{"leaf":false,"text":"Civics Standard One: Students will examine the structure and purposes of governments with specific emphasis on constitutional democracy [Government].","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1141B32","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"K-3a: Students will understand that leaders are sometimes chosen by election, and that elected officials are expected to represent the interests of the people who elected them."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1141B33","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"K-3b: Students will understand that positions of authority, whether elected, appointed, or familial, carry responsibilities and should be respected."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1141B34","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"4-5a: Students will understand that governments have a variety of structures and exist for many purposes and that in America these are explained in the United States and State constitutions."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1141B35","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"4-5b: Students will understand that the United States government is divided into executive, legislative, and judicial branches, each with specific responsibilities and powers."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1141B36","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"6-8a: Students will understand that governments have the power to make and enforce laws and regulations, levy taxes, conduct foreign policy, and make war."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1141B37","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"6-8b: Students will analyze the different functions of federal, state, and local governments in the United States and examine the reasons for the different organizational structures each level of government employs."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1141B38","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"9-12a: Students will analyze the ways in which the structure and purposes of different governments around the world reflect differing ideologies, cultures, values, and histories."}]},{"leaf":false,"text":"Civics Standard Two: Students will understand the principles and ideals underlying the American political system [Politics].","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1141B39","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"K-3a: Students will understand that respect for others, their opinions, and their property is a foundation of civil society in the United States."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1141B3A","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"4-5a: Students will understand that the principle of \"due process\" means that the government must follow its own rules when taking actions against a citizen."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1141B3B","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"4-5b: Students will understand that a society based on the ideal of individual liberty requires a commitment on the part of its citizens to the principles of civic responsibility and personal civility."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1141B3C","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"6-8a: Students will understand that the concept of majority rule does not mean that the rights of minorities may be disregarded and will examine and apply the protections accorded those minorities in the American political system."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1141B3D","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"6-8b: Students will understand the principles and content of major American state papers such as the Declaration of Independence; United States Constitution (including the Bill of Rights); and the Federalist Papers."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1141B3E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"9-12a: Students will examine and analyze the extra-Constitutional role that political parties play in American politics."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1141B3F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"9-12b: Students will understand that the functioning of the government is a dynamic process which combines the formal balances of power incorporated in the Constitution with traditions, precedents, and interpretations which have evolved over the past 200 years."}]},{"leaf":false,"text":"Civics Standard Three: Students will understand the responsibilities, rights, and privileges of United States citizens [Citizenship].","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1141B40","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"K-3a: Students will understand that American citizens have distinct responsibilities (such as voting), rights (such as free speech and freedom of religion), and privileges (such as driving)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1141B41","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"4-5a: Students will identify the fundamental rights of all American citizens as enumerated in the Bill of Rights."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1141B42","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"4-5b: Students will apply the protections guaranteed in the Bill of Rights to an analysis of everyday situations."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1141B43","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"6-8a: Students will understand that civil rights secure political freedom while property rights secure economic freedom and that both are essential protections for United States citizens."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1141B44","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"6-8b: Students will understand that American citizenship includes responsibilities such as voting, jury duty, obeying the law, service in the armed forces when required, and public service."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1141B45","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"9-12a: Students will understand that citizens are individually responsible for keeping themselves informed about public policy issues on the local, state, and federal levels; participating in the civic process; and upholding the laws of the land."}]},{"leaf":false,"text":"Civics Standard Four: Students will develop and employ the civic skills necessary for effective, participatory citizenship [Participation].","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1141B46","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"text":"K-3a: Students will acquire the skills necessary for participating in a group, including defining an objective, dividing responsibilities, and working cooperatively."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1141B47","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"4-5a: Students will understand that in order to select effective leaders, citizens have to become informed about candidates' qualifications and the issues of the day."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1141B48","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"4-5b: Students will identify and employ the formal and informal methods by which democratic groups function."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1141B49","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"6-8a: Students will follow the actions of elected officials, and understand and employ the mechanisms for communicating with them while in office."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1141B4A","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"9-12a: Students will develop and employ the skills necessary to work with government programs and agencies."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1141B4B","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"9-12b: Students will understand the process of working within a political party, a commission engaged in examining public policy, or a citizen's group."}]}]