[{"leaf":false,"text":"Children as Citizens: An Introduction to Social Studies","children":[{"leaf":false,"text":"Standard K-1: The student will demonstrate an understanding of the way families live and work together now and the way they lived and worked together in the past.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044AB8","dcterms_educationLevel":[{"prefLabel":"K"}],"asn_statementNotation":"K-1.1","text":"Compare the daily lives of children and their families in the United States in the past with the daily lives of children and their families today. (H, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044D83","dcterms_educationLevel":[{"prefLabel":"K"}],"asn_statementNotation":"K-1.2","text":"Explain how changes in modes of communication and transportation have changed the way that families live and work, including e-mail and the telephone as opposed to letters and messengers for communication and the automobile as opposed to the horse for transportation. (H, G)"}]},{"leaf":false,"text":"Standard K-2: The student will demonstrate an understanding of rules and authority in a child's life.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044D84","dcterms_educationLevel":[{"prefLabel":"K"}],"asn_statementNotation":"K-2.1","text":"Explain the purposes of rules and laws and the consequences of breaking them, including the sometimes unspoken rules of sportsmanship and fair play. (P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044D85","dcterms_educationLevel":[{"prefLabel":"K"}],"asn_statementNotation":"K-2.2","text":"Summarize the roles of people in authority in a child's life, including those of parents and teachers. (P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044D86","dcterms_educationLevel":[{"prefLabel":"K"}],"asn_statementNotation":"K-2.3","text":"Identify people in the community and school who enforce the rules that keep people safe, including crossing guards, firefighters, and police officers. (P)"}]},{"leaf":false,"text":"Standard K-3: The student will demonstrate an understanding of key American figures and symbols.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044D87","dcterms_educationLevel":[{"prefLabel":"K"}],"asn_statementNotation":"K-3.1","text":"Recognize the significance of things that exemplify the values and principles of American democracy, including the Pledge of Allegiance, songs such as \"The Star- Spangled Banner\" (our national anthem) and \"America the Beautiful,\" and the American flag. (H, P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044D88","dcterms_educationLevel":[{"prefLabel":"K"}],"asn_statementNotation":"K-3.2","text":"Illustrate the significant actions of important American figures, including George Washington, Abraham Lincoln, and Martin Luther King Jr. (H, P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044D89","dcterms_educationLevel":[{"prefLabel":"K"}],"asn_statementNotation":"K-3.3","text":"Identify the reasons for celebrating the national holidays, including Independence Day, Thanksgiving, President's Day, and Martin Luther King Jr. Day. (H, P)"}]},{"leaf":false,"text":"Standard K-4: The student will demonstrate an understanding of good citizenship.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044D8A","dcterms_educationLevel":[{"prefLabel":"K"}],"asn_statementNotation":"K-4.1","text":"Identify qualities of good citizenship, including honesty, courage, determination, individual responsibility, and patriotism. (P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044D8B","dcterms_educationLevel":[{"prefLabel":"K"}],"asn_statementNotation":"K-4.2","text":"Demonstrate good citizenship in classroom behaviors, including taking personal responsibility, cooperating and respecting others, taking turns and sharing, and working with others to solve problems. (P)"}]},{"leaf":false,"text":"Standard K-5: The student will demonstrate an understanding of his or her surroundings.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044D8C","dcterms_educationLevel":[{"prefLabel":"K"}],"asn_statementNotation":"K-5.1","text":"Identify the location of school, home, neighborhood, community, city/town, and state on a map. (G)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044D8D","dcterms_educationLevel":[{"prefLabel":"K"}],"asn_statementNotation":"K-5.2","text":"Provide examples of personal connections to places, including immediate surroundings, home, school, and neighborhood. (G)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044D8E","dcterms_educationLevel":[{"prefLabel":"K"}],"asn_statementNotation":"K-5.3","text":"Construct a simple map. (G)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044D8F","dcterms_educationLevel":[{"prefLabel":"K"}],"asn_statementNotation":"K-5.4","text":"Recognize natural features of the environment, including mountains and bodies of water, through pictures, literature, and models. (G)"}]},{"leaf":false,"text":"Standard K-6: The student will demonstrate an understanding of different businesses in the community and the idea of work.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044D90","dcterms_educationLevel":[{"prefLabel":"K"}],"asn_statementNotation":"K-6.1","text":"Classify several community businesses according to the goods and services they provide. (E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044D91","dcterms_educationLevel":[{"prefLabel":"K"}],"asn_statementNotation":"K-6.2","text":"Summarize methods of obtaining goods and services. (E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044D92","dcterms_educationLevel":[{"prefLabel":"K"}],"asn_statementNotation":"K-6.3","text":"Match descriptions of work to the names of jobs in the school and local community, in the past and present, including jobs related to safety. (E, H)"}]}]},{"leaf":false,"text":"Families Here and across the World","children":[{"leaf":false,"text":"Standard 1-1: The student will demonstrate an understanding of how individuals, families, and communities live and work together here and across the world.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044D93","dcterms_educationLevel":[{"prefLabel":"1"}],"asn_statementNotation":"1-1.1","text":"Summarize the characteristics that contribute to personal identity, including physical growth, the development of individual interests, and family changes over time. (H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044D94","dcterms_educationLevel":[{"prefLabel":"1"}],"asn_statementNotation":"1-1.2","text":"Summarize ways in which people are both alike and different from one another in different regions of the United States and the world, including their culture, language, and jobs. (H, G, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044D95","dcterms_educationLevel":[{"prefLabel":"1"}],"asn_statementNotation":"1-1.3","text":"Illustrate personal and family history on a time line. (H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044D96","dcterms_educationLevel":[{"prefLabel":"1"}],"asn_statementNotation":"1-1.4","text":"Compare the daily life of families across the world—including the roles of men, women, and children; typical food, clothes, and style of homes; and the ways the families earn their living. (H, E, G)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044D97","dcterms_educationLevel":[{"prefLabel":"1"}],"asn_statementNotation":"1-1.5","text":"Illustrate different elements of community life, including the structure of schools; typical jobs; the interdependence of family, school, and the community; and the common methods of transportation and communication. (H, E, G)"}]},{"leaf":false,"text":"Standard 1-2: The student will demonstrate an understanding of home, school, and other settings across the world.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044D98","dcterms_educationLevel":[{"prefLabel":"1"}],"asn_statementNotation":"1-2.1","text":"Identify a familiar area or neighborhood on a simple map, using the basic map symbols and the cardinal directions. (G)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044D99","dcterms_educationLevel":[{"prefLabel":"1"}],"asn_statementNotation":"1-2.2","text":"Compare the ways that people use land and natural resources in different settings across the world, including the conservation of natural resources and the actions that may harm the environment. (G)"}]},{"leaf":false,"text":"Standard 1-3: The student will demonstrate an understanding of how government functions and how government affects families.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044D9A","dcterms_educationLevel":[{"prefLabel":"1"}],"asn_statementNotation":"1-3.1","text":"Identify the basic functions of government, including making and enforcing laws and protecting citizens. (P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044D9B","dcterms_educationLevel":[{"prefLabel":"1"}],"asn_statementNotation":"1-3.2","text":"Summarize of the concept of authority and give examples of people in authority, including school officials, public safety officers, and government officials. (P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044D9C","dcterms_educationLevel":[{"prefLabel":"1"}],"asn_statementNotation":"1-3.3","text":"Identify ways that government affects the daily lives of individuals and families in the United States, including providing public education, building roads and highways, and promoting personal freedom and opportunity for all. (P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044D9D","dcterms_educationLevel":[{"prefLabel":"1"}],"asn_statementNotation":"1-3.4","text":"Summarize possible consequences of an absence of laws and rules, including the potential for disorderliness and violence. (P)"}]},{"leaf":false,"text":"Standard 1-4: The student will demonstrate an understanding of the foundations and principles of American democracy.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044D9E","dcterms_educationLevel":[{"prefLabel":"1"}],"asn_statementNotation":"1-4.1","text":"Recognize the basic values of American democracy, including respect for the rights and opinions of others, fair treatment for everyone, and respect for the rules by which we live. (P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044D9F","dcterms_educationLevel":[{"prefLabel":"1"}],"asn_statementNotation":"1-4.2","text":"Identify the different levels of government—local, state, and national. (P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DA0","dcterms_educationLevel":[{"prefLabel":"1"}],"asn_statementNotation":"1-4.3","text":"Recall the contributions made by historic and political figures to democracy in the United States, including George Washington, Benjamin Franklin, Thomas Jefferson, Abraham Lincoln, Martin Luther King Jr., and Rosa Parks. (P, H)"}]},{"leaf":false,"text":"Standard 1-5: The student will demonstrate an understanding of the role of citizens in the American democracy.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DA1","dcterms_educationLevel":[{"prefLabel":"1"}],"asn_statementNotation":"1-5.1","text":"Recognize ways that all citizens can serve the common good, including serving as public officials and participating in the election process. (P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DA2","dcterms_educationLevel":[{"prefLabel":"1"}],"asn_statementNotation":"1-5.2","text":"Summarize the rule-making process in a direct democracy (everyone votes on the rules) and in a representative democracy (an elected group of people make the rules). (P)"}]},{"leaf":false,"text":"Standard 1-6: The student will demonstrate an understanding of how and why people make economic choices and the importance of these choices for families.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DA3","dcterms_educationLevel":[{"prefLabel":"1"}],"asn_statementNotation":"1-6.1","text":"Explain the concept of scarcity and the way it forces individuals and families to make choices about which goods and services to obtain. (E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DA4","dcterms_educationLevel":[{"prefLabel":"1"}],"asn_statementNotation":"1-6.2","text":"Explain methods for obtaining goods and services, including buying with money and bartering. (E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DA5","dcterms_educationLevel":[{"prefLabel":"1"}],"asn_statementNotation":"1-6.3","text":"Identify ways that families and communities cooperate and compromise in order to meet their needs and wants. (E, P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DA6","dcterms_educationLevel":[{"prefLabel":"1"}],"asn_statementNotation":"1-6.4","text":"Recognize the roles of producers and consumers and the ways in which they are interdependent. (E)"}]}]},{"leaf":false,"text":"Communities Here and across the World","children":[{"leaf":false,"text":"Standard 2-1: The student will demonstrate an understanding of cultural contributions made by people from the various regions of the United States.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DA7","dcterms_educationLevel":[{"prefLabel":"2"}],"asn_statementNotation":"2-1.1","text":"Recognize the basic elements that make up a cultural region in the United States, including language, customs, and economic activities. (G, H, E, P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DA8","dcterms_educationLevel":[{"prefLabel":"2"}],"asn_statementNotation":"2-1.2","text":"Compare the historic traditions, customs, and cultures of various regions in the United States, including how traditions are passed between and among generations. (G, H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DA9","dcterms_educationLevel":[{"prefLabel":"2"}],"asn_statementNotation":"2-1.3","text":"Summarize the cultural contributions of Native American nations, African Americans, and immigrant groups in different regions of the United States. (G, H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DAA","dcterms_educationLevel":[{"prefLabel":"2"}],"asn_statementNotation":"2-1.4","text":"Recall stories and songs about regional folk figures who have contributed to the development of the cultural history of the United States, including Pecos Bill, Brer Rabbit, Paul Bunyan, Davy Crockett, and John Henry. (G, H)"}]},{"leaf":false,"text":"Standard 2-2: The student will demonstrate an understanding of the local community and the way it compares with other communities in the world.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DAB","dcterms_educationLevel":[{"prefLabel":"2"}],"asn_statementNotation":"2-2.1","text":"Locate on a map the places and features of the local community, including the geographic features (e.g., parks, water features) and the urban, suburban, and rural areas. (G)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DAC","dcterms_educationLevel":[{"prefLabel":"2"}],"asn_statementNotation":"2-2.2","text":"Recognize characteristics of the local region, including its geographic features and natural resources. (G, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DAD","dcterms_educationLevel":[{"prefLabel":"2"}],"asn_statementNotation":"2-2.3","text":"Summarize the roles of various workers in the community, including those who hold government jobs there. (E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DAE","dcterms_educationLevel":[{"prefLabel":"2"}],"asn_statementNotation":"2-2.4","text":"Summarize changes that have occurred in the life of the local community over time, including changes in the use of the land and in the way that people earn their living there. (G, E, H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DAF","dcterms_educationLevel":[{"prefLabel":"2"}],"asn_statementNotation":"2-2.5","text":"Compare the history and features of the local community with those of different communities around the world. (G)"}]},{"leaf":false,"text":"Standard 2-3: The student will demonstrate an understanding of origins, structure, and functions of local government.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DB0","dcterms_educationLevel":[{"prefLabel":"2"}],"asn_statementNotation":"2-3.1","text":"Recognize different types of local laws and those people who have the power and authority to enforce them. (P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DB1","dcterms_educationLevel":[{"prefLabel":"2"}],"asn_statementNotation":"2-3.2","text":"Identify the roles of leaders and officials in local government, including law enforcement and public safety officials. (P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DB2","dcterms_educationLevel":[{"prefLabel":"2"}],"asn_statementNotation":"2-3.3","text":"Explain the ways that local and state governments contribute to the federal system, including law enforcement and highway construction. (P)"}]},{"leaf":false,"text":"Standard 2-4: The student will demonstrate an understanding of the division of the world geographically into continents and politically into nation-states.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DB3","dcterms_educationLevel":[{"prefLabel":"2"}],"asn_statementNotation":"2-4.1","text":"Identify on a map the continents and the major nation-states of the world and distinguish between these two entities. (P, G)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DB4","dcterms_educationLevel":[{"prefLabel":"2"}],"asn_statementNotation":"2-4.2","text":"Summarize how nation-states interact with one another in order to conduct trade. (P, H, E, G)"}]},{"leaf":false,"text":"Standard 2-5: The student will demonstrate an understanding of trade and markets and the role of supply and demand in determining the price and allocation of goods within the community.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DB5","dcterms_educationLevel":[{"prefLabel":"2"}],"asn_statementNotation":"2-5.1","text":"Identify examples of markets and price in the local community and explain the roles of buyers and sellers in creating markets and pricing. (E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DB6","dcterms_educationLevel":[{"prefLabel":"2"}],"asn_statementNotation":"2-5.2","text":"Summarize the concept of supply and demand and explain its effect on price. (E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DB7","dcterms_educationLevel":[{"prefLabel":"2"}],"asn_statementNotation":"2-5.3","text":"Recognize that people's choices about what they buy will determine what goods and services are produced. (E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DB8","dcterms_educationLevel":[{"prefLabel":"2"}],"asn_statementNotation":"2-5.4","text":"Identify the relationships between trade and resources both within and among communities, including natural, human, and capital resources. (E)"}]}]},{"leaf":false,"text":"South Carolina Studies","children":[{"leaf":false,"text":"Standard 3-1: The student will demonstrate an understanding of places and regions and the role of human systems in South Carolina.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DB9","dcterms_educationLevel":[{"prefLabel":"3"}],"asn_statementNotation":"3-1.1","text":"Identify on a map the location and characteristics of significant physical features of South Carolina, including landforms; river systems such as the Pee Dee River Basin, the Santee River Basin, the Edisto River Basin, and the Savannah River Basin; major cities; and climate regions. (G)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DBA","dcterms_educationLevel":[{"prefLabel":"3"}],"asn_statementNotation":"3-1.2","text":"Interpret thematic maps of South Carolina places and regions that show how and where people live, work, and use land and transportation. (G, P, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DBB","dcterms_educationLevel":[{"prefLabel":"3"}],"asn_statementNotation":"3-1.3","text":"Categorize the six geographic regions of South Carolina—the Blue Ridge Mountain Region, the Piedmont, the Sand Hills, the Inner Coastal Plain, the Outer Coastal Plain, and the Coastal Zone—according to their different physical and human characteristics. (G)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DBC","dcterms_educationLevel":[{"prefLabel":"3"}],"asn_statementNotation":"3-1.4","text":"Explain the effects of human systems on the physical landscape of South Carolina over time, including the relationship of population distribution and patterns of migration to natural resources, climate, agriculture, and economic development. (G, E, H)"}]},{"leaf":false,"text":"Standard 3-2: The student will demonstrate an understanding of the exploration and settlement of South Carolina and the United States.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DBD","dcterms_educationLevel":[{"prefLabel":"3"}],"asn_statementNotation":"3-2.1","text":"Explain the motives behind the exploration of South Carolina by the English, the Spanish, and the French, including the idea of \"for king and country.\" (G, P, E, H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DBE","dcterms_educationLevel":[{"prefLabel":"3"}],"asn_statementNotation":"3-2.2","text":"Summarize the activities and accomplishments of key explorers of South Carolina, including Hernando de Soto, Jean Ribault, Juan Pardo, Henry Woodward, and William Hilton. (H, G)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DBF","dcterms_educationLevel":[{"prefLabel":"3"}],"asn_statementNotation":"3-2.3","text":"Use a map to identify the sea and land routes of explorers of South Carolina and compare the geographic features of areas they explored, including the climate and the abundance of forests. (G, H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DC0","dcterms_educationLevel":[{"prefLabel":"3"}],"asn_statementNotation":"3-2.4","text":"Compare the culture, governance, and geographic location of different Native American nations in South Carolina, including the three principal nations—Cherokee, Catawba, and Yemassee—that influenced the development of colonial South Carolina. (H, G, P, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DC1","dcterms_educationLevel":[{"prefLabel":"3"}],"asn_statementNotation":"3-2.5","text":"Summarize the impact that the European colonization of South Carolina had on Native Americans, including conflicts between settlers and Native Americans. (H, G)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DC2","dcterms_educationLevel":[{"prefLabel":"3"}],"asn_statementNotation":"3-2.6","text":"Summarize the contributions of settlers in South Carolina under the Lords Proprietors and the Royal colonial government, including the English from Barbados and the other groups who made up the diverse European population of early South Carolina. (H, G)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DC3","dcterms_educationLevel":[{"prefLabel":"3"}],"asn_statementNotation":"3-2.7","text":"Explain the transfer of the institution of slavery into South Carolina from the West Indies, including the slave trade and the role of African Americans in the developing plantation economy; the daily lives of African American slaves and their contributions to South Carolina, such as the Gullah culture and the introduction of new foods; and African American acts of resistance against white authority. (H, E, P, G)"}]},{"leaf":false,"text":"Standard 3-3: The student will demonstrate an understanding of the American Revolution and South Carolina's role in the development of the new American nation.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DC4","dcterms_educationLevel":[{"prefLabel":"3"}],"asn_statementNotation":"3-3.1","text":"Analyze the causes of the American Revolution—including Britain's passage of the Tea Act, the Intolerable Acts, the rebellion of the colonists, and the Declaration of Independence—and South Carolina's role in these events. (H, P, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DC5","dcterms_educationLevel":[{"prefLabel":"3"}],"asn_statementNotation":"3-3.2","text":"Summarize the key conflicts and key leaders of the American Revolution in South Carolina and their effects on the state, including the occupation of Charleston by the British; the partisan warfare of Thomas Sumter, Andrew Pickens, and Francis Marion; and the battles of Cowpens and Kings Mountain. (H, P, G)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DC6","dcterms_educationLevel":[{"prefLabel":"3"}],"asn_statementNotation":"3-3.3","text":"Summarize the effects of the American Revolution in South Carolina, including the establishment of a new nation and a new state government and capital. (H, P, G)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DC7","dcterms_educationLevel":[{"prefLabel":"3"}],"asn_statementNotation":"3-3.4","text":"Outline the current structure of state government, including the branches of government; the names of the representative bodies; and the role that cities, towns, and counties play in this system. (P, G)"}]},{"leaf":false,"text":"Standard 3-4: The student will demonstrate an understanding of the events that led to the Civil War, the course of the War and Reconstruction, and South Carolina's role in these events.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DC8","dcterms_educationLevel":[{"prefLabel":"3"}],"asn_statementNotation":"3-4.1","text":"Compare the conditions of daily life for various classes of people in South Carolina, including the elite, the middle class, the lower class, the independent farmers, and the free and the enslaved African Americans. (H, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DC9","dcterms_educationLevel":[{"prefLabel":"3"}],"asn_statementNotation":"3-4.2","text":"Summarize the institution of slavery prior to the Civil War, including reference to conditions in South Carolina, the invention of the cotton gin, subsequent expansion of slavery, and economic dependence on slavery. (H, E, P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DCA","dcterms_educationLevel":[{"prefLabel":"3"}],"asn_statementNotation":"3-4.3","text":"Explain the reasons for South Carolina's secession from the Union, including the abolitionist movement, states' rights, and the desire to defend South Carolina's way of life. (H, P, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DCB","dcterms_educationLevel":[{"prefLabel":"3"}],"asn_statementNotation":"3-4.4","text":"Outline the course of the Civil War and South Carolina's role in significant events, including the Secession Convention, the firing on Fort Sumter, the Union blockade of Charleston, and Sherman's march through South Carolina. (H, G)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DCC","dcterms_educationLevel":[{"prefLabel":"3"}],"asn_statementNotation":"3-4.5","text":"Summarize the effects of the Civil War on the daily lives of people of different classes in South Carolina, including the lack of food, clothing, and living essentials and the continuing racial tensions. (H, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DCD","dcterms_educationLevel":[{"prefLabel":"3"}],"asn_statementNotation":"3-4.6","text":"Explain how the Civil War affected South Carolina's economy, including destruction of plantations, towns, factories, and transportation systems. (E, H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DCE","dcterms_educationLevel":[{"prefLabel":"3"}],"asn_statementNotation":"3-4.7","text":"Summarize the effects of Reconstruction in South Carolina, including the development of public education, racial advancements and tensions, and economic changes. (H, E, P)"}]},{"leaf":false,"text":"Standard 3-5: The student will demonstrate an understanding of the major developments in South Carolina in the late nineteenth century and the twentieth century.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DCF","dcterms_educationLevel":[{"prefLabel":"3"}],"asn_statementNotation":"3-5.1","text":"Summarize developments in industry and technology in South Carolina in the late nineteenth century and the twentieth century, including the rise of the textile industry, the expansion of the railroad, and the growth of the towns. (H, G, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DD0","dcterms_educationLevel":[{"prefLabel":"3"}],"asn_statementNotation":"3-5.2","text":"Summarize the effects of the state and local laws that are commonly known as Jim Crow laws on African Americans in particular and on South Carolinians as a whole. (H, P, E, G)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DD1","dcterms_educationLevel":[{"prefLabel":"3"}],"asn_statementNotation":"3-5.3","text":"Summarize the changes in South Carolina's economy in the twentieth century, including the rise and fall of the cotton/textile markets and the development of tourism and other industries. (E, H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DD2","dcterms_educationLevel":[{"prefLabel":"3"}],"asn_statementNotation":"3-5.4","text":"Explain the impact and the causes of emigration from South Carolina and internal migration from the rural areas to the cities, including unemployment, poor sanitation and transportation services, and the lack of electricity and other modern conveniences in rural locations. (H, E, G)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DD3","dcterms_educationLevel":[{"prefLabel":"3"}],"asn_statementNotation":"3-5.5","text":"Explain the effects of the Great Depression and the New Deal on daily life in South Carolina, including the widespread poverty and unemployment and the role of the Civilian Conservation Corps. (H, E, P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DD4","dcterms_educationLevel":[{"prefLabel":"3"}],"asn_statementNotation":"3-5.6","text":"Summarize the key events and effects of the civil rights movement in South Carolina, including the desegregation of schools (Briggs v. Elliott) and other public facilities and the acceptance of African Americans' right to vote. (P, H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DD5","dcterms_educationLevel":[{"prefLabel":"3"}],"asn_statementNotation":"3-5.7","text":"Summarize the rights and responsibilities that contemporary South Carolinians have in the schools, the community, the state, and the nation. (P)"}]}]},{"leaf":false,"text":"United States Studies to 1865","children":[{"leaf":false,"text":"Standard 4-1: The student will demonstrate an understanding of the exploration of the New World.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DD6","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"4-1.1","text":"Explain the political, economic, and technological factors that led to the exploration of the New World by Spain, Portugal, and England, including the competition between nation-states, the expansion of international trade, and the technological advances in shipbuilding and navigation. (E, G, H, P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DD7","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"4-1.2","text":"Summarize the motivation and accomplishments of the Vikings and the Portuguese, Spanish, English, and French explorers, including Leif Eriksson, Christopher Columbus, Hernando de Soto, Ferdinand Magellan, Henry Hudson, John Cabot, and Robert LaSalle. (H, E, G)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DD8","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"4-1.3","text":"Use a map to identify the routes of various sea and land expeditions to the New World and match these to the territories claimed by different nations—including the Spanish dominance in South America and the French, Dutch, and English exploration in North America—and summarize the discoveries associated with these expeditions. (G, H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DD9","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"4-1.4","text":"Explain the exchange of plant life, animal life, and disease that resulted from exploration of the New World, including the introduction of wheat, rice, coffee, horses, pigs, cows, and chickens to the Americas; the introduction of corn, potatoes, peanuts, and squash to Europe; and the effects of such diseases as diphtheria, measles, smallpox, and malaria on Native Americans. (G, H, E)"}]},{"leaf":false,"text":"Standard 4-2: The student will demonstrate an understanding of the settlement of North America by Native Americans, Europeans, and African Americans and the interactions among these peoples.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DDA","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"4-2.1","text":"Use the land bridge theory to summarize and illustrate the spread of Native American populations. (G, H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DDB","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"4-2.2","text":"Compare the everyday life, physical environment, and culture of the major Native American cultural groupings, including Eastern Woodlands, Southeastern, Plains, Southwestern, and Pacific Northwestern. (G, H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DDC","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"4-2.3","text":"Identify the English, Spanish, and French colonies in North America and summarize the motivations for the settlement of these colonies, including freedom of worship, and economic opportunity. (H, G, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DDD","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"4-2.4","text":"Compare the European settlements in North America in terms of their economic activities, religious emphasis, government, and lifestyles. (H, G, E, P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DDE","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"4-2.5","text":"Summarize the introduction and establishment of slavery in the American colonies, including the role of the slave trade; the nature of the Middle Passage; and the types of goods—rice, indigo, sugar, tobacco, and rum, for example—that were exchanged among the West Indies, Europe, and the Americas. (E, H, G, P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DDF","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"4-2.6","text":"Explain the impact of indentured servitude and slavery on life in the New World and the contributions of African slaves to the development of the American colonies, including farming techniques, cooking styles, and languages. (H, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DE0","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"4-2.7","text":"Explain how conflicts and cooperation among the Native Americans, Europeans, and Africans influenced colonial events including the French and Indian Wars, slave revolts, Native American wars, and trade. (H, G, P, E)"}]},{"leaf":false,"text":"Standard 4-3: The student will demonstrate an understanding of the conflict between the American colonies and England.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DE1","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"4-3.1","text":"Explain the political and economic factors leading to the American Revolution, including the French and Indian War; British colonial policies such as the Stamp Act, the Tea Act, and the so-called Intolerable Acts; and the American colonists' early resistance through boycotts, congresses, and petitions. (E, P, H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DE2","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"4-3.2","text":"Summarize the roles of principal American, British, and European leaders involved in the conflict, including King George III, George Washington, Benjamin Franklin, Thomas Jefferson, John Adams, Thomas Paine, Patrick Henry, and the Marquis de Lafayette. (H, P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DE3","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"4-3.3","text":"Explain the major ideas and philosophies of government reflected in the Declaration of Independence. (P, H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DE4","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"4-3.4","text":"Summarize the events and key battles of the Revolutionary War, including Lexington and Concord, Bunker (Breed's) Hill, Charleston, Saratoga, Cowpens, and Yorktown. (G, H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DE5","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"4-3.5","text":"Explain how the aid received from France, the Netherlands, and the alliances with Native American nations contributed to the American victory in the Revolutionary War. (H, G)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DE6","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"4-3.6","text":"Compare the daily life and roles of diverse groups of Americans during and after the Revolutionary War, including roles taken by women and African Americans such as Martha Washington, Mary Ludwig Hays McCauley (Molly Pitcher), Abigail Adams, Crispus Attucks, and Peter Salem. (H, P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DE7","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"4-3.7","text":"Explain the effects of the American Revolution on African Americans and Native Americans, including how the war affected attitudes about slavery and contributed to the inclusion of abolition in early state constitutions and how the Land Ordinance of 1785 and the Northwest Ordinance of 1787 that were developed by Congress influenced the future of Native Americans. (H, P, G)"}]},{"leaf":false,"text":"Standard 4-4: The student will demonstrate an understanding of the beginnings of America as a nation and the establishment of the new government.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DE8","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"4-4.1","text":"Compare the ideas in the Articles of Confederation with those in the United States Constitution, including how powers are now shared between state and national government and how individuals and states are represented in the national congress. (P, H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DE9","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"4-4.2","text":"Classify government activities according to the three branches of government established by the United States Constitution and give examples of the checks and balances that the Constitution provides among the branches. (P, H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DEA","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"4-4.3","text":"Explain the role of the Bill of Rights in the ratification of the Constitution, including how the Constitution serves to guarantee the rights of the individual and protect the common good yet also to limit the powers of government. (P, H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DEB","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"4-4.4","text":"Compare the roles and accomplishments of early leaders in the development of the new nation, including George Washington, John Adams, Thomas Jefferson, Alexander Hamilton, John Marshall, and James Madison. (H, P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DEC","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"4-4.5","text":"Provide examples of how American constitutional democracy places important responsibilities on citizens to take an active role in the civil process. (P, H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DED","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"4-4.6","text":"Illustrate how the ideals of equality as described in the Declaration of Independence were slow to take hold as evident in the Three-Fifths Compromise and the Fugitive Slave Acts. (P, H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DEE","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"4-4.7","text":"Compare the social and economic differences of the two political parties that began to form in the 1790s, led by Alexander Hamilton and Thomas Jefferson. (H, P, E)"}]},{"leaf":false,"text":"Standard 4-5: The student will demonstrate an understanding of the westward movement and its impact on the institution of slavery.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DEF","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"4-5.1","text":"Summarize the major expeditions and explorations that played a role in westward expansion—including those of Daniel Boone, Lewis and Clark, and Zebulon Pike—and compare the geographic features of areas explored. (G, H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DF0","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"4-5.2","text":"Explain the motives for the exploration in the West and the push for westward expansion, including the concept of manifest destiny, economic opportunities in trade, and the availability of rich land. (G, E, H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DF1","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"4-5.3","text":"Summarize the events that led to key territorial acquisitions—including the Louisiana Purchase, the Florida Purchase, the Northwest Territory treaty, the annexation of Texas, and the Mexican Cession—as well as the motives for these acquisitions and the location and geographic features of the lands acquired. (G, E, H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DF2","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"4-5.4","text":"Explain how territorial expansion and related land policies affected Native Americans, including their resistance to Americans' taking over the land, breaking treaties, and massacring the Native American people; the Indian Removal Act of 1830; and the Seminole Wars. (H, G, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DF3","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"4-5.5","text":"Use a map to illustrate patterns of migration and trade during the period of westward expansion, including the Santa Fe and the Oregon trails. (G , E, H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DF4","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"4-5.6","text":"Compare the experiences of different groups who migrated and settled in the West, including their reasons for migrating, their experiences on the trails and at their destinations, the cooperation and conflict between and among the different groups, and the nature of their daily lives. (H, G, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DF5","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"4-5.7","text":"Explain how specific legislation and events affected the institution of slavery in the territories, including the Northwest Ordinance of 1787, the Missouri Compromise, the annexation of Texas, the Compromise of 1850, the Kansas-Nebraska Act, and the Dred Scott decision. (H, G)"}]},{"leaf":false,"text":"Standard 4-6: The student will demonstrate an understanding of the Civil War and its impact on America.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DF6","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"4-6.1","text":"Compare the industrial North and the agricultural South prior to the Civil War, including the specific nature of the economy of each region, the geographic characteristics and boundaries of each region, and the basic way of life in each region. (G , E, H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DF7","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"4-6.2","text":"Summarize the roles and accomplishments of the leaders of the abolitionist movement and the Underground Railroad before and during the Civil War, including those of Harriet Tubman, John Brown, Frederick Douglass, Harriet Beecher Stowe, Sojourner Truth, and William Lloyd Garrison. (H, P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DF8","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"4-6.3","text":"Explain how specific events and issues led to the Civil War, including the sectionalism fueled by issues of slavery in the territories, states' rights, the election of 1860, and secession. (H, G, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DF9","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"4-6.4","text":"Summarize significant key battles, strategies, and turning points of the Civil War— including the battles of Fort Sumter and Gettysburg, the Emancipation Proclamation, the significance of the Gettysburg Address, and the surrender at Appomattox—and the role of African Americans in the War. (H, G, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DFA","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"4-6.5","text":"Compare the roles and accomplishments of key figures of the Civil War, including Abraham Lincoln, Ulysses S. Grant, Jefferson Davis, and Robert E. Lee. (H, P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DFB","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"4-6.6","text":"Explain the impact of the Civil War on the nation, including its effects on the physical environment and on the people—soldiers, women, African Americans, and the civilian population of the nation as a whole. (H, P, G, E)"}]}]},{"leaf":false,"text":"United States Studies: 1865 to the Present","children":[{"leaf":false,"text":"Standard 5-1: The student will demonstrate an understanding of Reconstruction and its impact on racial relations in the United States.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DFC","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"5-1.1","text":"Summarize the aims of Reconstruction and explain the effects of Abraham Lincoln's assassination on the course of Reconstruction. (P, H, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DFD","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"5-1.2","text":"Summarize the provisions of the Thirteenth, Fourteenth, and Fifteenth Amendments to the Constitution, including how the amendments protected the rights of African Americans and sought to enhance their political, social, and economic opportunities. (P, E, H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DFE","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"5-1.3","text":"Explain the effects of Reconstruction on African Americans, including their new rights and restrictions, their motivations to relocate to the North and the West, and the actions of the Freedmen's Bureau. (P, G, E, H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044DFF","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"5-1.4","text":"Compare the economic and social effects of Reconstruction on different populations, including the move from farms to factories and the change from the plantation system to sharecropping. (E, P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E00","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"5-1.5","text":"Explain the purpose and motivations behind the rise of discriminatory laws and groups and their effect on the rights and opportunities of African Americans in different regions of the United States. (P, G, E, H)"}]},{"leaf":false,"text":"Standard 5-2: The student will demonstrate an understanding of the continued westward expansion of the United States.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E01","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"5-2.1","text":"Explain how aspects of the natural environment—including the principal mountain ranges and rivers, terrain, vegetation, and climate of the region—affected travel to the West and thus the settlement of that region. (G, H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E02","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"5-2.2","text":"Illustrate the effects of settlement on the environment of the West, including changes in the physical and human systems. (G)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E03","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"5-2.3","text":"Summarize how railroads affected development of the West, including their ease and inexpensiveness for travelers and their impact on trade and the natural environment. (G, E, H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E04","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"5-2.4","text":"Provide examples of conflict and cooperation between occupational and ethnic groups in the West, including miners, ranchers, and cowboys; Native Americans and Mexican Americans; and European and Asian immigrants. (E, H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E05","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"5-2.5","text":"Explain the social and economic effects of the westward expansion on Native Americans, including changes in federal policies, armed conflicts, opposing views concerning land ownership, and Native American displacement. (P, G, E, H)"}]},{"leaf":false,"text":"Standard 5-3: The student will demonstrate an understanding of major domestic and foreign developments that contributed to the United States' becoming a world power.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E06","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"5-3.1","text":"Explain how the Industrial Revolution was furthered by new inventions and technologies, including new methods of mass production and transportation and the invention of the light bulb, the telegraph, and the telephone. (E, H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E07","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"5-3.2","text":"Identify prominent inventors and scientists of the period and summarize their inventions or discoveries, including Thomas Edison, Alexander Graham Bell, the Wright Brothers, and Albert Einstein. (H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E08","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"5-3.3","text":"Explain the effects of immigration and urbanization on the American economy during the Industrial Revolution, including the role of immigrants in the work force and the growth of cities, the shift from an agrarian to an industrial economy, and the rise of big business. (P, G, E, H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E09","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"5-3.4","text":"Summarize the significance of large-scale immigration and the contributions of immigrants to America in the early 1900s, including the countries from which they came, the opportunities and resistance they faced when they arrived, and the cultural and economic contributions they made to this nation. (P, G, E, H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E0A","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"5-3.5","text":"Explain how building cities and industries led to progressive reforms, including labor reforms, business reforms, and Prohibition. (P, G, E, H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E0B","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"5-3.6","text":"Summarize actions by the United States that contributed to the rise of this nation as a world power, including the annexation of new territory following the Spanish-American War and the role played by the United States in the building of the Panama Canal and in World War I. (P, G, H)"}]},{"leaf":false,"text":"Standard 5-4: The student will demonstrate an understanding of the economic boom-and-bust in America in the 1920s and 1930s, its resultant political instability, and the subsequent worldwide response.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E0C","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"5-4.1","text":"Summarize changes in daily life in the boom period of the 1920s, including the improved standard of living; the popularity of new technology such as automobiles, airplanes, radio, and movies; the Harlem Renaissance and the Great Migration; Prohibition; and racial and ethnic conflict. (P, E, H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E0D","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"5-4.2","text":"Summarize the stock market crash of 1929 and the Great Depression, including economic weakness, unemployment, failed banks and businesses, and migration from rural areas. (P, G, E, H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E0E","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"5-4.3","text":"Explain the immediate and lasting effect on American workers caused by innovations of the New Deal, including the Social Security Act, the Federal Deposit Insurance Corporation, and the Civilian Conservation Corps. (P, E, H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E0F","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"5-4.4","text":"Explain the principal events related to the United States' involvement in World War II— including the bombing of Pearl Harbor, the invasion in Normandy, Pacific island hopping, the bombing of Hiroshima and Nagasaki—and the role of key figures in this involvement such as Winston Churchill, Franklin D. Roosevelt, Joseph Stalin, and Adolf Hitler. (P, G, H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E10","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"5-4.5","text":"Summarize the political and social impact of World War II, including changes in women's roles, in attitudes toward Japanese Americans, and in nation-state boundaries and governments. (P, E, H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E11","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"5-4.6","text":"Summarize key developments in technology, aviation, weaponry, and communication and explain their effect on World War II and the economy of the United States. (P, E, H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E12","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"5-4.7","text":"Explain the effects of increasing worldwide economic interdependence following World War II, including how interdependence between and among nations and regions affected economic productivity, politics, and world trade. (P, G, E, H)"}]},{"leaf":false,"text":"Standard 5-5: The student will demonstrate an understanding of the social, economic, and political events that influenced the United States during the Cold War era.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E13","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"5-5.1","text":"Summarize the impact of cultural developments in the United States following World War II, including the significance of pop culture and mass media and the population shifts to the suburbs. (G, H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E14","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"5-5.2","text":"Summarize changes in the United States economy following World War II, including the expanding job market and service industry, consumerism, and new technology. (E, P, H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E15","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"5-5.3","text":"Explain the advancement of the civil rights movement in the United States, including key events and people: desegregation of the armed forces, Brown v. Board of Education, Martin Luther King Jr., Rosa Parks, and Malcolm X. (P, G, H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E16","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"5-5.4","text":"Explain the course of the Cold War, including differing economic and political philosophies of the Union of Soviet Socialist Republics (USSR) and the United States, the spread of Communism, McCarthyism, the Korean Conflict, the Berlin Wall, the space race, the Cuban missile crisis, and the Vietnam War. (P, G, E, H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E17","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"5-5.5","text":"Explain the political alliances and policies that impacted the United States in the latter part of the twentieth century, including the North Atlantic Treaty Organization (NATO), the United Nations, and the Organization of Petroleum Exporting Countries (OPEC). (P, H, E, G)"}]},{"leaf":false,"text":"Standard 5-6: The student will demonstrate an understanding of developments in the United States since the fall of the Soviet Union and its satellite states in 1992.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E18","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"5-6.1","text":"Use a map to identify the regions of United States political involvement since the fall of the communist states, including places in the Middle East, Central America, the Caribbean, Africa, the Balkans in Europe, and Asia. (P, G, H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E19","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"5-6.2","text":"Explain how humans change the physical environment of regions and the consequences of such changes, including use of natural resources and the expansion of transportation systems. (P, G, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E1A","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"5-6.3","text":"Explain how technological innovations have changed daily life in the United States since the early 1990s, including changes in the economy and the culture that were brought about by computers, electronics, satellites, and mass communication systems. (E, H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E1B","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"5-6.4","text":"Identify examples of cultural exchange between the United States and other countries that illustrate the importance of popular culture and the influence of American popular culture in other places in the world, including music, fashion, food, and movies. (G, H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E1C","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"5-6.5","text":"Summarize the changes that have taken place in United States foreign policy since 1992, including the globalization of trade and the war on terrorism. (P, H, G, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E1D","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"5-6.6","text":"Compare the position of the United States on the world stage following World War I, World War II, and the collapse of the communist states. (P, H)"}]}]},{"leaf":false,"text":"Ancient Cultures to 1600","children":[{"leaf":false,"text":"Standard 6-1: The student will demonstrate an understanding of the transition of humans from nomadic to settled life in the cradles of civilization.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E1E","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"6-1.1","text":"Analyze the hunter-gatherer communities in regard to their geographic, social, and cultural characteristics, including adaptation to the natural environment. (G, H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E1F","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"6-1.2","text":"Explain the emergence of agriculture and its effect on early human communities, including the impact of irrigation techniques and the domestication of plants and animals. (H, E, G)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E20","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"6-1.3","text":"Use maps, globes, and models in explaining the role of the natural environment in shaping early civilizations, including the role of the river systems of the Nile (Egyptian), Tigris-Euphrates (Sumerian, Babylonian, Phoenician), Huang He (Chinese), and Indus (Harappan); the relationship of landforms, climate, and natural resources to trade and other economic activities and trade; and the ways that different human communities adapted to the environment. (G, H, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E21","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"6-1.4","text":"Compare the cultural, social, and political features and contributions of civilizations in the Tigris and Euphrates, Nile, Indus, and Huang He river valleys, including the evolution of language and writing systems, architecture, religious traditions and forms of social order, the division or specialization of labor, and the development of different forms of government. (H, P, E, G)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E22","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"6-1.5","text":"Explain the role of economics in the development of early civilizations, including the significance and geography of trade networks and the agriculture techniques that allowed for an economic surplus and the emergence of city centers. (E, G, H)"}]},{"leaf":false,"text":"Standard 6-2: The student will demonstrate an understanding of life in ancient classical civilizations and their contributions to the modern world.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E23","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"6-2.1","text":"Compare the origins, founding leaders, basic principles, and diffusion of major religions and philosophies as they emerged and expanded, including Judaism, Christianity, Islam, Buddhism, Hinduism, Confucianism, and Taoism. (H, G)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E24","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"6-2.2","text":"Summarize the significant political and cultural features of the classical Greek civilization, including the concept of citizenship and the early forms of democratic government in Athens; the role of Alexander the Great as a political and military leader; and the contributions of Socrates, Plato, Archimedes, Aristotle, and others in philosophy, architecture, literature, the arts, science, and mathematics. (H, G, P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E25","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"6-2.3","text":"Summarize the significant political and cultural features of the classical Roman civilization, including its concepts of citizenship, law, and government; its contributions to literature and the arts; and its innovations in architecture and engineering such as roads, arches and keystones, and aqueducts. (H, P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E26","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"6-2.4","text":"Explain the expansion and the decline of the Roman Empire, including the political and geographic reasons for its growth, the role of Julius Caesar and Augustus, and the internal weaknesses and external threats that contributed to the Empire's decline. (G, H, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E27","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"6-2.5","text":"Summarize the significant features of the classical Indian civilization, including the caste system and contributions to the modern world in literature, the arts, and mathematics. (H, G)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E28","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"6-2.6","text":"Summarize the significant features of the classical Chinese civilization, including the Silk Road and contributions to the modern world such as gunpowder, paper, silk, and the seismograph. (H, G, E)"}]},{"leaf":false,"text":"Standard 6-3: The student will demonstrate an understanding of the Middle Ages and the emergence of the nation-states.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E29","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"6-3.1","text":"Explain feudalism and its relationship to the development of European nation states and monarchies, including feudal relationships, the daily lives of peasants and serfs, the economy under the feudal/manorial system, and the fact that feudalism helped monarchs centralize power. (E, H, P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E2A","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"6-3.2","text":"Explain the development of English government and legal practices, including the principles of the Magna Carta, its effect on the feudal system, and its contribution to the development of representative government in England. (P, H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E2B","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"6-3.3","text":"Summarize the course of the Crusades and explain their effects, including their role in spreading Christianity and in introducing Asian and African ideas and products to Europe. (H, G, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E2C","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"6-3.4","text":"Explain the influence of the Roman Catholic Church in Europe, including its role in spreading Christianity and the fact that monasteries affected education and the arts by founding universities and preserving ancient language and learning. (H, G)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E2D","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"6-3.5","text":"Use a map to illustrate the origins and the spread of the bubonic plague through Central Asia, China, the Middle East, and Europe and explain the impact of the plague on society, including the plague's effect on people's daily lives, its role in bringing an end to the feudal system, and its impact on the global population. (G, H, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E2E","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"6-3.6","text":"Explain the contributions that the Byzantine Empire made to the world, including the Justinian Code and the preservation of ancient Greek and Roman learning and traditions, architecture, and government. (H, G)"}]},{"leaf":false,"text":"Standard 6-4: The student will demonstrate an understanding of changing political, social, and economic cultures in Europe, Asia, Africa, and the Americas.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E2F","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"6-4.1","text":"Compare the features and major contributions of the African civilizations of Ghana, Mali, and Songhai, including the influence of geography on their growth and the impact of Islam and Christianity on their cultures. (H, G, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E30","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"6-4.2","text":"Summarize the features and major contributions of China, including its golden age of art and literature, the invention of gunpowder and woodblock printing, and commercial expansion and the rise of trade. (H, G, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E31","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"6-4.3","text":"Summarize the features and major contributions of the Japanese civilization, including the Japanese feudal system, the Shinto traditions, and contributions in literature and the arts. (H, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E32","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"6-4.4","text":"Compare the significant political, social, geographic, and economic features and the contributions of the Aztecan, Mayan, and Incan civilizations, including their forms of government and their contributions in mathematics, astronomy, and architecture. (H, G, E, P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E33","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"6-4.5","text":"Summarize the characteristics of the Islamic civilization and the geographic aspects of its expansion. (G, H)"}]},{"leaf":false,"text":"Standard 6-5: The student will demonstrate an understanding of the development and the impact of the Renaissance and the Reformation on Europe and rest of the world.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E34","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"6-5.1","text":"Summarize the origins of the Renaissance and its spread throughout Europe, including interaction between Europeans and Muslims during the Crusades, political and economic changes, developments in commerce, and intellectual and artistic growth. (P, G, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E35","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"6-5.2","text":"Summarize the features and contributions of the Italian Renaissance, including the importance of Florence and the accomplishments the Italians in art, music, literature, and architecture. (H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E36","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"6-5.3","text":"Explain the significance of humanism and the revival of classical learning in daily life during the Renaissance, including the effect of humanism on education, art, religion, and government. (P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E37","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"6-5.4","text":"Identify the key figures of the Renaissance and the Reformation and their contributions, including Leonardo da Vinci, Michelangelo, Johannes Gutenberg, John Calvin, and Martin Luther. (H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E38","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"6-5.5","text":"Provide examples of developments in the Renaissance that had a lasting impact on culture, politics, and government in Europe, including advances in printing technology and improved understanding of anatomy and astronomy. (P, G)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E39","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"6-5.6","text":"Explain the principal causes and key events of the Reformation, including conflicts surrounding the Roman Catholic Church, the main points of theological differences, the regional patterns of the religious affiliations involved, and the key events and figures of the Counter Reformation. (P, G)"}]},{"leaf":false,"text":"Standard 6-6: The student will demonstrate an understanding of the age European exploration and settlement in the New World.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E3A","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"6-6.1","text":"Use a map to illustrate the principal routes of exploration and trade between Europe, Asia, Africa, and the Americas during the age of European exploration. (G, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E3B","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"6-6.2","text":"Compare the incentives of the various European countries to explore and settle new lands. (P, G, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E3C","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"6-6.3","text":"Illustrate the exchange of plants, animals, diseases, and technology throughout Europe, Asia, Africa, and the Americas (known as the Columbian Exchange), and explain the effect on the people of these regions. (G, E)"}]}]},{"leaf":false,"text":"Contemporary Cultures: 1600 to the Present","children":[{"leaf":false,"text":"Standard 7-1: The student will demonstrate an understanding of the colonial expansion of European powers and their impact on world government in the seventeenth and eighteenth centuries.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E3D","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"7-1.1","text":"Use a map or series of maps to identify the colonial expansion of European powers in Africa, Asia, Oceania, and the Americas through 1770. (G, H, P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E3E","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"7-1.2","text":"Explain how technological and scientific advances, including navigational advances and the use of gunpowder, affected various parts of the world politically, socially, and economically and contributed to the power of European nations. (H, G, P, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E3F","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"7-1.3","text":"Compare how European nations exercised political and economic influence differently in the Americas, including trading-post empires, plantation colonies, and settler colonies. (H, G, P, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E40","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"7-1.4","text":"Summarize the characteristics of European colonial power and explain its effects on the society and culture of African nations, including instances of participation in and resistance to the slave trade. (H, G, P, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E41","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"7-1.5","text":"Summarize the characteristics of European colonial powers in Asia and their effects on the society and culture of Asia, including global trade patterns and the spread of various religions. (H, G, P, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E42","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"7-1.6","text":"Explain the emergence of capitalism, including the significance of mercantilism, a developing market economy, an expanding international trade, and the rise of the middle class. (E, H, P)"}]},{"leaf":false,"text":"Standard 7-2: The student will demonstrate an understanding of the concept of absolute monarchies and constitutional government in the seventeenth and eighteenth centuries.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E43","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"7-2.1","text":"Summarize the essential characteristics of the limited government in England following the Glorious Revolution and the unlimited governments in France and Russia, including some of the restraints placed upon a limited government's power and how authoritarian and totalitarian systems are considered unlimited governments. (P, H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E44","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"7-2.2","text":"Summarize the ideas of the Enlightenment that influenced democratic thought and social institutions throughout the world, including the political philosophies of John Locke, Jean- Jacques Rousseau, and Baron de Montesquieu. (P, H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E45","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"7-2.3","text":"Outline the role and purposes of a constitution, including such functions as defining a relationship between a people and their government, describing the organization of government and the characteristics of shared powers, and protecting individual rights and promoting the common good. (P, H)"}]},{"leaf":false,"text":"Standard 7-3: The student will demonstrate an understanding of political, social, and economic upheavals that occurred throughout the world during the age of revolution, from 1770 through 1848.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E46","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"7-3.1","text":"Summarize the achievements and contributions of the scientific revolution, including its roots, the development of the scientific method, and the interaction between scientific thought and traditional religious beliefs. (H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E47","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"7-3.2","text":"Explain the causes, key ideas, and effects of the French Revolution, including the influence of ideas from the American Revolution and the Enlightenment and ways that the Revolution changed social conditions in France and the rest of Europe. (P, H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E48","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"7-3.3","text":"Compare the development of Latin American independence movements, including the Haitian revolution, the role of Simón Bolívar in different independence movements, and the role of Father Miguel Hidalgo in the Mexican Revolution of 1810. (P, H, G)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E49","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"7-3.4","text":"Explain the causes and course of the Industrial Revolution in Europe, Japan, and the United States, including the reasons that England was the first nation to industrialize, the impact of the growth of population and the rural-to-urban migration, the changes in the organization of work and labor, and the development of socialism. (E, H, G)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E4A","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"7-3.5","text":"Explain the impact of the new technology that emerged during the Industrial Revolution, including changes that promoted the industrialization of textile production in England and the impact of interchangeable parts and mass production. (E, H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E4B","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"7-3.6","text":"Compare the emergence of nationalist movements across Europe in the nineteenth century, including the unification of Italy, the unification of Germany, and Napoleon's role in the spreading of nationalism. (H, P, G)"}]},{"leaf":false,"text":"Standard 7-4: The student will demonstrate an understanding of the impact of imperialism throughout the world in the late nineteenth and early twentieth centuries.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E4C","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"7-4.1","text":"Summarize the economic origins of European imperialism, including the conflicts among European nations as they competed for raw materials and markets and for the establishment of colonies in Africa, Asia, and Oceania. (H, E, G)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E4D","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"7-4.2","text":"Use a map to illustrate the geographic extent of European imperialism in various regions, including Africa, Asia, the Middle East, South America, Australia, New Zealand, Siberia, and Canada. (G, H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E4E","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"7-4.3","text":"Explain the causes and effects of the Spanish-American War and its reflection of the United States' interest in imperial expansion, including this nation's acquisition of the Philippines, Puerto Rico, and Guam; its temporary occupation of Cuba; and its rise as a world power. (G, H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E4F","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"7-4.4","text":"Compare differing views with regard to colonization and the reactions of people under colonial rule in the late nineteenth and early twentieth centuries, including the Zulu War, the Sepoy Rebellion, and the Boxer Rebellion. (H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E50","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"7-4.5","text":"Summarize the significant features and explain the causes of Japan's imperial expansion in East Asia, including the defeat of the Russians in the Russo-Japanese War, the reasons for the expansion in Korea and Manchuria, and the rise of Japan as a world power. (H, G, E)"}]},{"leaf":false,"text":"Standard 7-5: The student will demonstrate an understanding of the causes and effects of world conflicts in the early twentieth century.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E51","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"7-5.1","text":"Explain the causes and key events of World War I, including the rise of nationalism, ethnic and ideological conflicts in different regions, political and economic rivalries, the human costs of the mechanization of war, the Russian Revolution, and the entry of the United States into the War. (H, P, G, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E52","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"7-5.2","text":"Explain the outcome and effects of World War I, including the conditions and failures of the League of Nations and the Treaty of Versailles and the effects of major treaties on population movement, the international economy, and shifts in borders. (H, P, G, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E53","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"7-5.3","text":"Explain the worldwide depression that took place in the 1930s, including the economic crash of 1929 and political responses to the depression such as the New Deal in the United States, the rise of Nazism in Germany, and the economic retrenchment in Britain. (E, H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E54","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"7-5.4","text":"Summarize aspects of the rise of totalitarian governments in Germany, Italy, Japan, and the Soviet Union, including Fascist aggression and the responses of major powers and the rise of Joseph Stalin. (H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E55","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"7-5.5","text":"Explain the causes, key events, and outcomes of World War II, including the German, Italian, and Japanese drives for empire; the role of appeasement and isolationism in Europe and the United States; the major turning points of the war and the principal theaters of conflict; the importance of geographic factors; the roles of political leaders; and the human costs and impact of the war both on civilizations and on soldiers. (H, G, P, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E56","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"7-5.6","text":"Summarize the Holocaust and its impact on European society and Jewish culture, including Nazi policies to eliminate the Jews and other minorities, the \"Final Solution,\" and the war crimes trials at Nuremberg. (H)"}]},{"leaf":false,"text":"Standard 7-6: The student will demonstrate an understanding of international developments in the post–World War II world, including the impact of the Cold War on the world.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E57","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"7-6.1","text":"Summarize the political and economic transformation of Western and Eastern Europe after World War II, including the significance of the Truman Doctrine, the Marshall Plan, the North Atlantic Treaty Organization (NATO), the United Nations, the Warsaw Pact, and the European Economic Community (EEC). (H, P, E, G)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E58","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"7-6.2","text":"Summarize the events of the Cold War, including the Soviet domination of Eastern Europe; the rise of the Communist party in China; the building of the Berlin wall; the economic and political competition for influence in Vietnam and Korea; the Cuban missile crisis; the revolutionary movements in Africa; the development of new military, nuclear, and space technology; and the threat of nuclear annihilation. (H, P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E59","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"7-6.3","text":"Explain the causes and major features of the political and social change that occurred in the Middle East in the post–World War II period, including the role of nationalism, the creation of the state of Israel, and ongoing conflicts in the region. (H, P, G)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E5A","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"7-6.4","text":"Compare features of nationalist and independence movements in different regions in the post–World War II period, including Mohandas Gandhi's role in the nonviolence movement for India's independence and the emergence of nationalist movements in African and Asian countries. (H, P)"}]},{"leaf":false,"text":"Standard 7-7: The student will demonstrate an understanding of the significant political, economic, geographic, scientific, technological, and cultural changes and advancements that took place throughout the world from the beginning of the twentieth century to the present day.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E5B","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"7-7.1","text":"Illustrate on a time line the events that contributed to the collapse of the Soviet Union and other communist governments in Europe, including economic failures and the emergence of new leaders. (H, E, P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E5C","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"7-7.2","text":"Explain the significance and impact of the information, technological, and communications revolutions, including the role of television, satellites, computers, and the Internet. (H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E5D","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"7-7.3","text":"Explain global influences on the environment, including the effects of increases in population, the growth of cities, and efforts by citizens and governments to protect the natural environment. (G)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E5E","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"7-7.4","text":"Summarize global efforts to advance human rights, including the United Nations' adoption and proclamation of the Universal Declaration of Human Rights, the end of colonialism by European nation-states, and the collapse of the apartheid system. (H, G, P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E5F","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"7-7.5","text":"Compare the social, economic, and political opportunities for women in various nations and societies around the world, including those in developing and industrialized nations and within societies dominated by particular religions. (H, G, P, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E60","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"7-7.6","text":"Explain the impact of increasing global economic interdependence in the late twentieth century and the early twenty-first century, including the significance of global communication, labor demands, and migration; the European Economic Community (EEC) and other trade agreements; and the oil crisis of the 1970s. (E, G, H, P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E61","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"7-7.7","text":"Summarize the dangers to the natural environment that are posed by population growth, urbanization, and industrialization. (G, E, P, H)"}]}]},{"leaf":false,"text":"South Carolina: One of the United States","children":[{"leaf":false,"text":"Standard 8-1: The student will demonstrate an understanding of the settlement of South Carolina and the United States by Native Americans, Europeans, and Africans.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E62","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"8-1.1","text":"Summarize the culture, political systems, and daily life of the Native Americans of the Eastern Woodlands, including their methods of hunting and farming, their use of natural resources and geographic features, and their relationships with other nations. (H, G, P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E63","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"8-1.2","text":"Categorize events according to the ways they improved or worsened relations between Native Americans and European settlers, including alliances and land agreements between the English and the Catawba, Cherokee, and Yemassee; deerskin trading; the Yemassee War; and the Cherokee War. (H, P, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E64","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"8-1.3","text":"Summarize the history of European settlement in Carolina from the first attempts to settle at San Miguel de Gualdape, Charlesfort, San Felipe, and Albemarle Point to the time of South Carolina's establishment as an economically important British colony, including the diverse origins of the settlers, the early government, the importance of the plantation system and slavery, and the impact of the natural environment on the development of the colony. (H, G, P, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E65","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"8-1.4","text":"Explain the growth of the African American population during the colonial period and the significance of African Americans in the developing culture (e.g., Gullah) and economy of South Carolina, including the origins of African American slaves, the growth of the slave trade, the impact of population imbalance between African and European Americans, and the Stono Rebellion and subsequent laws to control the slave population. (H, G, P, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E66","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"8-1.5","text":"Summarize the significant changes to South Carolina's government during the colonial period, including the proprietary regime and the period of royal government, and the significance of the Regulator movement. (G, P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E67","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"8-1.6","text":"Explain how South Carolinians used natural, human, and political resources to gain economic prosperity, including trade with Barbados, rice planting, Eliza Lucas Pinckney and indigo planting, the slave trade, and the practice of mercantilism. (H, G, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E68","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"8-1.7","text":"Summarize the military and economic involvement of South Carolina in the French- British colonial rivalry. (H, G, P, E)"}]},{"leaf":false,"text":"Standard 8-2: The student will demonstrate an understanding of the American Revolution—the beginnings of the new American nation and South Carolina's part in the development of that nation.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E69","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"8-2.1","text":"Explain the interests and roles of South Carolinians in the events leading to the American Revolution, including the state's reactions to the Stamp Act and the Tea Act; the role of Christopher Gadsden and the Sons of Liberty; and the role of the four South Carolina signers of the Declaration of Independence—Edward Rutledge, Arthur Middleton, Thomas Lynch Jr., and Thomas Heyward Jr. (H, P, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E6A","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"8-2.2","text":"Compare the perspectives and roles of different South Carolinians during the American Revolution, including those of political leaders, soldiers, partisans, Patriots, Tories/Loyalists, women, African Americans, and Native Americans. (H, G, P, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E6B","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"8-2.3","text":"Summarize the course and key conflicts of the American Revolution in South Carolina and its effects on the state, including the attacks on Charleston; the Battle of Camden; the partisan warfare of Thomas Sumter, Andrew Pickens, and Francis Marion; the Battle of Cowpens; and the Battle of Kings Mountain. (H, G)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E6C","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"8-2.4","text":"Summarize events related to the adoption of South Carolina's first constitution, the role of South Carolina and its leaders in the Continental Congress, and the ratification of the United States Constitution, including Henry Laurens's actions, Charles Pinckney's role, and the importance of issues debated during the Philadelphia Convention for South Carolina. (H, P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E6D","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"8-2.5","text":"Explain the economic and political tensions between the people of the Upcountry and the Lowcountry of South Carolina, including the economic struggles of both groups following the American Revolution, their disagreement over representation in the General Assembly and the location of the new capital city, and the transformation of the state's economy that was caused by the production of cotton and convinced lowcountry men to share power with upcountry men. (H, G, P, E)"}]},{"leaf":false,"text":"Standard 8-3: The student will demonstrate an understanding of the American Civil War—its causes and effects and the major events that occurred during that time.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E6E","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"8-3.1","text":"Explain the importance of agriculture in antebellum South Carolina, including plantation life, slavery, and the impact of the cotton gin. (H, G, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E6F","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"8-3.2","text":"Explain the impact of key events leading to South Carolina's secession from the Union, including the nullification crisis and John C. Calhoun, the Missouri Compromise, the Tariff of 1832, the Compromise of 1850, the Kansas-Nebraska Act and subsequent armed conflict, the Dred Scott decision, the growth of the abolitionist movement, and the election of 1860. (H, P, G)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E70","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"8-3.3","text":"Draw conclusions about how sectionalism arose from events or circumstances of racial tension, internal population shifts, and political conflicts, including the Denmark Vesey plot, slave codes, and the African American population majority. (H, P, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E71","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"8-3.4","text":"Compare the attitudes of the unionists, cooperationists, and secessionists in South Carolina and summarize the reasons that the members of the South Carolina secession convention in 1860 voted unanimously to secede from the Union, including concerns about states' rights and fears about abolition. (H, P, G, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E72","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"8-3.5","text":"Compare the military strategies of the North and South with regard to specific events and geographic locations in South Carolina, including the capture of Port Royal, the Union blockade of Charleston, and Sherman's march through the state. (H, P, G)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E73","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"8-3.6","text":"Compare the effects of the Civil War on daily life in South Carolina, including the experiences of plantation owners, women, Confederate and Union soldiers, African Americans, and children. (H, E)"}]},{"leaf":false,"text":"Standard 8-4: The student will demonstrate an understanding of the impact of Reconstruction on the people and government of South Carolina.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E74","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"8-4.1","text":"Explain the purposes of Reconstruction with attention to the economic, social, political, and geographic problems facing the South, including reconstruction of towns, factories, farms, and transportation systems; the effects of emancipation; racial tension; tension between social classes; and disagreement over voting rights. (H, G, P, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E75","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"8-4.2","text":"Summarize Reconstruction in South Carolina and its effects on daily life in South Carolina, including the experiences of plantation owners, small farmers, freedmen, women, and northern immigrants. (H, P, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E76","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"8-4.3","text":"Summarize the events and the process that led to the ratification of South Carolina's constitution of 1868, including African American representation in the constitutional convention; the major provisions of the constitution; and the political and social changes that allowed African Americans, Northerners, \"carpetbaggers,\" and \"scalawags\" to play a part in South Carolina state government. (H, P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E77","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"8-4.4","text":"Explain how events during Reconstruction improved opportunities for African Americans but created a backlash that, by the end of Reconstruction, negated the gains African Americans had made, including the philanthropy of northern aid societies, the assistance provided by the federal government such as the Freedmen's Bureau, and their advancement in politics and education. (H, P, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E78","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"8-4.5","text":"Summarize the successes and failures that occurred in South Carolina during Reconstruction, including the bribery of legislators, corruption in political parties, the development of public education, and violence during the election of 1876. (H, P)"}]},{"leaf":false,"text":"Standard 8-5: The student will demonstrate an understanding of major social, political, and economic developments that took place in the United States during the second half of the nineteenth century.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E79","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"8-5.1","text":"Summarize the political, economic, and social conditions in South Carolina following the end of Reconstruction, including the leadership of Wade Hampton and the so-called Bourbons or Redeemers, agricultural depression and struggling industrial development, the impact of the temperance and suffrage movements, the development of the 1895 constitution, and the evolution of race relations and Jim Crow laws. (H, P, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E7A","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"8-5.2","text":"Compare key aspects of the Populist movement in South Carolina, including the economic and political roots of Populism, the leadership of Benjamin Tillman, conflicts between the Tillmanites and the Conservatives, the founding of land-grant colleges, and the increased racial conflicts and lynching. (H, G, P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E7B","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"8-5.3","text":"Summarize the changes that occurred in South Carolina agriculture and industry during the late nineteenth century, including changes in crop production in various regions, and the growth of the textile industry in the Upcountry. (H, G, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E7C","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"8-5.4","text":"Compare migration patterns within South Carolina and in the United States as a whole in the late nineteenth century, including the population shift from rural to urban areas, migration between regions of the United States, the westward expansion, and the motivations for migration and settlement. (H, G, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E7D","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"8-5.5","text":"Summarize the human, agricultural, and economic costs of natural disasters and wars that occurred in South Carolina or involved South Carolinians in the late nineteenth century, including the Charleston earthquake of 1886, the hurricane of 1893, and the Spanish American War. (H, G, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E7E","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"8-5.6","text":"Explain the significance that the increased immigration into the United States in the late nineteenth century had for the state of South Carolina, including cultural and economic contributions of immigrants, opportunities and struggles experienced by immigrants, increased racial hostility, and the effect of racial and ethnic diversity on national identity. (H, G, P, E)"}]},{"leaf":false,"text":"Standard 8-6: The student will demonstrate an understanding of South Carolina's development during the early twentieth century.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E7F","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"8-6.1","text":"Summarize the progressive reform movement in South Carolina, including the motivation of progressives; child labor laws; Prohibition; improvements to roads, hospitals, and libraries; tax reforms; changes to local government systems; and the roles of significant state governors and women's groups. (H, P, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E80","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"8-6.2","text":"Explain the impact of World War I on South Carolina, including the building of new military bases and the economic impact of emigration to industrial jobs in the North. (H, G, P, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E81","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"8-6.3","text":"Summarize the political, social, and economic situation in South Carolina following World War I, including progress in suffrage for women, improvements in daily life in urban and rural areas, and changes in agriculture and industry. (H, G, P, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E82","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"8-6.4","text":"Explain the causes and the effects of changes in South Carolina culture during the 1920s, including Prohibition, the boll weevil, the rise of mass media, increases in tourism and recreation, the revival of the Ku Klux Klan, and the Southern Literary Renaissance. (H, P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E83","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"8-6.5","text":"Explain the effects of the Great Depression and the lasting impact of New Deal programs on South Carolina, including the Rural Electrification Act, the Civilian Conservation Corps, Works Progress Administration and Public Works Administration building projects, the Social Security Act, and the Santee Cooper electricity project. (H, E, G, P)"}]},{"leaf":false,"text":"Standard 8-7: The student will demonstrate an understanding of South Carolina's economic revitalization during World War II and the latter twentieth century.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E84","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"8-7.1","text":"Summarize the significant aspects of the economic growth experienced by South Carolina during and following World War II, including the contributions of Governor Strom Thurmond in promoting economic growth; the creation of the State Development Board and the technical education system; the benefits of good road systems, a sea port, and the Savannah River site; and the scarcity of labor unions. (H, E, G, P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E85","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"8-7.2","text":"Provide examples of the expanding role of tourism in South Carolina's economy, including the growth of resorts and development along the coast and the expanding transportation systems that allowed greater access to recreational sites. (H, G, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E86","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"8-7.3","text":"Explain how the increased industrialization and mechanization, the reduction in cotton production, and the emigration of African Americans both resulted from and contributed to agricultural decline in South Carolina. (H, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E87","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"8-7.4","text":"Explain the factors that influenced the economic opportunities of African American South Carolinians during the latter twentieth century, including racial discrimination, the Briggs v. Elliott case, the integration of public facilities and the civil rights movement, agricultural decline, and statewide educational improvement. (H, P, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E88","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"8-7.5","text":"Explain the economic impact of twentieth century events on South Carolina, including the opening and closing of military bases, the development of industries, the influx of new citizens, and the expansion of port facilities. (E, H, P, G)"}]}]},{"leaf":false,"text":"Global Studies","children":[{"leaf":false,"text":"Standard GS-1: The student will demonstrate an understanding of life in the classical civilizations and the contributions that these civilizations have made to the modern world.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E89","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"GS-1.1","text":"Explain the influence of Athenian government and philosophy on other civilizations including the importance of Plato's Republic and the concepts of participatory government, citizenship, freedom, and justice. (H, P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E8A","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"GS-1.2","text":"Summarize the essential characteristics of Roman civilization and explain their impact today, including the influence of other civilizations on Rome's development, the changes to Rome's political system over time, the economic structure of Roman trade and labor, and factors contributing to the decline of the empire. (H, G, P, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E8B","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"GS-1.3","text":"Explain the rise and growth of Christianity during the classical era, including patterns of expansion across continents, the effects of diffusion on religious beliefs and traditions, and the influence of Christianity on culture and politics. (H, G)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E8C","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"GS-1.4","text":"Explain the impact of religion in classical Indian civilization, including Hinduism and the effects of its beliefs and practices on daily life, changes that occurred as a result of Buddhist teachings, and the influence of religion on culture and politics. (H, P)"}]},{"leaf":false,"text":"Standard GS-2: The student will demonstrate an understanding of the social, political, geographic, and economic changes that took place in Africa, Asia, Europe, and the Americas from the time of the Byzantine Empire through the Middle Ages.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E8D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"GS-2.1","text":"Explain the influence of the Byzantine Empire, including the role the Empire played in preserving Hellenistic (Greek) and learning. (H, G, P, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E8E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"GS-2.2","text":"Summarize the origins and expansion of Islam, including its basic beliefs, the emergence and the spread of an Islamic empire, the reasons for the split between Sunni and Shiite groups, and the changing role of women in the modern world. (H, G, P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E8F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"GS-2.3","text":"Summarize the economic, geographic, and social influences of trans-Saharan trade on Africa, including education and the growth of cities. (E, G, H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E90","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"GS-2.4","text":"Compare the origins and characteristics of the Mayan, Aztecan, and Incan civilizations, including their economic foundations, their political organization, their technological achievements, and their cultural legacies of art and architecture. (H, G, P, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E91","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"GS-2.5","text":"Summarize the functions of feudalism and manorialism in medieval Europe, including the creation of nation-states as feudal institutions helped monarchies to centralize power and the evolution of the relationship between the secular states and Roman Catholic Church. (P, H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E92","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"GS-2.6","text":"Analyze the social, political, and economic upheaval and recovery that occurred in Europe during the Middle Ages, including the plague and the subsequent population decline, the predominance of religion and the impact of the Crusades, and the increasing interregional trade. (H, G, P, E)"}]},{"leaf":false,"text":"Standard GS-3: The student will demonstrate an understanding of the influence of the Western world in the spread of new ideas that took place from the Renaissance through the eighteenth century.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E93","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"GS-3.1","text":"Compare the impact of the Renaissance and the Reformation on life in Europe, including changes in the status of women, the revolution in art and architecture, the causes and effects of divisions in religious affiliation, and the presence of social oppression and conflict. (H, P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E94","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"GS-3.2","text":"Explain the long-term effects of political changes that occurred in Europe during the sixteenth, seventeenth, and eighteenth centuries, including the emergence of a strong monarchial form of government and the changes in the governments of England and France as they compare with one another. (H, G, P, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E95","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"GS-3.3","text":"Summarize the origins and contributions of the scientific revolution. (H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E96","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"GS-3.4","text":"Explain the ways that Enlightenment ideas spread through Europe and their effect on European society, including the role of academies, salons, and publishing; the connection between the Enlightenment and the scientific revolution; and the political and cultural influence of thinkers such as John Locke, Voltaire, Jean-Jacques Rousseau, and Baron de Montesquieu. (H, G, P)"}]},{"leaf":false,"text":"Standard GS-4: The student will demonstrate an understanding of the effects of the economic, geographic, and political interactions that took place throughout the world during the nineteenth century.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E97","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"GS-4.1","text":"Explain the significant political, commercial, and cultural changes that took place in China in the nineteenth century, including the unification of Chinese culture and the motivations and effects of China's changing attitudes toward foreign trade and interaction. (H, G, P, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E98","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"GS-4.2","text":"Explain the economic and cultural impact of European involvement on other continents during the era of European expansion. (H, G, P, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E99","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"GS-4.3","text":"Compare the key elements of the revolutions that took place on the European and American continents in the nineteenth century, including social and political motivations for these revolutions and the changes in social organization that emerged following them. (H, P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E9A","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"GS-4.4","text":"Explain the causes and effects of political, social, and economic transformation in Europe in the nineteenth century, including the significance of nationalism, the impact of industrialization for different countries, and the effects of democratization. (H, G, P, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E9B","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"GS-4.5","text":"Compare the political actions of European, Asian, and African nations in the era of imperial expansion, including the response of the Ottoman Empire to European commercial power, the motives and results of Russian expansion, the importance of British power in India, the collapse of Chinese government and society, the reasons for and the effects of Japan's transformation and expansion, and the resistance to imperialism. (H, G, P)"}]},{"leaf":false,"text":"Standard GS-5: The student will demonstrate an understanding of the effects of economic, geographic, and political interactions that took place throughout the world during the early twentieth century.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E9C","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"GS-5.1","text":"Summarize the causes of World War I, including political and economic rivalries, ethnic and ideological conflicts, and nationalism and propaganda. (H, G, P, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E9D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"GS-5.2","text":"Summarize the worldwide changes that took place following World War I, including the significance of the Russian Revolution; the rise of nationalist movements in India, Africa, and Southeast Asia; the revolutions and political change in China; and the creation of new states in Europe. (H, G, P, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E9E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"GS-5.3","text":"Explain the impact of the Great Depression and political responses in Germany, Britain, and the United States, including Nazism, Fascism, retrenchment, and the New Deal. (H, E, G, P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044E9F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"GS-5.4","text":"Explain the causes, key events, and outcomes of World War II, including the German, Italian, and Japanese drives for empire; the role of appeasement and isolationism in Europe and the United States; the major turning points of the War and the principal theaters of conflict; the importance of geographic factors during the War; and the political leaders during the time. (H, G, P, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044EA0","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"GS-5.5","text":"Compare the ideologies and global effects of totalitarianism, Communism, Fascism, Nazism, and democracy in the twentieth century, including Lenin's adaptation of Marxism in Russia, the rise of Fascism and Nazism in Europe, and militarism in Japan prior to World War II. (H, G, P, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044EA1","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"GS-5.6","text":"Exemplify the lasting impact of World War II, including the legacy of the Holocaust, the moral implications of military technologies and techniques such as the atomic bomb, the human costs of the war, and the establishment of democratic governments in European countries. (H, P)"}]},{"leaf":false,"text":"Standard GS-6: The student will demonstrate an understanding of the effects of economic, geographic, and political interactions that have taken place throughout the world from the period of the Cold War to the present day.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044EA2","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"GS-6.1","text":"Summarize the ideologies and global effects of Communism and democracy, including the effects of totalitarianism and Communism in China and the effects of Communism in Eastern Europe and Soviet Union. (P, H, E, G)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044EA3","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"GS-6.2","text":"Summarize the worldwide effects of the Cold War, including the competition for power between the United States and the Soviet Union, the changing relationships between the Soviet Union and China, the response by popular culture, and the collapse of the communist states. (H, G, P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044EA4","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"GS-6.3","text":"Compare the challenges and successes of the movements toward independence and democratic reform in various regions following World War II, including the role of political ideology, religion, and ethnicity in shaping governments and the course of independence and democratic movements in Africa, Asia, and Latin America. (H, G, P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044EA5","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"GS-6.4","text":"Summarize the impact of economic and political interdependence on the world, including efforts to control population growth, economic imbalance and social inequality and efforts to address them, the significance of the world economy for different nations, and the influence of terrorist movements on politics in various countries. (E, P, G, H)"}]}]},{"leaf":false,"text":"United States History and the Constitution","children":[{"leaf":false,"text":"Standard USHC-1: The student will demonstrate an understanding of the settlement of North America.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044EA6","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USHC-1.1","text":"Summarize the distinct characteristics of each colonial region in the settlement and development of America, including religious, social, political, and economic differences. (H, E, P, G)"}]},{"leaf":false,"text":"Standard USHC-2: The student will demonstrate an understanding of the establishment of the United States as a new nation.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044EA7","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USHC-2.1","text":"Summarize the early development of representative government and political rights in the American colonies, including the influence of the British political system, the rule of law and the conflict between the colonial legislatures and the royal governors. (P, H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044EA8","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USHC-2.2","text":"Explain the impact of the Declaration of Independence and the American Revolution on the American colonies and on the world at large. (H, P, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044EA9","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USHC-2.3","text":"Explain the development and effectiveness of the Articles of Confederation. (H, P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044EAA","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USHC-2.4","text":"Summarize the creation of a new national government, including the new state constitutions, the country's economic crisis, the Founding Fathers and their debates at the Constitutional Convention, the impact of the Federalist Papers, and the subsequent ratification of the Constitution. (H, P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044EAB","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USHC-2.5","text":"Analyze underlying political philosophies, the fundamental principles, and the purposes of the United States Constitution and the Bill of Rights, including the ideas behind the separation of powers and the system of checks and balances and the influence of the Magna Carta, the English Bill of Rights, and the colonial charters. (P, H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044EAC","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USHC-2.6","text":"Compare differing economic and political views in the conflict between Thomas Jefferson and Alexander Hamilton that led to the emergence of the American twoparty political system. (P, H, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044EAD","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USHC-2.7","text":"Summarize the origins and the evolution of the United States Supreme Court and the power it has today, including John Marshall's precedent-setting decisions such as that in Marbury v. Madison. (H, P)"}]},{"leaf":false,"text":"Standard USHC-3: The student will demonstrate an understanding of the westward movement and the resulting regional conflicts that took place in America in the nineteenth century.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044EAE","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USHC-3.1","text":"Explain the impact and challenges of westward movement, including the major land acquisitions, people's motivations for moving west, railroad construction, the displacement of Native Americans, and the its impact on the developing American character. (H, G, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044EAF","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USHC-3.2","text":"Explain how the Monroe Doctrine and the concept of manifest destiny affected United States' relationships with foreign powers, including the role of the Texas Revolution and the Mexican War. (H, E, P, G)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044EB0","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USHC-3.3","text":"Compare economic development in different regions of the country during the early nineteenth century, including agriculture in the South, industry and finance in the North, and the development of new resources in the West. (E, H, G)"}]},{"leaf":false,"text":"Standard USHC-4: The student will demonstrate an understanding of the causes and the course of the Civil War and Reconstruction in America.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044EB1","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USHC-4.1","text":"Compare the social and cultural characteristics of the North, the South, and the West during the antebellum period, including the lives of African Americans and social reform movements such as abolition and women's rights. (H, P, G)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044EB2","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USHC-4.2","text":"Explain how the political events and issues that divided the nation led to civil war, including the compromises reached to maintain the balance of free and slave states, the successes and failures of the abolitionist movement, the conflicting views on states' rights and federal authority, the emergence of the Republican Party and its win in 1860, and the formation of the Confederate States of America. (H, P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044EB3","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USHC-4.3","text":"Outline the course and outcome of the Civil War, including the role of African American military units; the impact of the Emancipation Proclamation; and the geographic, political, and economic factors involved in the defeat of the Confederacy. (H, G, E, P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044EB4","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USHC-4.4","text":"Summarize the effects of Reconstruction on the southern states and the roles of the Thirteenth, Fourteenth, and Fifteenth Amendments in that era. (H, P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044EB5","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USHC-4.5","text":"Summarize the progress made by African Americans during Reconstruction and the subsequent reversals brought by Reconstruction's end, including the creation of the Freedmen's Bureau, gains in educational and political opportunity, and the rise of anti–African American factions and legislation. (H, E, G, P)"}]},{"leaf":false,"text":"Standard USHC-5: The student will demonstrate an understanding of major social, political, and economic developments that took place in the United States during the second half of the nineteenth century.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044EB6","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USHC-5.1","text":"Summarize developments in business and industry, including the ascent of new industries, the rise of corporations through monopolies and corporate mergers, the role of industrial leaders such as John D. Rockefeller and Andrew Carnegie, the influence of business ideologies, and the increasing availability of consumer goods and the rising standard of living. (E, H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044EB7","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USHC-5.2","text":"Summarize the factors that influenced the economic growth of the United States and its emergence as an industrial power, including the abundance of natural resources; government support and protection in the form of tariffs, labor policies, and subsidies; and the expansion of international markets associated with industrialization. (E, G, H, P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044EB8","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USHC-5.3","text":"Explain the transformation of America from an agrarian to an industrial economy, including the effects of mechanized farming, the role of American farmers in facing economic problems, and the rise of the Populist movement. (H, E, P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044EB9","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USHC-5.4","text":"Analyze the rise of the labor movement, including the composition of the workforce of the country in terms of gender, race/ethnicity, and skills; working conditions for men, women, and children; and union protests and strikes and the government's reactions to these forms of unrest. (H, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044EBA","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USHC-5.5","text":"Explain the causes and effects of urbanization in late nineteenth-century America, including the movement from farm to city, the continuation of the women's suffrage movement, and the migration of African Americans to the North and the Midwest. (H, G, E, P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044EBB","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USHC-5.6","text":"Explain the influx of immigrants into the United States in the late nineteenth century in relation to the specific economic, political, and social changes that resulted, including the growth of cities and urban ethnic neighborhoods, the restrictions on immigration that were imposed, and the immigrants' responses to the urban political machines. (H, G, P, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044EBC","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USHC-5.7","text":"Compare the accomplishments and limitations of the progressive movement in effecting social and political reforms in America, including the roles of Theodore Roosevelt, Jane Addams, W. E. B. DuBois, and Booker T. Washington. (H, P, E)"}]},{"leaf":false,"text":"Standard USHC-6: The student will demonstrate an understanding of foreign developments that contributed to the United States' emergence as a world power in the twentieth century.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044EBD","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USHC-6.1","text":"Analyze the development of American expansionism, including the change from isolationism to intervention, the rationales for imperialism based on Social Darwinism and expanding capitalism, and domestic tensions. (H, G, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044EBE","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USHC-6.2","text":"Explain the influence of the Spanish-American War on the emergence of the United States as a world power, including reasons for America's declaring war on Spain, United States interests and expansion in the South Pacific, debates between proand anti-imperialists over annexation of the Philippines, and changing worldwide perceptions of the United States. (H, G, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044EBF","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USHC-6.3","text":"Compare United States foreign policies in different regions of the world during the early twentieth century, including the purposes and effects of the Open Door policy with China, the United States role in the Panama Revolution, Theodore Roosevelt's \"big stick diplomacy,\" William Taft's \"dollar diplomacy,\" and Woodrow Wilson's \"moral diplomacy.\" (H, G, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044EC0","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USHC-6.4","text":"Outline the causes and course of World War I, focusing on the involvement of the United States, including the effects of nationalism, ethnic and ideological conflicts, and Woodrow Wilson's leadership in the Treaty of Versailles and the League of Nations. (H, P)"}]},{"leaf":false,"text":"Standard USHC-7: The student will demonstrate an understanding of the economic boom-and-bust in America in the 1920s and 1930s, its resultant political instability, and the subsequent worldwide response.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044EC1","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USHC-7.1","text":"Explain the social, cultural, and economic effects of scientific innovation and consumer financing options in the 1920s on the United States and the world, including the advent of aviation, the expansion of mass production techniques, the invention of new home appliances, and the role of transportation in changing urban life. (H, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044EC2","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USHC-7.2","text":"Explain cultural responses to the period of economic boom-and-bust, including the Harlem Renaissance; new trends in literature, music, and art; and the effects of radio and movies. (H, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044EC3","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USHC-7.3","text":"Explain the causes and effects of the social conflict and change that took place during the 1920s, including the role of women and their attainment of the right to vote, the \"Red Scare\" and the Sacco and Vanzetti case, the resurgence of the Ku Klux Klan, immigration quotas, Prohibition, and the Scopes trial. (H, P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044EC4","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USHC-7.4","text":"Explain the causes and effects of the stock market crash of 1929 and the Great Depression, including the disparity in incomes, limited government regulation, stock market speculation, and the collapse of the farm economy; wealth distribution, investment, and taxes; government policies and the Federal Reserve System; and the effects of the Depression on human beings and the environment. (H, E, G, P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044EC5","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USHC-7.5","text":"Compare the first and second New Deals as responses to the economic bust of the Great Depression, including the rights of women and minorities in the workplace and the successes, controversies, and failures of recovery and reform measures such as the labor movement. (H, P, E)"}]},{"leaf":false,"text":"Standard USHC-8: The student will demonstrate an understanding of the impact of World War II on United States' foreign and domestic policies.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044EC6","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USHC-8.1","text":"Analyze the United States' decision to enter World War II, including the rise and aggression of totalitarian regimes in Italy under Benito Mussolini, in Germany under Adolf Hitler, and in Japan under Hideki Tojo; the United States' movement from a policy of isolationism to international involvement; and the Japanese attack on Pearl Harbor. (H, P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044EC7","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USHC-8.2","text":"Summarize and illustrate on a time line the major events and leaders of World War II, including the Battle of the Bulge and the major battles at Midway, Normandy, Iwo Jima, and Okinawa; the turning points of the war for the Allies; the dropping of atomic bombs on Hiroshima and Nagasaki; and the roles of Franklin D. Roosevelt, Winston Churchill, Joseph Stalin, and Charles de Gaulle. (H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044EC8","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USHC-8.3","text":"Summarize the impact of World War II and war mobilization on the home front, including war bond drives, rationing, the role of women and minorities in the workforce, and racial and ethnic tensions such as those caused by the internment of Japanese Americans. (H, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044EC9","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USHC-8.4","text":"Summarize the responses of the United States and the Allies to war crimes, including the Holocaust and war crimes trials. (H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044ECA","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USHC-8.5","text":"Explain the lasting impact of the scientific and technological developments in America after World War II, including new systems for scientific research, medical advances, improvements in agricultural technology, and resultant changes in the standard of living and demographic patterns. (H, G, E)"}]},{"leaf":false,"text":"Standard USHC-9: The student will demonstrate an understanding of the social, economic, and political events that impacted the United States during the Cold War era.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044ECB","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USHC-9.1","text":"Explain the causes and effects of social and cultural changes in postwar America, including educational programs, expanding suburbanization, the emergence of the consumer culture, the secularization of society and the reemergence of religious conservatism, and the roles of women in American society. (H, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044ECC","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USHC-9.2","text":"Summarize the origins and course of the Cold War, including the containment policy; the conflicts in Korea, Africa, and the Middle East; the Berlin Airlift and the Berlin Wall; the Bay of Pigs and Cuban missile crisis; the nuclear arms race; the effects of the \"Red Scare\" and McCarthyism; and the role of military alliances. (H, G, P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044ECD","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USHC-9.3","text":"Summarize the key events and effects of the Vietnam War, including the Gulf of Tonkin Resolution and the Tet offensive; the protests and opposition to the war; and the policies of presidents John Kennedy, Lyndon Johnson, and Richard Nixon. (H, P, G)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044ECE","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USHC-9.4","text":"Compare the domestic and foreign policies of the period—including Kennedy's New Frontier, Johnson's Great Society, and Nixon's establishment of environmental protection and rapprochement with China—as well as relations with the Soviet Union and the continuing crises in the Middle East under all administrations from Harry Truman to Jimmy Carter. (H, G, P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044ECF","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USHC-9.5","text":"Explain the movements for racial and gender equity and civil liberties, including their initial strategies, landmark court cases and legislation, the roles of key civil rights advocates, and the influence of the civil rights movement on other groups seeking ethnic and gender equity. (H, P)"}]},{"leaf":false,"text":"Standard USHC-10: The student will demonstrate an understanding of developments in foreign policy and economics that have taken place in the United States since the fall of the Soviet Union and its satellite states in 1992.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044ED0","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USHC-10.1","text":"Summarize key events in United States foreign policy from the end of the Reagan administration to the present, including changes to Middle East policy, the impact of United States involvement in the Persian Gulf, and the rise of global terrorism. (P, H, G)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044ED1","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USHC-10.2","text":"Summarize key economic issues in the United States since the fall of communist states, including recession, the national debt and deficits, legislation affecting organized labor and labor unions, immigration, and increases in economic disparity. (E, H, P)"}]}]},{"leaf":false,"text":"Economics","children":[{"leaf":false,"text":"Standard ECON-1: The student will demonstrate an understanding of how scarcity and choice impact the economic activity of individuals, families, communities, and nations.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044ED2","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"ECON-1.1","text":"Illustrate the relationship between scarcity—limited resources and unlimited human wants—and the economic choices made by individuals, families, communities, and nations, including how families must budget their income and expenses, how people use psychological and intellectual resources to deal with scarcity, and how local political entities as well as nation-states use scarce resources to satisfy human wants. (E, G)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044ED3","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"ECON-1.2","text":"Explain the concept of opportunity costs and how individuals, families, communities, and nations make economic decisions on that basis, including analyzing marginal costs and marginal benefits and assessing how their choices may result in trade-offs. (E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044ED4","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"ECON-1.3","text":"Compare the four key factors of production—land, labor, capital, and entrepreneurship—and explain how they are used, including the specialization and division of labor that permits efficient use of scarce resources. (E, G)"}]},{"leaf":false,"text":"Standard ECON-2: The student will demonstrate an understanding of markets and the role of supply and demand in determining price and resource allocation.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044ED5","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"ECON-2.1","text":"Explain the law of supply and demand, including the relationships of critical determinants (e.g., consumer income, tastes, and preferences; technology; the price of inputs) and the effects of change on equilibrium, price, and quantity. (E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044ED6","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"ECON-2.2","text":"Explain the nature and role of competition in a market economy, including the determination of market price through competition among buyers and sellers and the conditions that make industries more or less competitive, such as the effect of domestic and international competition and the quality, quantity, and price of products. (E, G)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044ED7","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"ECON-2.3","text":"Explain economic incentives that lead to the efficient use of resources, including monetary and nonmonetary incentives, the ways in which people change their behavior in response to incentives, the relationship of incentives to the laws of supply and demand, and the role of private property as an incentive in conserving and improving scarce resources. (E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044ED8","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"ECON-2.4","text":"Explain the effect of shortages and surpluses in a market economy, including the effect of price controls (ceilings and floors) in causing shortages or surpluses, changes in the price of products as a result of surplus or shortage, and market mechanisms for eliminating shortages and surpluses and achieving market equilibrium. (E)"}]},{"leaf":false,"text":"Standard ECON-3: The student will demonstrate an understanding of the sources of income and growth in a free-enterprise economy.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044EDB","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"ECON-3.1","text":"Compare personal income distribution and functional income distribution, including how distribution of income affects public policy. (E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044EDC","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"ECON-3.2","text":"Explain the role of entrepreneurs in a market economy, including the costs and benefits of being an entrepreneur, the expectation of profit as the incentive for entrepreneurs to accept business risks, and the effect of changes in taxation and government regulation on entrepreneurial decisions. (E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044EDE","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"ECON-3.3","text":"Explain the causes and effects of economic growth, including the relationship between investment in human resources and in real capital, the alleviation of poverty, the increase in standards of living, and the creation of new employment opportunities. (E)"}]},{"leaf":false,"text":"Standard ECON-4: The student will demonstrate an understanding of personal economic decision making to maximize the net benefits of personal income.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044EE1","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"ECON-4.1","text":"Summarize types of personal economic decisions and choices that individuals make, including determining how to budget money; establishing short- and longterm financial goals and plans related to income, saving, and spending; utilizing loans and credit cards; and considering investment options. (E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044EE3","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"ECON-4.2","text":"Explain influences on personal economic decision making and choices, including the effect of education, career choices, and family obligations on future income; the influence of advertising on consumer choices; the risks and benefits involved in short- and long-term saving and investment strategies; and the effect of taxation and interest rates on household consumption and savings. (E)"}]},{"leaf":false,"text":"Standard ECON-5: The student will demonstrate an understanding of the various economic institutions of a market economy.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044EE6","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"ECON-5.1","text":"Compare the significant characteristics of a market economy with those of traditional and command economies, including differences in the roles of the government, individual firms, and households in decision making; types of economic institutions; the extent of consumer sovereignty/choice; and the role of private property rights, competition, and the profit motive. (E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044EE8","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"ECON-5.2","text":"Analyze the roles of and relationships among economic institutions in a market economy, including the banking system and its interaction with business firms and consumers, the economic circular flow model, the function of financial and securities markets, and the impact of labor unions on the American economy. (E)"}]},{"leaf":false,"text":"Standard ECON-6: The student will demonstrate an understanding of the roles that federal, state, and local governments play in the operation of markets in the United States.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044EEA","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"ECON-6.1","text":"Compare the various functions and roles of the government in the United States economy, including providing public goods, defining and enforcing property rights, correcting externalities and regulating markets, maintaining and promoting competition in the market, protecting consumers' rights, and redistributing income. (E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044EEB","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"ECON-6.2","text":"Summarize major sources of government revenue, including taxation at the federal, state, and local levels and tax revenues from personal income and payroll taxes, sales taxes, and property taxes. (E)"}]},{"leaf":false,"text":"Standard ECON-7: The student will demonstrate an understanding of the national economy and economic policies in the United States.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044EEE","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"ECON-7.1","text":"Compare measures of economic health, including the gross domestic product, consumer price indexes, personal income, disposable income, rates of inflation and deflation, and unemployment rates. (E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044EEF","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"ECON-7.2","text":"Explain the role of the money supply in a free-market economy, including various forms of the money supply in the United States and the effect of the banking system on the money supply. (E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044EF2","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"ECON-7.3","text":"Explain the purposes and effects of fiscal and monetary policies, including the structure and function of the Federal Reserve System and policies on unemployment, inflation, and economic growth. (E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044EF3","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"ECON-7.4","text":"Explain the types of goods and services that are funded with government revenues, including national defense, road construction and repair, public safety, health care, payments on the national debt, and education. (E, P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044EF5","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"ECON-7.5","text":"Contrast the costs and benefits of the American government's economic policies, including how policies designed to reduce unemployment may increase inflation and vice versa and how investment in factories, machinery, new technology, health education, and occupational training can raise standards of living. (E)"}]},{"leaf":false,"text":"Standard ECON-8: The student will demonstrate an understanding of the principles of trade and economic development.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044EF8","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"ECON-8.1","text":"Explain the basic principles of international trade, including the worldwide distribution of resources, the concept of absolute and comparative advantages that leads to specialization and trade, and the concepts of balance of trade and balance of payments that are used to measure international trade. (E, G)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044EF9","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"ECON-8.2","text":"Summarize the outcomes of global trade, including gains made by individuals and nations through trade, increases in consumer choice and standard of living, and gains in production efficiency. (E, G)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044EFB","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"ECON-8.3","text":"Compare the effects of unrestricted and restricted trade—including those of tariffs and quotas—on the economic and social interests of a nation-state. (E, G)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044EFD","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"ECON-8.4","text":"Explain the basic concept of the foreign exchange market, including the operation of exchange rates and the effects of the dollar's gaining or losing value relative to other currencies. (E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044EFE","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"ECON-8.5","text":"Summarize global patterns of economic activity—including world trade partners, the geographic features of trade, and international political borders—and explain the impact of developing nations on the global economy. (E, G, P)"}]}]},{"leaf":false,"text":"United States Government","children":[{"leaf":false,"text":"Standard USG-1: The student will demonstrate an understanding of the United States government—its origins and its functions.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044F02","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USG-1.1","text":"Summarize arguments for the necessity and purpose of government and politics, including the idea that politics enables a group of people with diverse opinions and interests to reach collective decisions, the idea that government gives people the security they need in order to reach their full potential, and the idea that the purposes of government include enhancing economic prosperity and providing for national security. (P, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044F04","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USG-1.2","text":"Summarize differing ideas about the purposes and functions of law, including the \"rule of law\" and the \"rule of man\" and the idea that the \"rule of law\" protects not only individual rights but also the common good and summarize the sources of laws, including nature, social customs, legislatures, religious leaders, and monarchs. (P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044F06","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USG-1.3","text":"Compare the characteristics of a limited and an unlimited government, including the idea that a civil society maintains a limited government: how a civil society provides the opportunity for individuals to associate for different purposes, how a civil society allows people to influence the government by means other than voting, how political and economic freedoms can limit government power, and how the government of a civil society differs from the governments in authoritarian and totalitarian regimes. (P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044F08","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USG-1.4","text":"Compare the characteristics and the advantages and disadvantages of confederal, federal, and unitary systems, including how power is distributed, shared, and limited in these systems. (P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044F0A","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USG-1.5","text":"Compare the advantages and disadvantages of the ways in which power is distributed, shared, and limited to serve the purposes of constitutional government, including the criteria of effectiveness, the prevention of the abuse of power, and responsiveness to popular will. (P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044F0C","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USG-1.6","text":"Analyze alternative forms of representation and the extent to which they serve the purposes of constitutional government, including arguments for and against representative government as distinguished from direct popular rule, common bases upon which representation has been established, different electoral systems, and differing theories of representation. (P)"}]},{"leaf":false,"text":"Standard USG-2: The student will demonstrate an understanding of the foundations of the American republic—its basic democratic principles and its political systems.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044F0D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USG-2.1","text":"Summarize the basic principles of American democracy including popular sovereignty, the rule of law, the balance of power, the separation of powers, limited government, federalism, and representative government as expressed in the Declaration of Independence, the Federalist Papers, the Constitution, and the Bill of Rights. (P, H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044F0E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USG-2.2","text":"Explain philosophical influences on the development of American government, including the philosophy and practices of the Greeks and the Romans; the ideals of the Judeo-Christian tradition; and the ideas of such European thinkers as John Locke, Charles de Montesquieu, Thomas Hobbes, Niccolò Machiavelli, and Jean-Jacques Rousseau. (P, H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044F0F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USG-2.3","text":"Compare fundamental values, principles, and rights that are in conflict with one another in the American political system and the ways in which such conflicts are typically resolved, including conflicts that arise from diversity, conflicts between individual rights and social stability, and conflicts between liberty and equality. (P, H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044F11","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USG-2.4","text":"Summarize the significant ideals of the American republic, the discrepancy between those ideals and the realities of American society, and ways that such discrepancies might be reduced through social and political action. (P, H)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044F12","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USG-2.5","text":"Explain factors that have shaped the distinctive characteristics of American society, including the belief in limited government, religious freedom, diversity of the population, and relative social equality. (P)"}]},{"leaf":false,"text":"Standard USG-3: The student will demonstrate an understanding of the continuing role of the United States Constitution in the defining and shaping of American government and society.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044F13","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USG-3.1","text":"Contrast the distribution of powers and responsibilities within the federal system, including the purpose, organization, and enumerated powers of the three branches; the workings of the Supreme Court; and the operation of the law-making process. (P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044F14","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USG-3.2","text":"Explain the organization and responsibilities of local and state governments, including the purposes and functions of state constitutions; reserved and concurrent powers in the states; the relationships among national, state, and local levels of government; and the structure and operation of South Carolina's government. (P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044F15","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USG-3.3","text":"Summarize the function of law in the American constitutional system, including the significance of the concept of the due process of law and the ways in which laws are intended to achieve fairness, the protection of individual rights, and the promotion of the common good. (P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044F16","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USG-3.4","text":"Summarize the process through which public policy is formed in the United States, including setting a public agenda and the role of political institutions, political parties, and special interest groups. (P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044F17","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USG-3.5","text":"Summarize features of the election process in the United States, including the roles of the political parties, the nomination process, the Electoral College, and the campaigns; the issues of campaign funding; and trends in voter turnout and citizen participation. (P, H)"}]},{"leaf":false,"text":"Standard USG-4: The student will demonstrate an understanding of the United States' relations with other nation-states and its role in world affairs.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044F18","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USG-4.1","text":"Summarize ways in which United States foreign policy is formulated and carried out, including current foreign policy issues and security interests; the impact of foreign policy on individual citizens; the influence and exchange of political ideas between nations; and America's contributions to the world in politics, environmentalism, technology, science, humanitarianism, and culture. (P, E, G)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044F19","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USG-4.2","text":"Compare the roles of international organizations in world affairs, including the United Nations, the North Atlantic Treaty Organization (NATO), and the World Health Organization. (P, G)"}]},{"leaf":false,"text":"Standard USG-5: The student will demonstrate an understanding of the concept of personal and civic rights and responsibilities and the role of the citizen in American democracy.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044F1A","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USG-5.1","text":"Classify the rights of United States citizens as personal, political, or economic and identify the significance and source of such rights and the conflicts that can arise when these rights are limited. (P, E)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044F1B","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USG-5.2","text":"Summarize commonly held personal and civic responsibilities and their significance in maintaining a democracy, including voting, serving as a juror, obeying the law, paying taxes, and serving in the military. (P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044F1C","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USG-5.3","text":"Explain ways in which Americans can monitor and participate in politics and government, including engaging in political leadership or public service, analyzing and becoming informed about public issues and policy making, joining political parties and interest groups, voting, and volunteering in the community. (P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044F1D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USG-5.4","text":"Explain the process of naturalization in the United States, including naturalization laws and the criteria of length of residency, English language literacy, proof of character, knowledge of United States history, and support for the values and principles of American constitutional government. (P)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1044F1E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"USG-5.5","text":"Summarize character traits that are important to the preservation and improvement of American democracy, including dispositions that encourage citizens to act as independent members of society, that foster respect for individual worth and human dignity, and that engage the citizen in public affairs. (P)"}]}]}]