[{"leaf":false,"text":"Number Sense and Operation Mathematics Content Standard 1","children":[{"leaf":false,"text":"A student, applying reasoning and problem solving, will use number sense and operations to represent numbers in multiple ways, understand relationships among numbers and number systems, make reasonable estimates, and compute fluently within a variety of relevant cultural contexts, including those of Montana American Indians.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F1A0","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"},{"prefLabel":"4"}],"text":"1.1 Whole Number Relationships: Demonstrate relationships among whole numbers; identify place value up to 100,000 and compare numbers (e.g., greater than, less than, and equal to)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F1A1","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"},{"prefLabel":"4"}],"text":"1.2 Estimation and Operations: Estimate sums, differences, products, and quotients when solving problems. Add, subtract, multiply (three-digit by two-digit factors), and divide (two-digit dividends by one-digit divisors) to solve problems. Demonstrate fluency with basic facts."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F1A2","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"},{"prefLabel":"4"}],"text":"1.3 Whole Number Concepts: Develop multiplication and division concepts, apply number and operation models and strategies, and reason and justify using properties of operations."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F1A3","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"},{"prefLabel":"4"}],"text":"1.4 Common Fractions and Decimals: Identify and model common fractions such as, tenths, fourths, thirds, and halves; and decimals such as money and place value to 0.001; and recognize and compare equivalent representations."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F1A4","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"},{"prefLabel":"4"}],"text":"1.5 Length, Time, and Temperature: Select and apply appropriate standard units and tools to measure length, time, and temperature within relevant scientific and cultural situations, including those of Montana American Indians."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F1A5","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"1.1 Rational Number Relationships: Recognize, model, and compare different forms of integers and rational numbers including percents, fractions, decimals, and numbers using exponents and scientific notation."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F1A6","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"1.2 Estimation and Reasonableness: Select and apply appropriate estimation strategies to judge the reasonableness of solutions to problems including those computed on a calculator. Demonstrate correct use of order of operations."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F1A7","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"1.3 Number Theory: Use number theory concepts such as prime factorization, greatest common factor, and least common multiple in problem situations."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F1A8","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"1.4 Rational Number Operations: Compute fluently and solve multi-step problems using integers, fractions, decimals, and numbers in exponential form."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F1A9","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"1.5 Metric and Standard Measurement: Use metric and standard units of measurement in relevant scientific and cultural situations, including those of Montana American Indians, compare and convert within systems, and use appropriate technology."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F1AA","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"1.6 Proportional Reasoning: Understand and apply proportional relationships to model real world situations and to solve problems involving rates, ratios, proportions, percents, and direct variation."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F1AB","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1.1 Quantification: Use multiple notations to perform and interpret the effects of operations on very large and very small numbers with and without technology."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F1AC","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1.2 Estimation and Accuracy: Identify situations where estimation is appropriate and determine the degree of accuracy needed for a given problem situation (and the appropriate precision in which to report answers)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F1AD","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1.3 Equivalence with Multiple Notation: Given a representation of a number or expression, find equivalent representations using multiple notations (e.g., x<sup>1/2</sup> vs. √x and visual representation of multiplying binomials)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F1AE","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1.4 Properties of Numbers and Number Systems: Analyze and apply the properties of numbers and number systems."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F1AF","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1.5 Modeling Relationships and Change: Identify givens and unknowns in familiar and unfamiliar situations (e.g., finance, culture, including Montana American Indians, and nature) and describe relationships between variables."}]}]},{"leaf":false,"text":"Data Analysis Mathematics Content Standard 2","children":[{"leaf":false,"text":"A student, applying reasoning and problem solving, will use data representation and analysis, simulations, probability, statistics, and statistical methods to evaluate information and make informed decisions within a variety of relevant cultural contexts, including those of Montana American Indians.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F1B0","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"},{"prefLabel":"4"}],"text":"2.1 Representing Data: Collect, represent, and organize data in tables, dot plots, bar graphs, pictographs, and stem and leaf plots using technology when appropriate."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F1B1","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"},{"prefLabel":"4"}],"text":"2.2 Evaluating Data: Solve problems and make decisions using data descriptors such as minimum, maximum, median, and mode within scientific and cultural contexts, including those of Montana American Indians."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F1B2","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"},{"prefLabel":"4"}],"text":"2.3 Likelihood of Events: Describe events from multicultural contexts, including those of Montana American Indians, as likely or unlikely and discuss the degree of likelihood using words such as certain, equally likely, and impossible."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F1B3","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"2.1 Representing and Comparing Data: Collect data from a variety of contexts (e.g., science, history, and culture, including Montana American Indians). Organize and represent data in box plots, scatter plots, histograms, and circle graphs using technology when appropriate."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F1B4","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"2.2 Evaluating Data and Making Conjectures: Interpret, analyze, and evaluate data using mean, median, range, and quartiles to identify trends and make decisions and predictions about data within scientific and cultural contexts, including those of Montana American Indians."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F1B5","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"2.3 Finding Probability and Predicting: Create sample spaces and simulations from events found in different cultures, including those of Montana American Indians, determine experimental and theoretical probabilities, and use probability to make predictions."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F1B6","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2.1 Representing and Analyzing Data: Select, create, and compare graphical or numerical representations of data sets using technology when appropriate. Reason about distributions using measures of central tendency and spread (e.g., percentiles, quartiles, inter-quartile range, and standard deviation)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F1B7","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2.2 Evaluating Validity: Evaluate the validity of reports based on collected and/or published data by considering the source of the data, the design of the study, and the way data are displayed, analyzed, and interpreted."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F1B8","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2.3 Rules of Probability and Expected Value: Make, evaluate, and justify decisions based on probabilities in multicultural situations, including those of Montana American Indians (e.g., finding expected value and using rules of probability)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F1B9","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2.4 Counting Methods: Use technology as needed to determine the possible number of outcomes for an event or compound event using the fundamental counting principle, permutations, combinations, and other systematic counting methods."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F1BA","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2.5 Curve Fitting: Model two-variable data using curve fitting with and without technology. Write an equation for a given model and decide when or if predictions based on this equation are valid."}]}]},{"leaf":false,"text":"Geometric Reasoning Mathematics Content Standard 3","children":[{"leaf":false,"text":"A student, applying reasoning and problem solving, will understand geometric properties, spatial relationships, and transformation of shapes, and will use spatial reasoning and geometric models to analyze mathematical situations within a variety of relevant cultural contexts, including those of Montana American Indians.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F1BB","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"},{"prefLabel":"4"}],"text":"3.1 Two-Dimensional Attributes: Describe, compare, and analyze attributes of two-dimensional shapes."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F1BC","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"},{"prefLabel":"4"}],"text":"3.2 Three-Dimensional Attributes: Describe attributes of three-dimensional shapes such as cubes and other rectangular prisms, pyramids, cylinders, cones, and spheres."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F1BD","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"},{"prefLabel":"4"}],"text":"3.3 Basic Transformations: Use spatial reasoning to identify slides and flips of congruent figures within artistic and cultural contexts, including those of Montana American Indians."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F1BE","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"},{"prefLabel":"4"}],"text":"3.4 Linear Measurement: Estimate and measure linear attributes of objects in metric units such as centimeters and meters and customary units such as inch, foot, and yard."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F1BF","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"},{"prefLabel":"4"}],"text":"3.5 Area and Perimeter: Define and determine area and perimeter of common polygons using concrete tools such as grid paper, objects, or technology and justify the strategy used."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F1C0","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"3.1 Properties of Solids and Figures: Define, classify and compare properties of solids and plane figures, including lines and angles."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F1C1","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"3.2 Congruence and Similarity: Use spatial reasoning to determine congruence, similarity, and symmetry of objects in mathematics, art, science, and culture, including Montana American Indians."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F1C2","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"3.3 Transformations including Dilations: Define, identify, and execute transformations including translations, rotations, reflections, and dilations with appropriate technology."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F1C3","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"3.4 Angles, Surface Area, and Volume: Measure and compute angles, perimeter, area, surface area, and volume including the use of formulas and choosing appropriate units."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F1C4","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"3.5 Justifying Relationships: Develop informal arguments to verify geometric relationships and solve problems such as an informal justification of the Pythagorean Theorem in a variety of contexts."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F1C5","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3.1 Conjectures and Inductive Reasoning:, Formulate and evaluate conjectures about geometric objects and their properties, with and without technology, applying inductive reasoning when appropriate."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F1C6","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3.2 Applications of Geometric Models: Use spatial reasoning and geometric models to solve problems with and without technology in the contexts of art, science, and culture, including Montana American Indians."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F1C7","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3.3 Multiple Geometric Approaches: Identify, analyze, and use transformational, coordinate, and synthetic geometric approaches to solve problems."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F1C8","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3.4 Indirect Measurement: Determine measures of two- and three-dimensional objects and their elements using trigonometric ratios, proportionality, the Pythagorean Theorem, and angle relationships."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F1C9","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3.5 Methods of Proof: Establish the validity of geometric conjectures using deductive reasoning, indirect proof, and counterexamples, and critique arguments made by others."}]}]},{"leaf":false,"text":"Algebraic and Functional Reasoning Mathematics Content Standard 4","children":[{"leaf":false,"text":"A student, applying reasoning and problem solving, will use algebraic concepts and procedures to understand processes involving number, operation, and variables and will use procedures and function concepts to model the quantitative and functional relationships that describe change within a variety of relevant cultural contexts, including those of Montana American Indians.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F1CA","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"},{"prefLabel":"4"}],"text":"4.1 Patterns and Relations: Describe, extend, and make generalizations about geometric or numeric patterns."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F1CB","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"},{"prefLabel":"4"}],"text":"4.2 Symbols and Expressions: Use letters, boxes, or symbols to represent numbers in simple expressions or equations to demonstrate a basic understanding of variables."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F1CC","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"},{"prefLabel":"4"}],"text":"4.3 Properties of Number and Operation: Use number patterns to investigate properties of numbers such as even or odd and properties of operations such as commutative, associative, distributive, and the multiplicative and additive identities."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F1CD","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"},{"prefLabel":"4"}],"text":"4.4 Equivalent Expressions: Develop an understanding of equivalence by expressing numbers, measures, and numerical expressions involving operations in a variety of ways."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F1CE","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"},{"prefLabel":"4"}],"text":"4.5 Numerical Modeling with Manipulatives: Model problem situations with manipulatives or technology and use multiple representations such as words, pictures, tables, or graphs to draw conclusions using cultural contexts, including those of Montana American Indians."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F1CF","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"4.1 Representing and Generalizing Patterns: Create and use tables, graphs or diagrams, symbolic expressions, and verbal descriptions to represent, analyze, and generalize a variety of patterns involving numbers and operations."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F1D0","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"4.2 Linear Functions: Identify linear and non-linear functional relationships and contrast their properties using tables, graphs, or equations with appropriate technology."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F1D1","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"4.3 Multi-step equations and inequalities: Use number properties and inverse operations to solve multi-step equations and inequalities involving a single variable."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F1D2","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"4.4 Equivalent Algebraic Expressions: Recognize, simplify, and generate equivalent forms of algebraic expressions, justifying each step with properties of operations."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F1D3","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"4.5 Linear Modeling: Identify and compute rate of change/slope and intercepts from equations, graphs, and tables; model and solve contextual problems involving linear proportions or direct variation using cultural contexts, including those of Montana American Indians."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F1D4","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4.1 Representing Functions: Represent functions in a variety of ways including tables, graphs or diagrams, verbal descriptions, and symbolic expressions in recursive and explicit form. Justify the choice of an appropriate form for solving a given problem."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F1D5","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4.2 Variables and Parameters: Determine the appropriate symbolic representation of a given contextual situation (e.g., variables and parameters in equations, inequalities, functions, and matrices)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F1D6","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4.3 Solving Systems of Equations and Inequalities: Solve a variety of equations, inequalities and systems of equations and inequalities, justify the solution process, and interpret the solution in context."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F1D7","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4.4 Families of Functions and Transformations: Analyze the effects of transformations on families of functions and recognize their characteristics. Represent and use functions in equivalent forms to identify and perform transformations."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F1D8","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4.5 Analyzing and Conjecturing with Models: Given data or a problem situation, select and use an appropriate function model to analyze results or make a prediction with and without technology using cultural contexts, including those of Montana American Indians."}]}]}]