[{"leaf":false,"text":"Subchapter A. Elementary","children":[{"leaf":false,"text":"(1)  Scientific investigation and reasoning. The student conducts classroom and outdoor investigations following home and school safety procedures and uses environmentally appropriate and responsible practices. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEA9","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"(A)  identify and demonstrate safe practices as described in the Texas Safety Standards during classroom and outdoor investigations, including wearing safety goggles, washing hands, and using materials appropriately;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEAA","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"(B)  discuss the importance of safe practices to keep self and others safe and healthy; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEAB","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"(C)  demonstrate how to use, conserve, and dispose of natural resources and materials such as conserving water and reusing or recycling paper, plastic, and metal."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEC8","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"(A)  recognize and demonstrate safe practices as described in the Texas Safety Standards during classroom and outdoor investigations, including wearing safety goggles, washing hands, and using materials appropriately;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEC9","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"(B)  recognize the importance of safe practices to keep self and others safe and healthy; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EECA","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"(C)  identify and learn how to use natural resources and materials, including conservation and reuse or recycling of paper, plastic, and metals."}]},{"leaf":false,"text":"(2)  Scientific investigation and reasoning. The student develops abilities to ask questions and seek answers in classroom and outdoor investigations. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEAC","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"}],"text":"(A)  ask questions about organisms, objects, and events observed in the natural world;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEAD","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"}],"text":"(B)  plan and conduct simple descriptive investigations such as ways objects move;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEAE","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"}],"text":"(C)  collect data and make observations using simple equipment such as hand lenses, primary balances, and non-standard measurement tools;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEAF","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"(D)  record and organize data and observations using pictures, numbers, and words; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEB0","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"(E)  communicate observations with others about simple descriptive investigations."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EECB","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"(D)  record and organize data using pictures, numbers, and words; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EECC","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"(E)  communicate observations and provide reasons for explanations using student-generated data from simple descriptive investigations."}]},{"leaf":false,"text":"(3)  Scientific investigation and reasoning. The student knows that information and critical thinking are used in scientific problem solving. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEB1","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"(A)  identify and explain a problem such as the impact of littering on the playground and propose a solution in his/her own words;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEB2","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"(B)  make predictions based on observable patterns in nature such as the shapes of leaves; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEB3","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"(C)  explore that scientists investigate different things in the natural world and use tools to help in their investigations."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EECD","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"(A)  identify and explain a problem such as finding a home for a classroom pet and propose a solution in his/her own words;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EECE","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"(B)  make predictions based on observable patterns; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EECF","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"(C)  describe what scientists do."}]},{"leaf":false,"text":"(4)  Scientific investigation and reasoning. The student uses age-appropriate tools and models to investigate the natural world. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEB4","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"(A)  collect information using tools, including computers, hand lenses, primary balances, cups, bowls, magnets, collecting nets, and notebooks; timing devices, including clocks and timers; non-standard measuring items such as paper clips and clothespins; weather instruments such as demonstration thermometers and wind socks; and materials to support observations of habitats of organisms such as terrariums and aquariums; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEB5","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"(B)  use senses as a tool of observation to identify properties and patterns of organisms, objects, and events in the environment"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EED0","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"(A)  collect, record, and compare information using tools, including computers, hand lenses, primary balances, cups, bowls, magnets, collecting nets, notebooks, and safety goggles; timing devices, including clocks and timers; non-standard measuring items such as paper clips and clothespins; weather instruments such as classroom demonstration thermometers and wind socks; and materials to support observations of habitats of organisms such as aquariums and terrariums; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EED1","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"(B)  measure and compare organisms and objects using non-standard units."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEF2","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"(A)  collect, record, and compare information using tools, including computers, hand lenses, rulers, primary balances, plastic beakers, magnets, collecting nets, notebooks, and safety goggles; timing devices, including clocks and stopwatches; weather instruments such as thermometers, wind vanes, and rain gauges; and materials to support observations of habitats of organisms such as terrariums and aquariums; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEF3","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"(B)  measure and compare organisms and objects using non-standard units that approximate metric units."}]},{"leaf":false,"text":"(5)  Matter and energy. The student knows that objects have properties and patterns. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEB6","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"(A)  observe and record properties of objects, including relative size and mass, such as bigger or smaller and heavier or lighter, shape, color, and texture; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEB7","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"(B)  observe, record, and discuss how materials can be changed by heating or cooling."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EED2","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"(A)  classify objects by observable properties of the materials from which they are made such as larger and smaller, heavier and lighter, shape, color, and texture; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EED3","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"(B)  predict and identify changes in materials caused by heating and cooling such as ice melting, water freezing, and water evaporating."}]},{"leaf":false,"text":"(6)  Force, motion, and energy. The student knows that energy, force, and motion are related and are a part of their everyday life. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEB8","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"(A)  use the five senses to explore different forms of energy such as light, heat, and sound;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEB9","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"(B)  explore interactions between magnets and various materials;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEBA","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"(C)  observe and describe the location of an object in relation to another such as above, below, behind, in front of, and beside; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEBB","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"(D)  observe and describe the ways that objects can move such as in a straight line, zigzag, up and down, back and forth, round and round, and fast and slow."}]},{"leaf":false,"text":"(7)  Earth and space. The student knows that the natural world includes earth materials. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEBC","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"(A)  observe, describe, compare, and sort rocks by size, shape, color, and texture;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEBD","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"(B)  observe and describe physical properties of natural sources of water, including color and clarity; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEBE","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"(C)  give examples of ways rocks, soil, and water are useful."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEFC","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"(A)  observe and describe rocks by size, texture, and color;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEFD","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"(B)  identify and compare the properties of natural sources of freshwater and saltwater; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEFE","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"(C)  distinguish between natural and manmade resources."}]},{"leaf":false,"text":"(8)  Earth and space. The student knows that there are recognizable patterns in the natural world and among objects in the sky. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEBF","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"(A)  observe and describe weather changes from day to day and over seasons;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEC0","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"(B)  identify events that have repeating patterns, including seasons of the year and day and night; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEC1","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"(C)  observe, describe, and illustrate objects in the sky such as the clouds, Moon, and stars, including the Sun."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEFF","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"(A)  measure, record, and graph weather information, including temperature, wind conditions, precipitation, and cloud coverage, in order to identify patterns in the data;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF00","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"(B)  identify the importance of weather and seasonal information to make choices in clothing, activities, and transportation;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF01","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"(C)  explore the processes in the water cycle, including evaporation, condensation, and precipitation, as connected to weather conditions; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF02","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"(D)  observe, describe, and record patterns of objects in the sky, including the appearance of the Moon."}]},{"leaf":false,"text":"(9)  Organisms and environments. The student knows that plants and animals have basic needs and depend on the living and nonliving things around them for survival. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEC2","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"(A)  differentiate between living and nonliving things based upon whether they have basic needs and produce offspring; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEC3","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"(B)  examine evidence that living organisms have basic needs such as food, water, and shelter for animals and air, water, nutrients, sunlight, and space for plants."}]},{"leaf":false,"text":"(10)  Organisms and environments. The student knows that organisms resemble their parents and have structures and processes that help them survive within their environments. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEC4","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"(A)  sort plants and animals into groups based on physical characteristics such as color, size, body covering, or leaf shape;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEC5","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"(B)  identify parts of plants such as roots, stem, and leaves and parts of animals such as head, eyes, and limbs;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEC6","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"(C)  identify ways that young plants resemble the parent plant; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEC7","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"(D)  observe changes that are part of a simple life cycle of a plant: seed, seedling, plant, flower, and fruit."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEE2","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"(A)  investigate how the external characteristics of an animal are related to where it lives, how it moves, and what it eats;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEE3","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"(B)  identify and compare the parts of plants;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEE4","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"(C)  compare ways that young animals resemble their parents; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEE5","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"(D)  observe and record life cycles of animals such as a chicken, frog, or fish."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF06","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"(A)  observe, record, and compare how the physical characteristics and behaviors of animals help them meet their basic needs such as fins help fish move and balance in the water;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF07","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"(B)  observe, record, and compare how the physical characteristics of plants help them meet their basic needs such as stems carry water throughout the plant; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF08","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"(C)  investigate and record some of the unique stages that insects undergo during their life cycle."}]},{"leaf":false,"text":"(6)  Force, motion, and energy. The student knows that force, motion, and energy are related and are a part of everyday life. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EED4","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"(A)  identify and discuss how different forms of energy such as light, heat, and sound are important to everyday life;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EED5","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"(B)  predict and describe how a magnet can be used to push or pull an object;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EED6","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"(C)  describe the change in the location of an object such as closer to, nearer to, and farther from; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EED7","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"(D)  demonstrate and record the ways that objects can move such as in a straight line, zig zag, up and down, back and forth, round and round, and fast and slow."}]},{"leaf":false,"text":"(7)  Earth and space. The student knows that the natural world includes rocks, soil, and water that can be observed in cycles, patterns, and systems. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EED8","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"(A)  observe, compare, describe, and sort components of soil by size, texture, and color;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EED9","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"(B)  identify and describe a variety of natural sources of water, including streams, lakes, and oceans; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEDA","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"(C)  gather evidence of how rocks, soil, and water help to make useful products."}]},{"leaf":false,"text":"(8)  Earth and space. The student knows that the natural world includes the air around us and objects in the sky. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEDB","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"(A)  record weather information, including relative temperature, such as hot or cold, clear or cloudy, calm or windy, and rainy or icy;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEDC","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"(B)  observe and record changes in the appearance of objects in the sky such as clouds, the Moon, and stars, including the Sun;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEDD","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"(C)  identify characteristics of the seasons of the year and day and night; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEDE","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"(D)  demonstrate that air is all around us and observe that wind is moving air."}]},{"leaf":false,"text":"(9)  Organisms and environments. The student knows that the living environment is composed of relationships between organisms and the life cycles that occur. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEDF","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"(A)  sort and classify living and nonliving things based upon whether or not they have basic needs and produce offspring;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEE0","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"(B)  analyze and record examples of interdependence found in various situations such as terrariums and aquariums or pet and caregiver; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEE1","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"(C)  gather evidence of interdependence among living organisms such as energy transfer through food chains and animals using plants for shelter."}]},{"leaf":false,"text":"(1)  Scientific investigation and reasoning. The student conducts classroom and outdoor investigations following home and school safety procedures. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEE6","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"(A)  identify and demonstrate safe practices as described in the Texas Safety Standards during classroom and outdoor investigations, including wearing safety goggles, washing hands, and using materials appropriately;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEE7","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"(B)  describe the importance of safe practices; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEE8","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"(C)  identify and demonstrate how to use, conserve, and dispose of natural resources and materials such as conserving water and reuse or recycling of paper, plastic, and metal."}]},{"leaf":false,"text":"(2)  Scientific investigation and reasoning. The student develops abilities necessary to do scientific inquiry in classroom and outdoor investigations. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEE9","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"(A)  ask questions about organisms, objects, and events during observations and investigations;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEEA","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"(B)  plan and conduct descriptive investigations such as how organisms grow;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEEB","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"(C)  collect data from observations using simple equipment such as hand lenses, primary balances, thermometers, and non-standard measurement tools;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEEC","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"(D)  record and organize data using pictures, numbers, and words;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEED","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"(E)  communicate observations and justify explanations using student-generated data from simple descriptive investigations; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEEE","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"(F)  compare results of investigations with what students and scientists know about the world."}]},{"leaf":false,"text":"(3)  Scientific investigation and reasoning. The student knows that information and critical thinking, scientific problem solving, and the contributions of scientists are used in making decisions. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEEF","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"(A)  identify and explain a problem in his/her own words and propose a task and solution for the problem such as lack of water in a habitat;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEF0","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"(B)  make predictions based on observable patterns; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEF1","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"(C)  identify what a scientist is and explore what different scientists do."}]},{"leaf":false,"text":"(5)  Matter and energy. The student knows that matter has physical properties and those properties determine how it is described, classified, changed, and used. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEF4","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"(A)  classify matter by physical properties, including shape, relative mass, relative temperature, texture, flexibility, and whether material is a solid or liquid;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEF5","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"(B)  compare changes in materials caused by heating and cooling;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEF6","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"(C)  demonstrate that things can be done to materials to change their physical properties such as cutting, folding, sanding, and melting; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEF7","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"(D)  combine materials that when put together can do things that they cannot do by themselves such as building a tower or a bridge and justify the selection of those materials based on their physical properties."}]},{"leaf":false,"text":"(6)  Force, motion, and energy. The student knows that forces cause change and energy exists in many forms. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEF8","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"(A)  investigate the effects on an object by increasing or decreasing amounts of light, heat, and sound energy such as how the color of an object appears different in dimmer light or how heat melts butter;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEF9","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"(B)  observe and identify how magnets are used in everyday life;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEFA","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"(C)  trace the changes in the position of an object over time such as a cup rolling on the floor and a car rolling down a ramp; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EEFB","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"(D)  compare patterns of movement of objects such as sliding, rolling, and spinning."}]},{"leaf":false,"text":"(9)  Organisms and environments. The student knows that living organisms have basic needs that must be met for them to survive within their environment. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF03","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"(A)  identify the basic needs of plants and animals;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF04","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"(B)  identify factors in the environment, including temperature and precipitation, that affect growth and behavior such as migration, hibernation, and dormancy of living things; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF05","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"(C)  compare and give examples of the ways living organisms depend on each other and on their environments such as food chains within a garden, park, beach, lake, and wooded area."}]},{"leaf":false,"text":"(1)  Scientific investigation and reasoning. The student conducts classroom and outdoor investigations following school and home safety procedures and environmentally appropriate practices. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF09","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"(A)  demonstrate safe practices as described in the Texas Safety Standards during classroom and outdoor investigations, including observing a schoolyard habitat; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF0A","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"(B)  make informed choices in the use and conservation of natural resources by recycling or reusing materials such as paper, aluminum cans, and plastics."}]},{"leaf":false,"text":"(2)  Scientific investigation and reasoning. The student uses scientific inquiry methods during laboratory and outdoor investigations. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF0B","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"(A)  plan and implement descriptive investigations, including asking and answering questions, making inferences, and selecting and using equipment or technology needed, to solve a specific problem in the natural world;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF0C","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"(B)  collect data by observing and measuring using the metric system and recognize differences between observed and measured data;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF0D","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"(C)  construct maps, graphic organizers, simple tables, charts, and bar graphs using tools and current technology to organize, examine, and evaluate measured data;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF0E","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"(D)  analyze and interpret patterns in data to construct reasonable explanations based on evidence from investigations;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF0F","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"(E)  demonstrate that repeated investigations may increase the reliability of results; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF10","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"(F)  communicate valid conclusions supported by data in writing, by drawing pictures, and through verbal discussion."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0EE","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"(A)  plan and implement descriptive investigations, including asking well-defined questions, making inferences, and selecting and using appropriate equipment or technology to answer his/her questions;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0EF","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"(B)  collect and record data by observing and measuring, using the metric system, and using descriptive words and numerals such as labeled drawings, writing, and concept maps;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0F0","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"(C)  construct simple tables, charts, bar graphs, and maps using tools and current technology to organize, examine, and evaluate data;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0F1","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"(D)  analyze data and interpret patterns to construct reasonable explanations from data that can be observed and measured;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0F2","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"(E)  perform repeated investigations to increase the reliability of results; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0F4","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"(F)  communicate valid, oral, and written results supported by data"}]},{"leaf":false,"text":"(3)  Scientific investigation and reasoning. The student knows that information, critical thinking, scientific problem solving, and the contributions of scientists are used in making decisions. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF11","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"(A)  in all fields of science, analyze, evaluate, and critique scientific explanations by using empirical evidence, logical reasoning, and experimental and observational testing, including examining all sides of scientific evidence of those scientific explanations, so as to encourage critical thinking by the student;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF12","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"(B)  draw inferences and evaluate accuracy of product claims found in advertisements and labels such as for toys and food;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF13","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"(C)  represent the natural world using models such as volcanoes or Sun, Earth, and Moon system and identify their limitations, including size, properties, and materials; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF14","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"(D)  connect grade-level appropriate science concepts with the history of science, science careers, and contributions of scientists."}]},{"leaf":false,"text":"(4)  Scientific investigation and reasoning. The student knows how to use a variety of tools and methods to conduct science inquiry. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF15","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"(A)  collect, record, and analyze information using tools, including microscopes, cameras, computers, hand lenses, metric rulers, Celsius thermometers, wind vanes, rain gauges, pan balances, graduated cylinders, beakers, spring scales, hot plates, meter sticks, compasses, magnets, collecting nets, notebooks, sound recorders, and Sun, Earth, and Moon system models; timing devices, including clocks and stopwatches; and materials to support observation of habitats of organisms such as terrariums and aquariums; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF16","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"(B)  use safety equipment as appropriate, including safety goggles and gloves."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F119","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"(A)  collect, record, and analyze information using tools, including calculators, microscopes, cameras, computers, hand lenses, metric rulers, Celsius thermometers, prisms, mirrors, pan balances, triple beam balances, spring scales, graduated cylinders, beakers, hot plates, meter sticks, magnets, collecting nets, and notebooks; timing devices, including clocks and stopwatches; and materials to support observations of habitats or organisms such as terrariums and aquariums; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F11A","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"(B)  use safety equipment, including safety goggles and gloves."}]},{"leaf":false,"text":"(5)  Matter and energy. The student knows that matter has measurable physical properties and those properties determine how matter is classified, changed, and used. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF17","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"(A)  measure, test, and record physical properties of matter, including temperature, mass, magnetism, and the ability to sink or float;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF18","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"(B)  describe and classify samples of matter as solids, liquids, and gases and demonstrate that solids have a definite shape and that liquids and gases take the shape of their container;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF19","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"(C)  predict, observe, and record changes in the state of matter caused by heating or cooling; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF1A","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"(D)  explore and recognize that a mixture is created when two materials are combined such as gravel and sand and metal and plastic paper clips."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0FA","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"(A)  measure, compare, and contrast physical properties of matter, including size, mass, volume, states (solid, liquid, gas), temperature, magnetism, and the ability to sink or float;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0FB","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"(B)  predict the changes caused by heating and cooling such as ice becoming liquid water and condensation forming on the outside of a glass of ice water; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0FC","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"(C)  compare and contrast a variety of mixtures and solutions such as rocks in sand, sand in water, or sugar in water."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F11B","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"(A)  classify matter based on physical properties, including mass, magnetism, physical state (solid, liquid, and gas), relative density (sinking and floating), solubility in water, and the ability to conduct or insulate thermal energy or electric energy;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F11C","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"(B)  identify the boiling and freezing/melting points of water on the Celsius scale;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F11D","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"(C)  demonstrate that some mixtures maintain physical properties of their ingredients such as iron filings and sand; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F11E","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"(D)  identify changes that can occur in the physical properties of the ingredients of solutions such as dissolving salt in water or adding lemon juice to water."}]},{"leaf":false,"text":"(6)  Force, motion, and energy. The student knows that forces cause change and that energy exists in many forms. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF1B","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"(A)  explore different forms of energy, including mechanical, light, sound, and heat/thermal in everyday life;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF1C","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"(B)  demonstrate and observe how position and motion can be changed by pushing and pulling objects to show work being done such as swings, balls, pulleys, and wagons; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF1D","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"(C)  observe forces such as magnetism and gravity acting on objects."}]},{"leaf":false,"text":"(7)  Earth and space. The student knows that Earth consists of natural resources and its surface is constantly changing. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF1E","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"(A)  explore and record how soils are formed by weathering of rock and the decomposition of plant and animal remains;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF1F","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"(B)  investigate rapid changes in Earth's surface such as volcanic eruptions, earthquakes, and landslides;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF20","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"(C)  identify and compare different landforms, including mountains, hills, valleys, and plains; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF21","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"(D)  explore the characteristics of natural resources that make them useful in products and materials such as clothing and furniture and how resources may be conserved."}]},{"leaf":false,"text":"(8)  Earth and space. The student knows there are recognizable patterns in the natural world and among objects in the sky. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF22","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"(A)  observe, measure, record, and compare day-to-day weather changes in different locations at the same time that include air temperature, wind direction, and precipitation;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF23","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"(B)  describe and illustrate the Sun as a star composed of gases that provides light and heat energy for the water cycle;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF24","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"(C)  construct models that demonstrate the relationship of the Sun, Earth, and Moon, including orbits and positions; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF25","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"(D)  identify the planets in Earth's solar system and their position in relation to the Sun."}]},{"leaf":false,"text":"(9)  Organisms and environments. The student knows that organisms have characteristics that help them survive and can describe patterns, cycles, systems, and relationships within the environments. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF26","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"(A)  observe and describe the physical characteristics of environments and how they support populations and communities within an ecosystem;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF27","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"(B)  identify and describe the flow of energy in a food chain and predict how changes in a food chain affect the ecosystem such as removal of frogs from a pond or bees from a field; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF28","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"(C)  describe environmental changes such as floods and droughts where some organisms thrive and others perish or move to new locations."}]},{"leaf":false,"text":"(10)  Organisms and environments. The student knows that organisms undergo similar life processes and have structures that help them survive within their environments. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF29","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"(A)  explore how structures and functions of plants and animals allow them to survive in a particular environment;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF2A","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"(B)  explore that some characteristics of organisms are inherited such as the number of limbs on an animal or flower color and recognize that some behaviors are learned in response to living in a certain environment such as animals using tools to get food; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF2B","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"(C)  investigate and compare how animals and plants undergo a series of orderly changes in their diverse life cycles such as tomato plants, frogs, and lady bugs."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F109","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"(A)  explore how adaptations enable organisms to survive in their environment such as comparing birds' beaks and leaves on plants;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F10A","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"(B)  demonstrate that some likenesses between parents and offspring are inherited, passed from generation to generation such as eye color in humans or shapes of leaves in plants. Other likenesses are learned such as table manners or reading a book and seals balancing balls on their noses; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F10B","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"(C)  explore, illustrate, and compare life cycles in living organisms such as butterflies, beetles, radishes, or lima beans."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F12D","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"(A)  compare the structures and functions of different species that help them live and survive such as hooves on prairie animals or webbed feet in aquatic animals;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F12E","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"(B)  differentiate between inherited traits of plants and animals such as spines on a cactus or shape of a beak and learned behaviors such as an animal learning tricks or a child riding a bicycle; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F12F","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"(C)  describe the differences between complete and incomplete metamorphosis of insects."}]},{"leaf":false,"text":"(1)  Scientific investigation and reasoning. The student conducts classroom and outdoor investigations, following home and school safety procedures and environmentally appropriate and ethical practices. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0EC","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"(A)  demonstrate safe practices and the use of safety equipment as described in the Texas Safety Standards during classroom and outdoor investigations; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0ED","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"(B)  make informed choices in the use and conservation of natural resources and reusing and recycling of materials such as paper, aluminum, glass, cans, and plastic."}]},{"leaf":false,"text":"(3)  Scientific investigation and reasoning. The student uses critical thinking and scientific problem solving to make informed decisions. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0F3","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"(A)  in all fields of science, analyze, evaluate, and critique scientific explanations by using empirical evidence, logical reasoning, and experimental and observational testing, including examining all sides of scientific evidence of those scientific explanations, so as to encourage critical thinking by the student;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0F5","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"(B)  draw inferences and evaluate accuracy of services and product claims found in advertisements and labels such as for toys, food, and sunscreen;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0F6","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"(C)  represent the natural world using models such as rivers, stream tables, or fossils and identify their limitations, including accuracy and size; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0F7","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"(D)  connect grade-level appropriate science concepts with the history of science, science careers, and contributions of scientists."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F116","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"(B)  evaluate the accuracy of the information related to promotional materials for products and services such as nutritional labels;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F117","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"(C)  draw or develop a model that represents how something works or looks that cannot be seen such as how a soda dispensing machine works; and"}]},{"leaf":false,"text":"(4)  Scientific investigation and reasoning. The student knows how to use a variety of tools, materials, equipment, and models to conduct science inquiry. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0F8","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"(A)  collect, record, and analyze information using tools, including calculators, microscopes, cameras, computers, hand lenses, metric rulers, Celsius thermometers, mirrors, spring scales, pan balances, triple beam balances, graduated cylinders, beakers, hot plates, meter sticks, compasses, magnets, collecting nets, and notebooks; timing devices, including clocks and stopwatches; and materials to support observation of habitats of organisms such as terrariums and aquariums; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0F9","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"(B)  use safety equipment as appropriate, including safety goggles and gloves."}]},{"leaf":false,"text":"(6)  Force, motion, and energy. The student knows that energy exists in many forms and can be observed in cycles, patterns, and systems. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0FD","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"(A)  differentiate among forms of energy, including mechanical, sound, electrical, light, and heat/thermal;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0FE","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"(B)  differentiate between conductors and insulators;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0FF","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"(C)  demonstrate that electricity travels in a closed path, creating an electrical circuit, and explore an electromagnetic field; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F100","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"(D)  design an experiment to test the effect of force on an object such as a push or a pull, gravity, friction, or magnetism."}]},{"leaf":false,"text":"(7)  Earth and space. The students know that Earth consists of useful resources and its surface is constantly changing. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F101","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"(A)  examine properties of soils, including color and texture, capacity to retain water, and ability to support the growth of plants;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F102","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"(B)  observe and identify slow changes to Earth's surface caused by weathering, erosion, and deposition from water, wind, and ice; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F103","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"(C)  identify and classify Earth's renewable resources, including air, plants, water, and animals; and nonrenewable resources, including coal, oil, and natural gas; and the importance of conservation."}]},{"leaf":false,"text":"(8)  Earth and space. The student knows that there are recognizable patterns in the natural world and among the Sun, Earth, and Moon system. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F104","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"(A)  measure and record changes in weather and make predictions using weather maps, weather symbols, and a map key;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F105","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"(B)  describe and illustrate the continuous movement of water above and on the surface of Earth through the water cycle and explain the role of the Sun as a major source of energy in this process; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F106","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"(C)  collect and analyze data to identify sequences and predict patterns of change in shadows, tides, seasons, and the observable appearance of the Moon over time."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F125","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"(A)  differentiate between weather and climate;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F126","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"(B)  explain how the Sun and the ocean interact in the water cycle;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F127","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"(C)  demonstrate that Earth rotates on its axis once approximately every 24 hours causing the day/night cycle and the apparent movement of the Sun across the sky; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F128","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"(D)  identify and compare the physical characteristics of the Sun, Earth, and Moon."}]},{"leaf":false,"text":"(9)  Organisms and environments. The student knows and understands that living organisms within an ecosystem interact with one another and with their environment. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F107","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"(A)  investigate that most producers need sunlight, water, and carbon dioxide to make their own food, while consumers are dependent on other organisms for food; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F108","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"(B)  describe the flow of energy through food webs, beginning with the Sun, and predict how changes in the ecosystem affect the food web such as a fire in a forest."}]},{"leaf":false,"text":"(1)  Scientific investigation and reasoning. The student conducts classroom and outdoor investigations following home and school safety procedures and environmentally appropriate and ethical practices. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F10C","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"(A)  demonstrate safe practices and the use of safety equipment as described in the Texas Safety Standards during classroom and outdoor investigations; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F10D","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"(B)  make informed choices in the conservation, disposal, and recycling of materials."}]},{"leaf":false,"text":"(2)  Scientific investigation and reasoning. The student uses scientific methods during laboratory and outdoor investigations. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F10E","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"(A)  describe, plan, and implement simple experimental investigations testing one variable;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F10F","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"(B)  ask well-defined questions, formulate testable hypotheses, and select and use appropriate equipment and technology;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F110","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"(C)  collect information by detailed observations and accurate measuring;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F111","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"(D)  analyze and interpret information to construct reasonable explanations from direct (observable) and indirect (inferred) evidence;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F112","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"(E)  demonstrate that repeated investigations may increase the reliability of results;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F113","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"(F)  communicate valid conclusions in both written and verbal forms; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F114","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"(G)  construct appropriate simple graphs, tables, maps, and charts using technology, including computers, to organize, examine, and evaluate information."}]},{"leaf":false,"text":"(6)  Force, motion, and energy. The student knows that energy occurs in many forms and can be observed in cycles, patterns, and systems. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F115","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"(A)  explore the uses of energy, including mechanical, light, thermal, electrical, and sound energy;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F118","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"(B)  demonstrate that the flow of electricity in circuits requires a complete path through which an electric current can pass and can produce light, heat, and sound;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F11F","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"(C)  demonstrate that light travels in a straight line until it strikes an object or travels through one medium to another and demonstrate that light can be reflected such as the use of mirrors or other shiny surfaces and refracted such as the appearance of an object when observed through water; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F120","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"(D)  design an experiment that tests the effect of force on an object."}]},{"leaf":false,"text":"(7)  Earth and space. The student knows Earth's surface is constantly changing and consists of useful resources. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F121","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"(A)  explore the processes that led to the formation of sedimentary rocks and fossil fuels;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F122","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"(B)  recognize how landforms such as deltas, canyons, and sand dunes are the result of changes to Earth's surface by wind, water, and ice;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F123","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"(C)  identify alternative energy resources such as wind, solar, hydroelectric, geothermal, and biofuels; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F124","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"(D)  identify fossils as evidence of past living organisms and the nature of the environments at the time using models."}]},{"leaf":false,"text":"(9)  Organisms and environments. The student knows that there are relationships, systems, and cycles within environments. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F129","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"(A)  observe the way organisms live and survive in their ecosystem by interacting with the living and non-living elements;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F12A","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"(B)  describe how the flow of energy derived from the Sun, used by producers to create their own food, is transferred through a food chain and food web to consumers and decomposers;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F12B","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"(C)  predict the effects of changes in ecosystems caused by living organisms, including humans, such as the overpopulation of grazers or the building of highways; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F12C","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"(D)  identify the significance of the carbon dioxide-oxygen cycle to the survival of plants and animals."}]}]},{"leaf":false,"text":"Subchapter B. Middle School","children":[{"leaf":false,"text":"(1)  Scientific investigation and reasoning. The student, for at least 40% of instructional time, conducts laboratory and field investigations following safety procedures and environmentally appropriate and ethical practices. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F130","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"(A)  demonstrate safe practices during laboratory and field investigations as outlined in the Texas Safety Standards; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F131","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"(B)  practice appropriate use and conservation of resources, including disposal, reuse, or recycling of materials."}]},{"leaf":false,"text":"(2)  Scientific investigation and reasoning. The student uses scientific inquiry methods during laboratory and field investigations. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F132","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"(A)  plan and implement comparative and descriptive investigations by making observations, asking well-defined questions, and using appropriate equipment and technology;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F133","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"(B)  design and implement experimental investigations by making observations, asking well-defined questions, formulating testable hypotheses, and using appropriate equipment and technology;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F134","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"(C)  collect and record data using the International System of Units (SI) and qualitative means such as labeled drawings, writing, and graphic organizers;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F135","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"(D)  construct tables and graphs, using repeated trials and means, to organize data and identify patterns; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F136","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"(E)  analyze data to formulate reasonable explanations, communicate valid conclusions supported by the data, and predict trends."}]},{"leaf":false,"text":"(3)  Scientific investigation and reasoning. The student uses critical thinking, scientific reasoning, and problem solving to make informed decisions and knows the contributions of relevant scientists. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F137","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"(A)  in all fields of science, analyze, evaluate, and critique scientific explanations by using empirical evidence, logical reasoning, and experimental and observational testing, including examining all sides of scientific evidence of those scientific explanations, so as to encourage critical thinking by the student;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F138","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"(B)  use models to represent aspects of the natural world such as a model of Earth's layers;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F139","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"(C)  identify advantages and limitations of models such as size, scale, properties, and materials; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F13A","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"(D)  relate the impact of research on scientific thought and society, including the history of science and contributions of scientists as related to the content."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F13B","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(B)  use models to represent aspects of the natural world such as human body systems and plant and animal cells;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F13C","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"(B)  use models to represent aspects of the natural world such as an atom, a molecule, space, or a geologic feature;"}]},{"leaf":false,"text":"(4)  Scientific investigation and reasoning. The student knows how to use a variety of tools and safety equipment to conduct science inquiry. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F13D","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"(A)  use appropriate tools to collect, record, and analyze information, including journals/notebooks, beakers, Petri dishes, meter sticks, graduated cylinders, hot plates, test tubes, triple beam balances, microscopes, thermometers, calculators, computers, timing devices, and other equipment as needed to teach the curriculum; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F13E","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"(B)  use preventative safety equipment, including chemical splash goggles, aprons, and gloves, and be prepared to use emergency safety equipment, including an eye/face wash, a fire blanket, and a fire extinguisher."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F13F","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(A)  use appropriate tools to collect, record, and analyze information, including life science models, hand lens, stereoscopes, microscopes, beakers, Petri dishes, microscope slides, graduated cylinders, test tubes, meter sticks, metric rulers, metric tape measures, timing devices, hot plates, balances, thermometers, calculators, water test kits, computers, temperature and pH probes, collecting nets, insect traps, globes, digital cameras, journals/notebooks, and other equipment as needed to teach the curriculum; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F140","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"(A)  use appropriate tools to collect, record, and analyze information, including lab journals/notebooks, beakers, meter sticks, graduated cylinders, anemometers, psychrometers, hot plates, test tubes, spring scales, balances, microscopes, thermometers, calculators, computers, spectroscopes, timing devices, and other equipment as needed to teach the curriculum; and"}]},{"leaf":false,"text":"(5)  Matter and energy. The student knows the differences between elements and compounds. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EE36","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"(A)  know that an element is a pure substance represented by chemical symbols;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F141","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"(B)  recognize that a limited number of the many known elements comprise the largest portion of solid Earth, living matter, oceans, and the atmosphere;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F142","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"(C)  differentiate between elements and compounds on the most basic level; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F143","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"(D)  identify the formation of a new substance by using the evidence of a possible chemical change such as production of a gas, change in temperature, production of a precipitate, or color change."}]},{"leaf":false,"text":"(6)  Matter and energy. The student knows matter has physical properties that can be used for classification. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F144","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"(A)  compare metals, nonmetals, and metalloids using physical properties such as luster, conductivity, or malleability;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F145","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"(B)  calculate density to identify an unknown substance; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F146","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"(C)  test the physical properties of minerals, including hardness, color, luster, and streak."}]},{"leaf":false,"text":"(7)  Matter and energy. The student knows that some of Earth's energy resources are available on a nearly perpetual basis, while others can be renewed over a relatively short period of time. Some energy resources, once depleted, are essentially nonrenewable. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F147","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"(A)  research and debate the advantages and disadvantages of using coal, oil, natural gas, nuclear power, biomass, wind, hydropower, geothermal, and solar resources; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F148","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"(B)  design a logical plan to manage energy resources in the home, school, or community."}]},{"leaf":false,"text":"(8)  Force, motion, and energy. The student knows force and motion are related to potential and kinetic energy. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F149","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"(A)  compare and contrast potential and kinetic energy;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F14A","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"(B)  identify and describe the changes in position, direction, and speed of an object when acted upon by unbalanced forces;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F14B","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"(C)  calculate average speed using distance and time measurements;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F14C","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"(D)  measure and graph changes in motion; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F14D","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"(E)  investigate how inclined planes and pulleys can be used to change the amount of force to move an object."}]},{"leaf":false,"text":"(9)  Force, motion, and energy. The student knows that the Law of Conservation of Energy states that energy can neither be created nor destroyed, it just changes form. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F14E","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"(A)  investigate methods of thermal energy transfer, including conduction, convection, and radiation;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F14F","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"(B)  verify through investigations that thermal energy moves in a predictable pattern from warmer to cooler until all the substances attain the same temperature such as an ice cube melting; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F150","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"(C)  demonstrate energy transformations such as energy in a flashlight battery changes from chemical energy to electrical energy to light energy."}]},{"leaf":false,"text":"(10)  Earth and space. The student understands the structure of Earth, the rock cycle, and plate tectonics. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F151","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"(A)  build a model to illustrate the structural layers of Earth, including the inner core, outer core, mantle, crust, asthenosphere, and lithosphere;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F152","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"(B)  classify rocks as metamorphic, igneous, or sedimentary by the processes of their formation;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F153","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"(C)  identify the major tectonic plates, including Eurasian, African, Indo-Australian, Pacific, North American, and South American; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F154","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"(D)  describe how plate tectonics causes major geological events such as ocean basins, earthquakes, volcanic eruptions, and mountain building."}]},{"leaf":false,"text":"(11)  Earth and space. The student understands the organization of our solar system and the relationships among the various bodies that comprise it. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F155","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"(A)  describe the physical properties, locations, and movements of the Sun, planets, Galilean moons, meteors, asteroids, and comets;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F156","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"(B)  understand that gravity is the force that governs the motion of our solar system; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F157","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"(C)  describe the history and future of space exploration, including the types of equipment and transportation needed for space travel."}]},{"leaf":false,"text":"(12)  Organisms and environments. The student knows all organisms are classified into Domains and Kingdoms. Organisms within these taxonomic groups share similar characteristics which allow them to interact with the living and nonliving parts of their ecosystem. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F158","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"(A)  understand that all organisms are composed of one or more cells;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F159","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"(B)  recognize that the presence of a nucleus determines whether a cell is prokaryotic or eukaryotic;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F15A","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"(C)  recognize that the broadest taxonomic classification of living organisms is divided into currently recognized Domains;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F15B","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"(D)  identify the basic characteristics of organisms, including prokaryotic or eukaryotic, unicellular or multicellular, autotrophic or heterotrophic, and mode of reproduction, that further classify them in the currently recognized Kingdoms;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F15C","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"(E)  describe biotic and abiotic parts of an ecosystem in which organisms interact; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F15D","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"(F)  diagram the levels of organization within an ecosystem, including organism, population, community, and ecosystem."}]},{"leaf":false,"text":"(5)  Matter and energy. The student knows that interactions occur between matter and energy. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F15E","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(A)  recognize that radiant energy from the Sun is transformed into chemical energy through the process of photosynthesis;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F15F","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(B)  demonstrate and explain the cycling of matter within living systems such as in the decay of biomass in a compost bin; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F160","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(C)  diagram the flow of energy through living systems, including food chains, food webs, and energy pyramids."}]},{"leaf":false,"text":"(6)  Matter and energy. The student knows that matter has physical and chemical properties and can undergo physical and chemical changes. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F161","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(A)  identify that organic compounds contain carbon and other elements such as hydrogen, oxygen, phosphorus, nitrogen, or sulfur;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F162","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(B)  distinguish between physical and chemical changes in matter in the digestive system; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F163","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(C)  recognize how large molecules are broken down into smaller molecules such as carbohydrates can be broken down into sugars."}]},{"leaf":false,"text":"(7)  Force, motion, and energy. The student knows that there is a relationship among force, motion, and energy. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F164","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(A)  contrast situations where work is done with different amounts of force to situations where no work is done such as moving a box with a ramp and without a ramp, or standing still;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F165","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(B)  illustrate the transformation of energy within an organism such as the transfer from chemical energy to heat and thermal energy in digestion; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F166","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(C)  demonstrate and illustrate forces that affect motion in everyday life such as emergence of seedlings, turgor pressure, and geotropism."}]},{"leaf":false,"text":"(8)  Earth and space. The student knows that natural events and human activity can impact Earth systems. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F167","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(A)  predict and describe how different types of catastrophic events impact ecosystems such as floods, hurricanes, or tornadoes;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F168","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(B)  analyze the effects of weathering, erosion, and deposition on the environment in ecoregions of Texas; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F169","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(C)  model the effects of human activity on groundwater and surface water in a watershed."}]},{"leaf":false,"text":"(9)  Earth and space. The student knows components of our solar system. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F16A","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(A)  analyze the characteristics of objects in our solar system that allow life to exist such as the proximity of the Sun, presence of water, and composition of the atmosphere; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F16B","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(B)  identify the accommodations, considering the characteristics of our solar system, that enabled manned space exploration."}]},{"leaf":false,"text":"(10)  Organisms and environments. The student knows that there is a relationship between organisms and the environment. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F16C","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(A)  observe and describe how different environments, including microhabitats in schoolyards and biomes, support different varieties of organisms;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F16D","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(B)  describe how biodiversity contributes to the sustainability of an ecosystem; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F16E","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(C)  observe, record, and describe the role of ecological succession such as in a microhabitat of a garden with weeds."}]},{"leaf":false,"text":"(11)  Organisms and environments. The student knows that populations and species demonstrate variation and inherit many of their unique traits through gradual processes over many generations. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F16F","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(A)  examine organisms or their structures such as insects or leaves and use dichotomous keys for identification;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F170","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(B)  explain variation within a population or species by comparing external features, behaviors, or physiology of organisms that enhance their survival such as migration, hibernation, or storage of food in a bulb; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F171","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(C)  identify some changes in genetic traits that have occurred over several generations through natural selection and selective breeding such as the Galapagos Medium Ground Finch (Geospiza fortis) or domestic animals."}]},{"leaf":false,"text":"(12)  Organisms and environments. The student knows that living systems at all levels of organization demonstrate the complementary nature of structure and function. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F172","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(A)  investigate and explain how internal structures of organisms have adaptations that allow specific functions such as gills in fish, hollow bones in birds, or xylem in plants;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F173","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(B)  identify the main functions of the systems of the human organism, including the circulatory, respiratory, skeletal, muscular, digestive, excretory, reproductive, integumentary, nervous, and endocrine systems;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F174","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(C)  recognize levels of organization in plants and animals, including cells, tissues, organs, organ systems, and organisms;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F175","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(D)  differentiate between structure and function in plant and animal cell organelles, including cell membrane, cell wall, nucleus, cytoplasm, mitochondrion, chloroplast, and vacuole;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F176","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(E)  compare the functions of a cell to the functions of organisms such as waste removal; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F177","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(F)  recognize that according to cell theory all organisms are composed of cells and cells carry on similar functions such as extracting energy from food to sustain life."}]},{"leaf":false,"text":"(13)  Organisms and environments. The student knows that a living organism must be able to maintain balance in stable internal conditions in response to external and internal stimuli. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F178","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(A)  investigate how organisms respond to external stimuli found in the environment such as phototropism and fight or flight; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F179","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(B)  describe and relate responses in organisms that may result from internal stimuli such as wilting in plants and fever or vomiting in animals that allow them to maintain balance."}]},{"leaf":false,"text":"(14)  Organisms and environments. The student knows that reproduction is a characteristic of living organisms and that the instructions for traits are governed in the genetic material. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F17A","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(A)  define heredity as the passage of genetic instructions from one generation to the next generation;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F17B","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(B)  compare the results of uniform or diverse offspring from sexual reproduction or asexual reproduction; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F17C","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(C)  recognize that inherited traits of individuals are governed in the genetic material found in the genes within chromosomes in the nucleus."}]},{"leaf":false,"text":"(5)  Matter and energy. The student knows that matter is composed of atoms and has chemical and physical properties. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F17D","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"(A)  describe the structure of atoms, including the masses, electrical charges, and locations, of protons and neutrons in the nucleus and electrons in the electron cloud;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F17E","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"(B)  identify that protons determine an element's identity and valence electrons determine its chemical properties, including reactivity;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F17F","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"(C)  interpret the arrangement of the Periodic Table, including groups and periods, to explain how properties are used to classify elements;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F180","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"(D)  recognize that chemical formulas are used to identify substances and determine the number of atoms of each element in chemical formulas containing subscripts;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F181","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"(E)  investigate how evidence of chemical reactions indicate that new substances with different properties are formed; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F182","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"(F)  recognize whether a chemical equation containing coefficients is balanced or not and how that relates to the law of conservation of mass."}]},{"leaf":false,"text":"(6)  Force, motion, and energy. The student knows that there is a relationship between force, motion, and energy. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F183","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"(A)  demonstrate and calculate how unbalanced forces change the speed or direction of an object's motion;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F184","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"(B)  differentiate between speed, velocity, and acceleration; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F185","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"(C)  investigate and describe applications of Newton's law of inertia, law of force and acceleration, and law of action-reaction such as in vehicle restraints, sports activities, amusement park rides, Earth's tectonic activities, and rocket launches."}]},{"leaf":false,"text":"(7)  Earth and space. The student knows the effects resulting from cyclical movements of the Sun, Earth, and Moon. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F186","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"(A)  model and illustrate how the tilted Earth rotates on its axis, causing day and night, and revolves around the Sun causing changes in seasons;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F187","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"(B)  demonstrate and predict the sequence of events in the lunar cycle; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F188","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"(C)  relate the position of the Moon and Sun to their effect on ocean tides."}]},{"leaf":false,"text":"(8)  Earth and space. The student knows characteristics of the universe. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F189","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"(A)  describe components of the universe, including stars, nebulae, and galaxies, and use models such as the Herztsprung-Russell diagram for classification;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F18A","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"(B)  recognize that the Sun is a medium-sized star near the edge of a disc-shaped galaxy of stars and that the Sun is many thousands of times closer to Earth than any other star;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F18B","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"(C)  explore how different wavelengths of the electromagnetic spectrum such as light and radio waves are used to gain information about distances and properties of components in the universe;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F18C","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"(D)  model and describe how light years are used to measure distances and sizes in the universe; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F18D","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"(E)  research how scientific data are used as evidence to develop scientific theories to describe the origin of the universe."}]},{"leaf":false,"text":"(9)  Earth and space. The student knows that natural events can impact Earth systems. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F18E","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"(A)  describe the historical development of evidence that supports plate tectonic theory;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F18F","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"(B)  relate plate tectonics to the formation of crustal features; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F190","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"(C)  interpret topographic maps and satellite views to identify land and erosional features and predict how these features may be reshaped by weathering."}]},{"leaf":false,"text":"(10)  Earth and space. The student knows that climatic interactions exist among Earth, ocean, and weather systems. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F191","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"(A)  recognize that the Sun provides the energy that drives convection within the atmosphere and oceans, producing winds and ocean currents;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F192","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"(B)  identify how global patterns of atmospheric movement influence local weather using weather maps that show high and low pressures and fronts; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F193","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"(C)  identify the role of the oceans in the formation of weather systems such as hurricanes."}]},{"leaf":false,"text":"(11)  Organisms and environments. The student knows that interdependence occurs among living systems and the environment and that human activities can affect these systems. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F194","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"(A)  describe producer/consumer, predator/prey, and parasite/host relationships as they occur in food webs within marine, freshwater, and terrestrial ecosystems;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F195","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"(B)  investigate how organisms and populations in an ecosystem depend on and may compete for biotic and abiotic factors such as quantity of light, water, range of temperatures, or soil composition;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F196","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"(C)  explore how short- and long-term environmental changes affect organisms and traits in subsequent populations; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F197","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"(D)  recognize human dependence on ocean systems and explain how human activities such as runoff, artificial reefs, or use of resources have modified these systems."}]}]},{"leaf":false,"text":"Subchapter C. High School","children":[{"leaf":false,"text":"Aquatic Science","children":[{"leaf":false,"text":"(1)  Scientific processes. The student, for at least 40% of instructional time, conducts laboratory and field investigations using safe, environmentally appropriate, and ethical practices. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0BE","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  demonstrate safe practices during laboratory and field investigations, including chemical, electrical, and fire safety, and safe handling of live and preserved organisms; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0BF","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  demonstrate an understanding of the use and conservation of resources and the proper disposal or recycling of materials."}]},{"leaf":false,"text":"(2)  Scientific processes. The student uses scientific methods during laboratory and field investigations. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0C0","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  know the definition of science and understand that it has limitations, as specified in subsection (b)(2) of this section;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0C1","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  know that scientific hypotheses are tentative and testable statements that must be capable of being supported or not supported by observational evidence. Hypotheses of durable explanatory power which have been tested over a wide variety of conditions are incorporated into theories;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0C2","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(C)  know that scientific theories are based on natural and physical phenomena and are capable of being tested by multiple independent researchers. Unlike hypotheses, scientific theories are well-established and highly-reliable explanations, but they may be subject to change as new areas of science and new technologies are developed;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0C3","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(D)  distinguish between scientific hypotheses and scientific theories;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0C4","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(E)  plan and implement investigative procedures, including asking questions, formulating testable hypotheses, and selecting, handling, and maintaining appropriate equipment and technology;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0C5","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(F)  collect data individually or collaboratively, make measurements with precision and accuracy, record values using appropriate units, and calculate statistically relevant quantities to describe data, including mean, median, and range;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0C6","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(G)  demonstrate the use of course apparatuses, equipment, techniques, and procedures;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0C7","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(H)  organize, analyze, evaluate, build models, make inferences, and predict trends from data;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0C8","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(I)  perform calculations using dimensional analysis, significant digits, and scientific notation; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0C9","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(J)  communicate valid conclusions using essential vocabulary and multiple modes of expression such as lab reports, labeled drawings, graphic organizers, journals, summaries, oral reports, and technology-based reports."}]},{"leaf":false,"text":"(3)  Scientific processes. The student uses critical thinking, scientific reasoning, and problem solving to make informed decisions within and outside the classroom. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0CA","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  in all fields of science, analyze, evaluate, and critique scientific explanations by using empirical evidence, logical reasoning, and experimental and observational testing, including examining all sides of scientific evidence of those scientific explanations, so as to encourage critical thinking by the student;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0CB","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  communicate and apply scientific information extracted from various sources such as current events, news reports, published journal articles, and marketing materials;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0CC","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(C)  draw inferences based on data related to promotional materials for products and services;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0CD","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(D)  evaluate the impact of research and technology on scientific thought, society, and the environment;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0CE","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(E)  describe the connection between aquatic science and future careers; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0CF","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(F)  research and describe the history of aquatic science and contributions of scientists."}]},{"leaf":false,"text":"(4)  Science concepts. Students know that aquatic environments are the product of Earth systems interactions. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0D0","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  identify key features and characteristics of atmospheric, geological, hydrological, and biological systems as they relate to aquatic environments;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0D1","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  apply systems thinking to the examination of aquatic environments, including positive and negative feedback cycles; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0D2","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(C)  collect and evaluate global environmental data using technology such as maps, visualizations, satellite data, Global Positioning System (GPS), Geographic Information System (GIS), weather balloons, buoys, etc."}]},{"leaf":false,"text":"(5)  Science concepts. The student conducts long-term studies on local aquatic environments. Local natural environments are to be preferred over artificial or virtual environments. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0D3","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  evaluate data over a period of time from an established aquatic environment documenting seasonal changes and the behavior of organisms;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0D4","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  collect baseline quantitative data, including pH, salinity, temperature, mineral content, nitrogen compounds, and turbidity from an aquatic environment;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0D5","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(C)  analyze interrelationships among producers, consumers, and decomposers in a local aquatic ecosystem; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0D6","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(D)  identify the interdependence of organisms in an aquatic environment such as in a pond, river, lake, ocean, or aquifer and the biosphere."}]},{"leaf":false,"text":"(6)  Science concepts. The student knows the role of cycles in an aquatic environment. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0D7","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  identify the role of carbon, nitrogen, water, and nutrient cycles in an aquatic environment, including upwellings and turnovers; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0D8","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  examine the interrelationships between aquatic systems and climate and weather, including El Nio and La Nia, currents, and hurricanes."}]},{"leaf":false,"text":"(7)  Science concepts. The student knows the origin and use of water in a watershed. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0D9","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  identify sources and determine the amounts of water in a watershed, including rainfall, groundwater, and surface water;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0DA","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  identify factors that contribute to how water flows through a watershed; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0DB","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(C)  identify water quantity and quality in a local watershed."}]},{"leaf":false,"text":"(8)  Science concepts. The student knows that geological phenomena and fluid dynamics affect aquatic systems. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0DC","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  demonstrate basic principles of fluid dynamics, including hydrostatic pressure, density, salinity, and buoyancy;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0DD","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  identify interrelationships between ocean currents, climates, and geologic features; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0DE","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(C)  describe and explain fluid dynamics in an upwelling and lake turnover."}]},{"leaf":false,"text":"(9)  Science concepts. The student knows the types and components of aquatic ecosystems. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0DF","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  differentiate among freshwater, brackish, and saltwater ecosystems;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0E0","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  identify the major properties and components of different marine and freshwater life zones; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0E1","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(C)  identify biological, chemical, geological, and physical components of an aquatic life zone as they relate to the organisms in it."}]},{"leaf":false,"text":"(10)  Science concepts. The student knows environmental adaptations of aquatic organisms. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0E2","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  classify different aquatic organisms using tools such as dichotomous keys;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0E3","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  compare and describe how adaptations allow an organism to exist within an aquatic environment; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0E4","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(C)  compare differences in adaptations of aquatic organisms to fresh water and marine environments."}]},{"leaf":false,"text":"(11)  Science concepts. The student knows about the interdependence and interactions that occur in aquatic environments. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0E5","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  identify how energy flows and matter cycles through both fresh water and salt water aquatic systems, including food webs, chains, and pyramids; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0E6","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  evaluate the factors affecting aquatic population cycles."}]},{"leaf":false,"text":"(12)  Science concepts. The student understands how human activities impact aquatic environments. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0E7","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  predict effects of chemical, organic, physical, and thermal changes from humans on the living and nonliving components of an aquatic ecosystem;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0E8","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  analyze the cumulative impact of human population growth on an aquatic system;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0E9","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(C)  investigate the role of humans in unbalanced systems such as invasive species, fish farming, cultural eutrophication, or red tides;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0EA","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(D)  analyze and discuss how human activities such as fishing, transportation, dams, and recreation influence aquatic environments; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0EB","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(E)  understand the impact of various laws and policies such as The Endangered Species Act, right of capture laws, or Clean Water Act on aquatic systems."}]}]},{"leaf":false,"text":"Astronomy","children":[{"leaf":false,"text":"(1)  Scientific processes. The student, for at least 40% of instructional time, conducts laboratory and field investigations using safe, environmentally appropriate, and ethical practices. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F080","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  demonstrate safe practices during laboratory and field investigations; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F081","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  demonstrate an understanding of the use and conservation of resources and the proper disposal or recycling of materials."}]},{"leaf":false,"text":"(2)  Scientific processes. The student uses scientific methods during laboratory and field investigations. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F082","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  know the definition of science and understand that it has limitations, as specified in subsection (b)(2) of this section;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F083","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  know that scientific hypotheses are tentative and testable statements that must be capable of being supported or not supported by observational evidence. Hypotheses of durable explanatory power which have been tested over a wide variety of conditions are incorporated into theories;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F084","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(C)  know that scientific theories are based on natural and physical phenomena and are capable of being tested by multiple independent researchers. Unlike hypotheses, scientific theories are well-established and highly-reliable explanations, but may be subject to change as new areas of science and new technologies are developed;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F085","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(D)  distinguish between scientific hypotheses and scientific theories;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F086","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(E)  plan and implement investigative procedures, including making observations, asking questions, formulating testable hypotheses, and selecting equipment and technology;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F087","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(F)  collect data and make measurements with accuracy and precision;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F088","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(G)  organize, analyze, evaluate, make inferences, and predict trends from data, including making new revised hypotheses when appropriate;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F089","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(H)  communicate valid conclusions in writing, oral presentations, and through collaborative projects; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F08A","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(I)  use astronomical technology such as telescopes, binoculars, sextants, computers, and software."}]},{"leaf":false,"text":"(3)  Scientific processes. The student uses critical thinking, scientific reasoning, and problem solving to make informed decisions within and outside the classroom. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F08B","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  in all fields of science, analyze, evaluate, and critique scientific explanations by using empirical evidence, logical reasoning, and experimental and observational testing, including examining all sides of scientific evidence of those scientific explanations, so as to encourage critical thinking by the student;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F08C","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  communicate and apply scientific information extracted from various sources such as current events, news reports, published journal articles, and marketing materials;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F08D","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(C)  draw inferences based on data related to promotional materials for products and services;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F08E","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(D)  evaluate the impact of research on scientific thought, society, and the environment; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F08F","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(E)  describe the connection between astronomy and future careers."}]},{"leaf":false,"text":"(4)  Science concepts. The student recognizes the importance and uses of astronomy in civilization. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F090","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  research and describe the use of astronomy in ancient civilizations such as the Egyptians, Mayans, Aztecs, Europeans, and the native Americans;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F091","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  research and describe the contributions of scientists to our changing understanding of astronomy, including Ptolemy, Copernicus, Tycho Brahe, Kepler, Galileo, Newton, Einstein, and Hubble, and the contribution of women astronomers, including Maria Mitchell and Henrietta Swan Leavitt;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F092","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(C)  describe and explain the historical origins of the perceived patterns of constellations and the role of constellations in ancient and modern navigation; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F093","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(D)  explain the contributions of modern astronomy to today's society, including the identification of potential asteroid/comet impact hazards and the Sun's effects on communication, navigation, and high-tech devices."}]},{"leaf":false,"text":"(5)  Science concepts. The student develops a familiarity with the sky. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F094","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  observe and record the apparent movement of the Sun and Moon during the day;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F095","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  observe and record the apparent movement of the Moon, planets, and stars in the nighttime sky; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F096","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(C)  recognize and identify constellations such as Ursa Major, Ursa Minor, Orion, Cassiopeia, and constellations of the zodiac."}]},{"leaf":false,"text":"(6)  Science concepts. The student knows our place in space. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F097","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  compare and contrast the scale, size, and distance of the Sun, Earth, and Moon system through the use of data and modeling;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F098","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  compare and contrast the scale, size, and distance of objects in the solar system such as the Sun and planets through the use of data and modeling;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F099","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(C)  examine the scale, size, and distance of the stars, Milky Way, and other galaxies through the use of data and modeling;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F09A","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(D)  relate apparent versus absolute magnitude to the distances of celestial objects; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F09B","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(E)  demonstrate the use of units of measurement in astronomy, including Astronomical Units and light years."}]},{"leaf":false,"text":"(7)  Science concepts. The student knows the role of the Moon in the Sun, Earth, and Moon system. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F09C","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  observe and record data about lunar phases and use that information to model the Sun, Earth, and Moon system;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F09D","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  illustrate the cause of lunar phases by showing positions of the Moon relative to Earth and the Sun for each phase, including new moon, waxing crescent, first quarter, waxing gibbous, full moon, waning gibbous, third quarter, and waning crescent;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F09E","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(C)  identify and differentiate the causes of lunar and solar eclipses, including differentiating between lunar phases and eclipses; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F09F","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(D)  identify the effects of the Moon on tides."}]},{"leaf":false,"text":"(8)  Science concepts. The student knows the reasons for the seasons. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0A0","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  recognize that seasons are caused by the tilt of Earth's axis;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0A1","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  explain how latitudinal position affects the length of day and night throughout the year;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0A2","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(C)  recognize that the angle of incidence of sunlight determines the concentration of solar energy received on Earth at a particular location; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0A3","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(D)  examine the relationship of the seasons to equinoxes, solstices, the tropics, and the equator."}]},{"leaf":false,"text":"(9)  Science concepts. The student knows that planets of different size, composition, and surface features orbit around the Sun. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0A4","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  compare and contrast the factors essential to life on Earth such as temperature, water, mass, and gases to conditions on other planets;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0A5","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  compare the planets in terms of orbit, size, composition, rotation, atmosphere, natural satellites, and geological activity;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0A6","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(C)  relate the role of Newton's law of universal gravitation to the motion of the planets around the Sun and to the motion of natural and artificial satellites around the planets; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0A7","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(D)  explore the origins and significance of small solar system bodies, including asteroids, comets, and Kuiper belt objects."}]},{"leaf":false,"text":"(10)  Science concepts. The student knows the role of the Sun as the star in our solar system. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0A8","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  identify the approximate mass, size, motion, temperature, structure, and composition of the Sun;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0A9","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  distinguish between nuclear fusion and nuclear fission, and identify the source of energy within the Sun as nuclear fusion of hydrogen to helium;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0AA","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(C)  describe the eleven-year solar cycle and the significance of sunspots; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0AB","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(D)  analyze solar magnetic storm activity, including coronal mass ejections, prominences, flares, and sunspots."}]},{"leaf":false,"text":"(11)  Science concepts. The student knows the characteristics and life cycle of stars. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0AC","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  identify the characteristics of main sequence stars, including surface temperature, age, relative size, and composition;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0AD","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  characterize star formation in stellar nurseries from giant molecular clouds, to protostars, to the development of main sequence stars;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0AE","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(C)  evaluate the relationship between mass and fusion on the dying process and properties of stars;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0AF","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(D)  differentiate among the end states of stars, including white dwarfs, neutron stars, and black holes;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0B0","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(E)  compare how the mass and gravity of a main sequence star will determine its end state as a white dwarf, neutron star, or black hole;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0B1","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(F)  relate the use of spectroscopy in obtaining physical data on celestial objects such as temperature, chemical composition, and relative motion; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0B2","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(G)  use the Hertzsprung-Russell diagram to plot and examine the life cycle of stars from birth to death."}]},{"leaf":false,"text":"(12)  Science concepts. The student knows the variety and properties of galaxies. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0B3","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  describe characteristics of galaxies;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0B4","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  recognize the type, structure, and components of our Milky Way galaxy and location of our solar system within it; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0B5","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(C)  compare and contrast the different types of galaxies, including spiral, elliptical, irregular, and dwarf."}]},{"leaf":false,"text":"(13)  Science concepts. The student knows the scientific theories of cosmology. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0B6","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  research and describe the historical development of the Big Bang Theory, including red shift, cosmic microwave background radiation, and other supporting evidence;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0B7","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  research and describe current theories of the evolution of the universe, including estimates for the age of the universe; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0B8","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(C)  research and describe scientific hypotheses of the fate of the universe, including open and closed universes and the role of dark matter and dark energy."}]},{"leaf":false,"text":"(14)  Science concepts. The student recognizes the benefits and challenges of space exploration to the study of the universe. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0B9","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  identify and explain the contributions of human space flight and future plans and challenges;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0BA","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  recognize the advancement of knowledge in astronomy through robotic space flight;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0BB","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(C)  analyze the importance of ground-based technology in astronomical studies;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0BC","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(D)  recognize the importance of space telescopes to the collection of astronomical data across the electromagnetic spectrum; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F0BD","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(E)  demonstrate an awareness of new developments and discoveries in astronomy."}]}]},{"leaf":false,"text":"Biology","children":[{"leaf":false,"text":"(1)  Scientific processes. The student, for at least 40% of instructional time, conducts laboratory and field investigations using safe, environmentally appropriate, and ethical practices. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F046","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"}],"text":"(A)  demonstrate safe practices during laboratory and field investigations; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F047","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"}],"text":"(B)  demonstrate an understanding of the use and conservation of resources and the proper disposal or recycling of materials."}]},{"leaf":false,"text":"(2)  Scientific processes. The student uses scientific methods and equipment during laboratory and field investigations. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F048","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"}],"text":"(A)  know the definition of science and understand that it has limitations, as specified in subsection (b)(2) of this section;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F049","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"}],"text":"(B)  know that hypotheses are tentative and testable statements that must be capable of being supported or not supported by observational evidence. Hypotheses of durable explanatory power which have been tested over a wide variety of conditions are incorporated into theories;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F04A","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"}],"text":"(C)  know scientific theories are based on natural and physical phenomena and are capable of being tested by multiple independent researchers. Unlike hypotheses, scientific theories are well-established and highly-reliable explanations, but they may be subject to change as new areas of science and new technologies are developed;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F04B","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"}],"text":"(D)  distinguish between scientific hypotheses and scientific theories;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F04C","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"}],"text":"(E)  plan and implement descriptive, comparative, and experimental investigations, including asking questions, formulating testable hypotheses, and selecting equipment and technology;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F04D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"}],"text":"(F)  collect and organize qualitative and quantitative data and make measurements with accuracy and precision using tools such as calculators, spreadsheet software, data-collecting probes, computers, standard laboratory glassware, microscopes, various prepared slides, stereoscopes, metric rulers, electronic balances, gel electrophoresis apparatuses, micropipettors, hand lenses, Celsius thermometers, hot plates, lab notebooks or journals, timing devices, cameras, Petri dishes, lab incubators, dissection equipment, meter sticks, and models, diagrams, or samples of biological specimens or structures;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F04E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"}],"text":"(G)  analyze, evaluate, make inferences, and predict trends from data; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F04F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"}],"text":"(H)  communicate valid conclusions supported by the data through methods such as lab reports, labeled drawings, graphic organizers, journals, summaries, oral reports, and technology-based reports."}]},{"leaf":false,"text":"(3)  Scientific processes. The student uses critical thinking, scientific reasoning, and problem solving to make informed decisions within and outside the classroom. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F050","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"}],"text":"(A)  in all fields of science, analyze, evaluate, and critique scientific explanations by using empirical evidence, logical reasoning, and experimental and observational testing, including examining all sides of scientific evidence of those scientific explanations, so as to encourage critical thinking by the student;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F051","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"}],"text":"(B)  communicate and apply scientific information extracted from various sources such as current events, news reports, published journal articles, and marketing materials;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F052","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"}],"text":"(C)  draw inferences based on data related to promotional materials for products and services;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F053","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"}],"text":"(D)  evaluate the impact of scientific research on society and the environment;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F054","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"}],"text":"(E)  evaluate models according to their limitations in representing biological objects or events; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F055","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"}],"text":"(F)  research and describe the history of biology and contributions of scientists."}]},{"leaf":false,"text":"(4)  Science concepts. The student knows that cells are the basic structures of all living things with specialized parts that perform specific functions and that viruses are different from cells. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F056","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"}],"text":"(A)  compare and contrast prokaryotic and eukaryotic cells;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F057","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"}],"text":"(B)  investigate and explain cellular processes, including homeostasis, energy conversions, transport of molecules, and synthesis of new molecules; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F058","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"}],"text":"(C)  compare the structures of viruses to cells, describe viral reproduction, and describe the role of viruses in causing diseases such as human immunodeficiency virus (HIV) and influenza."}]},{"leaf":false,"text":"(5)  Science concepts. The student knows how an organism grows and the importance of cell differentiation. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F059","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"}],"text":"(A)  describe the stages of the cell cycle, including deoxyribonucleic acid (DNA) replication and mitosis, and the importance of the cell cycle to the growth of organisms;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F05A","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"}],"text":"(B)  examine specialized cells, including roots, stems, and leaves of plants; and animal cells such as blood, muscle, and epithelium;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F05B","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"}],"text":"(C)  describe the roles of DNA, ribonucleic acid (RNA), and environmental factors in cell differentiation; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F05C","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"}],"text":"(D)  recognize that disruptions of the cell cycle lead to diseases such as cancer."}]},{"leaf":false,"text":"(6)  Science concepts. The student knows the mechanisms of genetics, including the role of nucleic acids and the principles of Mendelian Genetics. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F05D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"}],"text":"(A)  identify components of DNA, and describe how information for specifying the traits of an organism is carried in the DNA;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F05E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"}],"text":"(B)  recognize that components that make up the genetic code are common to all organisms;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F05F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"}],"text":"(C)  explain the purpose and process of transcription and translation using models of DNA and RNA;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F060","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"}],"text":"(D)  recognize that gene expression is a regulated process;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F061","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"}],"text":"(E)  identify and illustrate changes in DNA and evaluate the significance of these changes;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F062","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"}],"text":"(F)  predict possible outcomes of various genetic combinations such as monohybrid crosses, dihybrid crosses and non-Mendelian inheritance;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F063","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"}],"text":"(G)  recognize the significance of meiosis to sexual reproduction; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F064","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"}],"text":"(H)  describe how techniques such as DNA fingerprinting, genetic modifications, and chromosomal analysis are used to study the genomes of organisms."}]},{"leaf":false,"text":"(7)  Science concepts. The student knows evolutionary theory is a scientific explanation for the unity and diversity of life. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F065","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"}],"text":"(A)  analyze and evaluate how evidence of common ancestry among groups is provided by the fossil record, biogeography, and homologies, including anatomical, molecular, and developmental;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F066","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"}],"text":"(B)  analyze and evaluate scientific explanations concerning any data of sudden appearance, stasis, and sequential nature of groups in the fossil record;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F067","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"}],"text":"(C)  analyze and evaluate how natural selection produces change in populations, not individuals;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F068","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"}],"text":"(D)  analyze and evaluate how the elements of natural selection, including inherited variation, the potential of a population to produce more offspring than can survive, and a finite supply of environmental resources, result in differential reproductive success;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F069","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"}],"text":"(E)  analyze and evaluate the relationship of natural selection to adaptation and to the development of diversity in and among species;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F06A","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"}],"text":"(F)  analyze and evaluate the effects of other evolutionary mechanisms, including genetic drift, gene flow, mutation, and recombination; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F06B","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"}],"text":"(G)  analyze and evaluate scientific explanations concerning the complexity of the cell."}]},{"leaf":false,"text":"(8)  Science concepts. The student knows that taxonomy is a branching classification based on the shared characteristics of organisms and can change as new discoveries are made. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F06C","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"}],"text":"(A)  define taxonomy and recognize the importance of a standardized taxonomic system to the scientific community;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F06D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"}],"text":"(B)  categorize organisms using a hierarchical classification system based on similarities and differences shared among groups; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F06E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"}],"text":"(C)  compare characteristics of taxonomic groups, including archaea, bacteria, protists, fungi, plants, and animals."}]},{"leaf":false,"text":"(9)  Science concepts. The student knows the significance of various molecules involved in metabolic processes and energy conversions that occur in living organisms. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F06F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"}],"text":"(A)  compare the structures and functions of different types of biomolecules, including carbohydrates, lipids, proteins, and nucleic acids;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F070","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"}],"text":"(B)  compare the reactants and products of photosynthesis and cellular respiration in terms of energy and matter;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F071","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"}],"text":"(C)  identify and investigate the role of enzymes; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F072","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"}],"text":"(D)  analyze and evaluate the evidence regarding formation of simple organic molecules and their organization into long complex molecules having information such as the DNA molecule for self-replicating life."}]},{"leaf":false,"text":"(10)  Science concepts. The student knows that biological systems are composed of multiple levels. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F073","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"}],"text":"(A)  describe the interactions that occur among systems that perform the functions of regulation, nutrient absorption, reproduction, and defense from injury or illness in animals;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F074","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"}],"text":"(B)  describe the interactions that occur among systems that perform the functions of transport, reproduction, and response in plants; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F075","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"}],"text":"(C)  analyze the levels of organization in biological systems and relate the levels to each other and to the whole system."}]},{"leaf":false,"text":"(11)  Science concepts. The student knows that biological systems work to achieve and maintain balance. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F076","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"}],"text":"(A)  describe the role of internal feedback mechanisms in the maintenance of homeostasis;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F077","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"}],"text":"(B)  investigate and analyze how organisms, populations, and communities respond to external factors;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F078","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"}],"text":"(C)  summarize the role of microorganisms in both maintaining and disrupting the health of both organisms and ecosystems; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F079","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"}],"text":"(D)  describe how events and processes that occur during ecological succession can change populations and species diversity."}]},{"leaf":false,"text":"(12)  Science concepts. The student knows that interdependence and interactions occur within an environmental system. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F07A","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"}],"text":"(A)  interpret relationships, including predation, parasitism, commensalism, mutualism, and competition among organisms;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F07B","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"}],"text":"(B)  compare variations and adaptations of organisms in different ecosystems;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F07C","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"}],"text":"(C)  analyze the flow of matter and energy through trophic levels using various models, including food chains, food webs, and ecological pyramids;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F07D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"}],"text":"(D)  recognize that long-term survival of species is dependent on changing resource bases that are limited;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F07E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"}],"text":"(E)  describe the flow of matter through the carbon and nitrogen cycles and explain the consequences of disrupting these cycles; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F07F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"}],"text":"(F)  describe how environmental change can impact ecosystem stability."}]}]},{"leaf":false,"text":"Chemistry","children":[{"leaf":false,"text":"(1)  Scientific processes. The student, for at least 40% of instructional time, conducts laboratory and field investigations using safe, environmentally appropriate, and ethical practices. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F009","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  demonstrate safe practices during laboratory and field investigations, including the appropriate use of safety showers, eyewash fountains, safety goggles, and fire extinguishers;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F00A","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  know specific hazards of chemical substances such as flammability, corrosiveness, and radioactivity as summarized on the Material Safety Data Sheets (MSDS); and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F00B","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(C)  demonstrate an understanding of the use and conservation of resources and the proper disposal or recycling of materials."}]},{"leaf":false,"text":"(2)  Scientific processes. The student uses scientific methods to solve investigative questions. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F00C","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  know the definition of science and understand that it has limitations, as specified in subsection (b)(2) of this section;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F00D","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  know that scientific hypotheses are tentative and testable statements that must be capable of being supported or not supported by observational evidence. Hypotheses of durable explanatory power which have been tested over a wide variety of conditions are incorporated into theories;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F00E","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(C)  know that scientific theories are based on natural and physical phenomena and are capable of being tested by multiple independent researchers. Unlike hypotheses, scientific theories are well-established and highly-reliable explanations, but may be subject to change as new areas of science and new technologies are developed;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F00F","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(D)  distinguish between scientific hypotheses and scientific theories;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F010","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(E)  plan and implement investigative procedures, including asking questions, formulating testable hypotheses, and selecting equipment and technology, including graphing calculators, computers and probes, sufficient scientific glassware such as beakers, Erlenmeyer flasks, pipettes, graduated cylinders, volumetric flasks, safety goggles, and burettes, electronic balances, and an adequate supply of consumable chemicals;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F011","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(F)  collect data and make measurements with accuracy and precision;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F012","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(G)  express and manipulate chemical quantities using scientific conventions and mathematical procedures, including dimensional analysis, scientific notation, and significant figures;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F013","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(H)  organize, analyze, evaluate, make inferences, and predict trends from data; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F014","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(I)  communicate valid conclusions supported by the data through methods such as lab reports, labeled drawings, graphs, journals, summaries, oral reports, and technology-based reports."}]},{"leaf":false,"text":"(3)  Scientific processes. The student uses critical thinking, scientific reasoning, and problem solving to make informed decisions within and outside the classroom. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F015","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  in all fields of science, analyze, evaluate, and critique scientific explanations by using empirical evidence, logical reasoning, and experimental and observational testing, including examining all sides of scientific evidence of those scientific explanations, so as to encourage critical thinking by the student;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F016","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  communicate and apply scientific information extracted from various sources such as current events, news reports, published journal articles, and marketing materials;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F017","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(C)  draw inferences based on data related to promotional materials for products and services;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F018","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(D)  evaluate the impact of research on scientific thought, society, and the environment;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F019","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(E)  describe the connection between chemistry and future careers; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F01A","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(F)  research and describe the history of chemistry and contributions of scientists."}]},{"leaf":false,"text":"(4)  Science concepts. The student knows the characteristics of matter and can analyze the relationships between chemical and physical changes and properties. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F01B","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  differentiate between physical and chemical changes and properties;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F01C","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  identify extensive and intensive properties;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F01D","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(C)  compare solids, liquids, and gases in terms of compressibility, structure, shape, and volume; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F01E","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(D)  classify matter as pure substances or mixtures through investigation of their properties."}]},{"leaf":false,"text":"(5)  Science concepts. The student understands the historical development of the Periodic Table and can apply its predictive power. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F01F","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  explain the use of chemical and physical properties in the historical development of the Periodic Table;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F020","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  use the Periodic Table to identify and explain the properties of chemical families, including alkali metals, alkaline earth metals, halogens, noble gases, and transition metals; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F021","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(C)  use the Periodic Table to identify and explain periodic trends, including atomic and ionic radii, electronegativity, and ionization energy."}]},{"leaf":false,"text":"(6)  Science concepts. The student knows and understands the historical development of atomic theory. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F022","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  understand the experimental design and conclusions used in the development of modern atomic theory, including Dalton's Postulates, Thomson's discovery of electron properties, Rutherford's nuclear atom, and Bohr's nuclear atom;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F023","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  understand the electromagnetic spectrum and the mathematical relationships between energy, frequency, and wavelength of light;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F024","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(C)  calculate the wavelength, frequency, and energy of light using Planck's constant and the speed of light;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F025","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(D)  use isotopic composition to calculate average atomic mass of an element; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F026","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(E)  express the arrangement of electrons in atoms through electron configurations and Lewis valence electron dot structures."}]},{"leaf":false,"text":"(7)  Science concepts. The student knows how atoms form ionic, metallic, and covalent bonds. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F027","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  name ionic compounds containing main group or transition metals, covalent compounds, acids, and bases, using International Union of Pure and Applied Chemistry (IUPAC) nomenclature rules;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F028","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  write the chemical formulas of common polyatomic ions, ionic compounds containing main group or transition metals, covalent compounds, acids, and bases;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F029","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(C)  construct electron dot formulas to illustrate ionic and covalent bonds;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F02A","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(D)  describe the nature of metallic bonding and apply the theory to explain metallic properties such as thermal and electrical conductivity, malleability, and ductility; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F02B","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(E)  predict molecular structure for molecules with linear, trigonal planar, or tetrahedral electron pair geometries using Valence Shell Electron Pair Repulsion (VSEPR) theory."}]},{"leaf":false,"text":"(8)  Science concepts. The student can quantify the changes that occur during chemical reactions. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F02C","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  define and use the concept of a mole;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F02D","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  use the mole concept to calculate the number of atoms, ions, or molecules in a sample of material;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F02E","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(C)  calculate percent composition and empirical and molecular formulas;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F02F","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(D)  use the law of conservation of mass to write and balance chemical equations; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F030","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(E)  perform stoichiometric calculations, including determination of mass relationships between reactants and products, calculation of limiting reagents, and percent yield."}]},{"leaf":false,"text":"(9)  Science concepts. The student understands the principles of ideal gas behavior, kinetic molecular theory, and the conditions that influence the behavior of gases. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F031","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  describe and calculate the relations between volume, pressure, number of moles, and temperature for an ideal gas as described by Boyle's law, Charles' law, Avogadro's law, Dalton's law of partial pressure, and the ideal gas law;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F032","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  perform stoichiometric calculations, including determination of mass and volume relationships between reactants and products for reactions involving gases; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F033","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(C)  describe the postulates of kinetic molecular theory."}]},{"leaf":false,"text":"(10)  Science concepts. The student understands and can apply the factors that influence the behavior of solutions. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F034","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  describe the unique role of water in chemical and biological systems;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F035","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  develop and use general rules regarding solubility through investigations with aqueous solutions;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F036","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(C)  calculate the concentration of solutions in units of molarity;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F037","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(D)  use molarity to calculate the dilutions of solutions;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F038","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(E)  distinguish between types of solutions such as electrolytes and nonelectrolytes and unsaturated, saturated, and supersaturated solutions;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F039","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(F)  investigate factors that influence solubilities and rates of dissolution such as temperature, agitation, and surface area;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F03A","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(G)  define acids and bases and distinguish between Arrhenius and Bronsted-Lowry definitions and predict products in acid base reactions that form water;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F03B","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(H)  understand and differentiate among acid-base reactions, precipitation reactions, and oxidation-reduction reactions;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F03C","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(I)  define pH and use the hydrogen or hydroxide ion concentrations to calculate the pH of a solution; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F03D","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(J)  distinguish between degrees of dissociation for strong and weak acids and bases."}]},{"leaf":false,"text":"(11)  Science concepts. The student understands the energy changes that occur in chemical reactions. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F03E","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  understand energy and its forms, including kinetic, potential, chemical, and thermal energies;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F03F","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  understand the law of conservation of energy and the processes of heat transfer;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F040","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(C)  use thermochemical equations to calculate energy changes that occur in chemical reactions and classify reactions as exothermic or endothermic;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F041","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(D)  perform calculations involving heat, mass, temperature change, and specific heat; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F042","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(E)  use calorimetry to calculate the heat of a chemical process."}]},{"leaf":false,"text":"(12)  Science concepts. The student understands the basic processes of nuclear chemistry. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F043","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  describe the characteristics of alpha, beta, and gamma radiation;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F044","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  describe radioactive decay process in terms of balanced nuclear equations; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F045","dcterms_educationLevel":[{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(C)  compare fission and fusion reactions."}]}]},{"leaf":false,"text":"Earth and Space Science","children":[{"leaf":false,"text":"(1)  Scientific processes. The student conducts laboratory and field investigations, for at least 40% of instructional time, using safe, environmentally appropriate, and ethical practices. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFC2","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  demonstrate safe practices during laboratory and field investigations;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFC3","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  demonstrate an understanding of the use and conservation of resources and the proper disposal or recycling of materials; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFC4","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(C)  use the school's technology and information systems in a wise and ethical manner."}]},{"leaf":false,"text":"(2)  Scientific processes. The student uses scientific methods during laboratory and field investigations. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFC5","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  know the definition of science and understand that it has limitations, as specified in subsection (b)(2) of this section;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFC6","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  know that scientific hypotheses are tentative and testable statements that must be capable of being supported or not supported by observational evidence. Hypotheses of durable explanatory power which have been tested over a wide variety of conditions are incorporated into theories;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFC7","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(C)  know that scientific theories are based on natural and physical phenomena and are capable of being tested by multiple independent researchers. Unlike hypotheses, scientific theories are well-established and highly-reliable explanations, but may be subject to change as new areas of science and new technologies are developed;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFC8","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(D)  distinguish between scientific hypotheses and scientific theories;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFC9","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(E)  demonstrate the use of course equipment, techniques, and procedures, including computers and web-based computer applications;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFCA","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(F)  use a wide variety of additional course apparatuses, equipment, techniques, and procedures as appropriate such as satellite imagery and other remote sensing data, Geographic Information Systems (GIS), Global Positioning System (GPS), scientific probes, microscopes, telescopes, modern video and image libraries, weather stations, fossil and rock kits, bar magnets, coiled springs, wave simulators, tectonic plate models, and planetary globes;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFCB","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(G)  organize, analyze, evaluate, make inferences, and predict trends from data;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFCC","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(H)  use mathematical procedures such as algebra, statistics, scientific notation, and significant figures to analyze data using the International System (SI) units; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFCD","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(I)  communicate valid conclusions supported by data using several formats such as technical reports, lab reports, labeled drawings, graphic organizers, journals, presentations, and technical posters."}]},{"leaf":false,"text":"(3)  Scientific processes. The student uses critical thinking, scientific reasoning, and problem solving to make informed decisions within and outside the classroom. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFCE","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  in all fields of science, analyze, evaluate, and critique scientific explanations by using empirical evidence, logical reasoning, and experimental and observational testing, including examining all sides of scientific evidence of those scientific explanations, so as to encourage critical thinking by the student;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFCF","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  communicate and apply scientific information extracted from various sources such as current events, news reports, published journal articles, and marketing materials;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFD0","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(C)  draw inferences based on data related to promotional materials for products and services;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFD1","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(D)  evaluate the impact of research on scientific thought, society, and public policy;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFD2","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(E)  explore careers and collaboration among scientists in Earth and space sciences; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFD3","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(F)  learn and understand the contributions of scientists to the historical development of Earth and space sciences."}]},{"leaf":false,"text":"(4)  Earth in space and time. The student knows how Earth-based and space-based astronomical observations reveal differing theories about the structure, scale, composition, origin, and history of the universe. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFD4","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  evaluate the evidence concerning the Big Bang model such as red shift and cosmic microwave background radiation and current theories of the evolution of the universe, including estimates for the age of the universe;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFD5","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  explain how the Sun and other stars transform matter into energy through nuclear fusion; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFD6","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(C)  investigate the process by which a supernova can lead to the formation of successive generation stars and planets."}]},{"leaf":false,"text":"(5)  Earth in space and time. The student understands the solar nebular accretionary disk model. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFD7","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  analyze how gravitational condensation of solar nebular gas and dust can lead to the accretion of planetesimals and protoplanets;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFD8","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  investigate thermal energy sources, including kinetic heat of impact accretion, gravitational compression, and radioactive decay, which are thought to allow protoplanet differentiation into layers;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFD9","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(C)  contrast the characteristics of comets, asteroids, and meteoroids and their positions in the solar system, including the orbital regions of the terrestrial planets, the asteroid belt, gas giants, Kuiper Belt, and Oort Cloud;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFDA","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(D)  explore the historical and current hypotheses for the origin of the Moon, including the collision of Earth with a Mars-sized planetesimal;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFDB","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(E)  compare terrestrial planets to gas-giant planets in the solar system, including structure, composition, size, density, orbit, surface features, tectonic activity, temperature, and suitability for life; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFDC","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(F)  compare extra-solar planets with planets in our solar system and describe how such planets are detected."}]},{"leaf":false,"text":"(6)  Earth in space and time. The student knows the evidence for how Earth's atmospheres, hydrosphere, and geosphere formed and changed through time. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFDD","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  analyze the changes of Earth's atmosphere that could have occurred through time from the original hydrogen-helium atmosphere, the carbon dioxide-water vapor-methane atmosphere, and the current nitrogen-oxygen atmosphere;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFDE","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  evaluate the role of volcanic outgassing and impact of water-bearing comets in developing Earth's atmosphere and hydrosphere;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFDF","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(C)  investigate how the formation of atmospheric oxygen and the ozone layer impacted the formation of the geosphere and biosphere; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFE0","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(D)  evaluate the evidence that Earth's cooling led to tectonic activity, resulting in continents and ocean basins."}]},{"leaf":false,"text":"(7)  Earth in space and time. The student knows that scientific dating methods of fossils and rock sequences are used to construct a chronology of Earth's history expressed in the geologic time scale. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFE1","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  evaluate relative dating methods using original horizontality, rock superposition, lateral continuity, cross-cutting relationships, unconformities, index fossils, and biozones based on fossil succession to determine chronological order;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFE2","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  calculate the ages of igneous rocks from Earth and the Moon and meteorites using radiometric dating methods; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFE3","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(C)  understand how multiple dating methods are used to construct the geologic time scale, which represents Earth's approximate 4.6-billion-year history."}]},{"leaf":false,"text":"(8)  Earth in space and time. The student knows that fossils provide evidence for geological and biological evolution. Students are expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFE4","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  analyze and evaluate a variety of fossil types such as transitional fossils, proposed transitional fossils, fossil lineages, and significant fossil deposits with regard to their appearance, completeness, and alignment with scientific explanations in light of this fossil data;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFE5","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  explain how sedimentation, fossilization, and speciation affect the degree of completeness of the fossil record; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFE6","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(C)  evaluate the significance of the terminal Permian and Cretaceous mass extinction events, including adaptive radiations of organisms after the events."}]},{"leaf":false,"text":"(9)  Solid Earth. The student knows Earth's interior is differentiated chemically, physically, and thermally. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFE7","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  evaluate heat transfer through Earth's subsystems by radiation, convection, and conduction and include its role in plate tectonics, volcanism, ocean circulation, weather, and climate;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFE8","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  examine the chemical, physical, and thermal structure of Earth's crust, mantle, and core, including the lithosphere and asthenosphere;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFE9","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(C)  explain how scientists use geophysical methods such as seismic wave analysis, gravity, and magnetism to interpret Earth's structure; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFEA","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(D)  describe the formation and structure of Earth's magnetic field, including its interaction with charged solar particles to form the Van Allen belts and auroras."}]},{"leaf":false,"text":"(10)  Solid Earth. The student knows that plate tectonics is the global mechanism for major geologic processes and that heat transfer, governed by the principles of thermodynamics, is the driving force. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFEB","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  investigate how new conceptual interpretations of data and innovative geophysical technologies led to the current theory of plate tectonics;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFEC","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  describe how heat and rock composition affect density within Earth's interior and how density influences the development and motion of Earth's tectonic plates;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFED","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(C)  explain how plate tectonics accounts for geologic processes and features, including sea floor spreading, ocean ridges and rift valleys, subduction zones, earthquakes, volcanoes, mountain ranges, hot spots, and hydrothermal vents;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFEE","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(D)  calculate the motion history of tectonic plates using equations relating rate, time, and distance to predict future motions, locations, and resulting geologic features;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFEF","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(E)  distinguish the location, type, and relative motion of convergent, divergent, and transform plate boundaries using evidence from the distribution of earthquakes and volcanoes; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFF0","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(F)  evaluate the role of plate tectonics with respect to long-term global changes in Earth's subsystems such as continental buildup, glaciation, sea level fluctuations, mass extinctions, and climate change."}]},{"leaf":false,"text":"(11)  Solid Earth. The student knows that the geosphere continuously changes over a range of time scales involving dynamic and complex interactions among Earth's subsystems. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFF1","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  compare the roles of erosion and deposition through the actions of water, wind, ice, gravity, and igneous activity by lava in constantly reshaping Earth's surface;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFF2","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  explain how plate tectonics accounts for geologic surface processes and features, including folds, faults, sedimentary basin formation, mountain building, and continental accretion;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFF3","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(C)  analyze changes in continental plate configurations such as Pangaea and their impact on the biosphere, atmosphere, and hydrosphere through time;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFF4","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(D)  interpret Earth surface features using a variety of methods such as satellite imagery, aerial photography, and topographic and geologic maps using appropriate technologies; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFF5","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(E)  evaluate the impact of changes in Earth's subsystems on humans such as earthquakes, tsunamis, volcanic eruptions, hurricanes, flooding, and storm surges and the impact of humans on Earth's subsystems such as population growth, fossil fuel burning, and use of fresh water."}]},{"leaf":false,"text":"(12)  Solid Earth. The student knows that Earth contains energy, water, mineral, and rock resources and that use of these resources impacts Earth's subsystems. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFF6","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  evaluate how the use of energy, water, mineral, and rock resources affects Earth's subsystems;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFF7","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  describe the formation of fossil fuels, including petroleum and coal;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFF8","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(C)  discriminate between renewable and nonrenewable resources based upon rate of formation and use;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFF9","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(D)  analyze the economics of resources from discovery to disposal, including technological advances, resource type, concentration and location, waste disposal and recycling, and environmental costs; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFFA","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(E)  explore careers that involve the exploration, extraction, production, use, and disposal of Earth's resources."}]},{"leaf":false,"text":"(13)  Fluid Earth. The student knows that the fluid Earth is composed of the hydrosphere, cryosphere, and atmosphere subsystems that interact on various time scales with the biosphere and geosphere. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFFB","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  quantify the components and fluxes within the hydrosphere such as changes in polar ice caps and glaciers, salt water incursions, and groundwater levels in response to precipitation events or excessive pumping;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFFC","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  analyze how global ocean circulation is the result of wind, tides, the Coriolis effect, water density differences, and the shape of the ocean basins;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFFD","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(C)  analyze the empirical relationship between the emissions of carbon dioxide, atmospheric carbon dioxide levels, and the average global temperature trends over the past 150 years;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFFE","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(D)  discuss mechanisms and causes such as selective absorbers, major volcanic eruptions, solar luminance, giant meteorite impacts, and human activities that result in significant changes in Earth's climate;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFFF","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(E)  investigate the causes and history of eustatic sea-level changes that result in transgressive and regressive sedimentary sequences; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F000","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(F)  discuss scientific hypotheses for the origin of life by abiotic chemical processes in an aqueous environment through complex geochemical cycles given the complexity of living systems."}]},{"leaf":false,"text":"(14)  Fluid Earth. The student knows that Earth's global ocean stores solar energy and is a major driving force for weather and climate through complex atmospheric interactions. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F001","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  analyze the uneven distribution of solar energy on Earth's surface, including differences in atmospheric transparency, surface albedo, Earth's tilt, duration of insolation, and differences in atmospheric and surface absorption of energy;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F002","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  investigate how the atmosphere is heated from Earth's surface due to absorption of solar energy, which is re-radiated as thermal energy and trapped by selective absorbers; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F003","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(C)  explain how thermal energy transfer between the ocean and atmosphere drives surface currents, thermohaline currents, and evaporation that influence climate."}]},{"leaf":false,"text":"(15)  Fluid Earth. The student knows that interactions among Earth's five subsystems influence climate and resource availability, which affect Earth's habitability. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F004","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  describe how changing surface-ocean conditions, including El Nio-Southern Oscillation, affect global weather and climate patterns;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F005","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  investigate evidence such as ice cores, glacial striations, and fossils for climate variability and its use in developing computer models to explain present and predict future climates;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F006","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(C)  quantify the dynamics of surface and groundwater movement such as recharge, discharge, evapotranspiration, storage, residence time, and sustainability;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F007","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(D)  explain the global carbon cycle, including how carbon exists in different forms within the five subsystems and how these forms affect life; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113F008","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(E)  analyze recent global ocean temperature data to predict the consequences of changing ocean temperature on evaporation, sea level, algal growth, coral bleaching, hurricane intensity, and biodiversity."}]}]},{"leaf":false,"text":"Environmental Systems","children":[{"leaf":false,"text":"(1)  Scientific processes. The student, for at least 40% of instructional time, conducts hands-on laboratory and field investigations using safe, environmentally appropriate, and ethical practices. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF87","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  demonstrate safe practices during laboratory and field investigations, including appropriate first aid responses to accidents that could occur in the field such as insect stings, animal bites, overheating, sprains, and breaks; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF88","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  demonstrate an understanding of the use and conservation of resources and the proper disposal or recycling of materials."}]},{"leaf":false,"text":"(2)  Scientific processes. The student uses scientific methods during laboratory and field investigations. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF89","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  know the definition of science and understand that it has limitations, as specified in subsection (b)(2) of this section;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF8A","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  know that scientific hypotheses are tentative and testable statements that must be capable of being supported or not supported by observational evidence. Hypotheses of durable explanatory power which have been tested over a wide variety of conditions are incorporated into theories;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF8B","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(C)  know that scientific theories are based on natural and physical phenomena and are capable of being tested by multiple independent researchers. Unlike hypotheses, scientific theories are well-established and highly-reliable explanations, but may be subject to change as new areas of science and new technologies are developed;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF8C","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(D)  distinguish between scientific hypotheses and scientific theories;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF8D","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(E)  follow or plan and implement investigative procedures, including making observations, asking questions, formulating testable hypotheses, and selecting equipment and technology;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF8E","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(F)  collect data individually or collaboratively, make measurements with precision and accuracy, record values using appropriate units, and calculate statistically relevant quantities to describe data, including mean, median, and range;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF8F","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(G)  demonstrate the use of course apparatuses, equipment, techniques, and procedures, including meter sticks, rulers, pipettes, graduated cylinders, triple beam balances, timing devices, pH meters or probes, thermometers, calculators, computers, Internet access, turbidity testing devices, hand magnifiers, work and disposable gloves, compasses, first aid kits, binoculars, field guides, water quality test kits or probes, soil test kits or probes, 100-foot appraiser's tapes, tarps, shovels, trowels, screens, buckets, and rock and mineral samples;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF90","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(H)  use a wide variety of additional course apparatuses, equipment, techniques, materials, and procedures as appropriate such as air quality testing devices, cameras, flow meters, Global Positioning System (GPS) units, Geographic Information System (GIS) software, computer models, densiometers, clinometers, and field journals;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF91","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(I)  organize, analyze, evaluate, build models, make inferences, and predict trends from data;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF92","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(J)  perform calculations using dimensional analysis, significant digits, and scientific notation; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF93","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(K)  communicate valid conclusions supported by the data through methods such as lab reports, labeled drawings, graphic organizers, journals, summaries, oral reports, and technology-based reports."}]},{"leaf":false,"text":"(3)  Scientific processes. The student uses critical thinking, scientific reasoning, and problem solving to make informed decisions within and outside the classroom. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF94","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  in all fields of science, analyze, evaluate, and critique scientific explanations by using empirical evidence, logical reasoning, and experimental and observational testing, including examining all sides of scientific evidence of those scientific explanations, so as to encourage critical thinking by the student;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF95","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  communicate and apply scientific information extracted from various sources such as current events, news reports, published journal articles, and marketing materials;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF96","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(C)  draw inferences based on data related to promotional materials for products and services;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF97","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(D)  evaluate the impact of research on scientific thought, society, and the environment;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF98","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(E)  describe the connection between environmental science and future careers; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF99","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(F)  research and describe the history of environmental science and contributions of scientists."}]},{"leaf":false,"text":"(4)  Science concepts. The student knows the relationships of biotic and abiotic factors within habitats, ecosystems, and biomes. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF9A","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  identify native plants and animals using a dichotomous key;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF9B","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  assess the role of native plants and animals within a local ecosystem and compare them to plants and animals in ecosystems within four other biomes;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF9C","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(C)  diagram abiotic cycles, including the rock, hydrologic, carbon, and nitrogen cycles;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF9D","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(D)  make observations and compile data about fluctuations in abiotic cycles and evaluate the effects of abiotic factors on local ecosystems and local biomes;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF9E","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(E)  measure the concentration of solute, solvent, and solubility of dissolved substances such as dissolved oxygen, chlorides, and nitrates and describe their impact on an ecosystem;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF9F","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(F)  predict how the introduction or removal of an invasive species may alter the food chain and affect existing populations in an ecosystem;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFA0","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(G)  predict how species extinction may alter the food chain and affect existing populations in an ecosystem; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFA1","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(H)  research and explain the causes of species diversity and predict changes that may occur in an ecosystem if species and genetic diversity is increased or reduced."}]},{"leaf":false,"text":"(5)  Science concepts. The student knows the interrelationships among the resources within the local environmental system. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFA2","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  summarize methods of land use and management and describe its effects on land fertility;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFA3","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  identify source, use, quality, management, and conservation of water;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFA4","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(C)  document the use and conservation of both renewable and non-renewable resources as they pertain to sustainability;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFA5","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(D)  identify renewable and non-renewable resources that must come from outside an ecosystem such as food, water, lumber, and energy;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFA6","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(E)  analyze and evaluate the economic significance and interdependence of resources within the environmental system; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFA7","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(F)  evaluate the impact of waste management methods such as reduction, reuse, recycling, and composting on resource availability."}]},{"leaf":false,"text":"(6)  Science concepts. The student knows the sources and flow of energy through an environmental system. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFA8","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  define and identify the components of the geosphere, hydrosphere, cryosphere, atmosphere, and biosphere and the interactions among them;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFA9","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  describe and compare renewable and non-renewable energy derived from natural and alternative sources such as oil, natural gas, coal, nuclear, solar, geothermal, hydroelectric, and wind;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFAA","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(C)  explain the flow of energy in an ecosystem, including conduction, convection, and radiation;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFAB","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(D)  investigate and explain the effects of energy transformations in terms of the laws of thermodynamics within an ecosystem; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFAC","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(E)  investigate and identify energy interactions in an ecosystem."}]},{"leaf":false,"text":"(7)  Science concepts. The student knows the relationship between carrying capacity and changes in populations and ecosystems. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFAD","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  relate carrying capacity to population dynamics;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFAE","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  calculate birth rates and exponential growth of populations;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFAF","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(C)  analyze and predict the effects of non-renewable resource depletion; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFB0","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(D)  analyze and make predictions about the impact on populations of geographic locales due to diseases, birth and death rates, urbanization, and natural events such as migration and seasonal changes."}]},{"leaf":false,"text":"(8)  Science concepts. The student knows that environments change naturally. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFB1","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  analyze and describe the effects on areas impacted by natural events such as tectonic movement, volcanic events, fires, tornadoes, hurricanes, flooding, tsunamis, and population growth;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFB2","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  explain how regional changes in the environment may have a global effect;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFB3","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(C)  examine how natural processes such as succession and feedback loops restore habitats and ecosystems;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFB4","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(D)  describe how temperature inversions impact weather conditions, including El Nio and La Nia oscillations; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFB5","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(E)  analyze the impact of temperature inversions on global warming, ice cap and glacial melting, and changes in ocean currents and surface temperatures."}]},{"leaf":false,"text":"(9)  Science concepts. The student knows the impact of human activities on the environment. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFB6","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  identify causes of air, soil, and water pollution, including point and nonpoint sources;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFB7","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  investigate the types of air, soil, and water pollution such as chlorofluorocarbons, carbon dioxide, pH, pesticide runoff, thermal variations, metallic ions, heavy metals, and nuclear waste;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFB8","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(C)  examine the concentrations of air, soil, and water pollutants using appropriate units;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFB9","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(D)  describe the effect of pollution on global warming, glacial and ice cap melting, greenhouse effect, ozone layer, and aquatic viability;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFBA","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(E)  evaluate the effect of human activities, including habitat restoration projects, species preservation efforts, nature conservancy groups, hunting, fishing, ecotourism, all terrain vehicles, and small personal watercraft, on the environment;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFBB","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(F)  evaluate cost-benefit trade-offs of commercial activities such as municipal development, farming, deforestation, over-harvesting, and mining;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFBC","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(G)  analyze how ethical beliefs can be used to influence scientific practices such as methods for increasing food production;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFBD","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(H)  analyze and evaluate different views on the existence of global warming;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFBE","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(I)  discuss the impact of research and technology on social ethics and legal practices in situations such as the design of new buildings, recycling, or emission standards;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFBF","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(J)  research the advantages and disadvantages of \"going green\" such as organic gardening and farming, natural methods of pest control, hydroponics, xeriscaping, energy-efficient homes and appliances, and hybrid cars;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFC0","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(K)  analyze past and present local, state, and national legislation, including Texas automobile emissions regulations, the National Park Service Act, the Clean Air Act, the Clean Water Act, the Soil and Water Resources Conservation Act, and the Endangered Species Act; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EFC1","dcterms_educationLevel":[{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(L)  analyze past and present international treaties and protocols such as the environmental Antarctic Treaty System, Montreal Protocol, and Kyoto Protocol."}]}]},{"leaf":false,"text":"Integrated Physics and Chemistry","children":[{"leaf":false,"text":"(1)  Scientific processes. The student, for at least 40% of instructional time, conducts laboratory and field investigations using safe, environmentally appropriate, and ethical practices. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF5F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(A)  demonstrate safe practices during laboratory and field investigations; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF60","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(B)  demonstrate an understanding of the use and conservation of resources and the proper disposal or recycling of materials."}]},{"leaf":false,"text":"(2)  Scientific processes. The student uses scientific methods during laboratory and field investigations. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF61","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(A)  know the definition of science and understand that it has limitations, as specified in subsection (b)(2) of this section;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF62","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(B)  plan and implement investigative procedures, including asking questions, formulating testable hypotheses, and selecting equipment and technology;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF63","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(C)  collect data and make measurements with precision;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF64","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(D)  organize, analyze, evaluate, make inferences, and predict trends from data; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF65","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(E)  communicate valid conclusions."}]},{"leaf":false,"text":"(3)  Scientific processes. The student uses critical thinking, scientific reasoning, and problem solving to make informed decisions. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF66","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(A)  in all fields of science, analyze, evaluate, and critique scientific explanations by using empirical evidence, logical reasoning, and experimental and observational testing, including examining all sides of scientific evidence of those scientific explanations, so as to encourage critical thinking by the student;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF67","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(B)  communicate and apply scientific information extracted from various sources such as current events, news reports, published journal articles, and marketing materials;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF68","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(C)  draw inferences based on data related to promotional materials for products and services;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF69","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(D)  evaluate the impact of research on scientific thought, society, and the environment;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF6A","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(E)  describe connections between physics and chemistry and future careers; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF6B","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(F)  research and describe the history of physics and chemistry and contributions of scientists."}]},{"leaf":false,"text":"(4)  Science concepts. The student knows concepts of force and motion evident in everyday life. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF6C","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(A)  describe and calculate an object's motion in terms of position, displacement, speed, and acceleration;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF6D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(B)  measure and graph distance and speed as a function of time using moving toys;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF6E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(C)  investigate how an object's motion changes only when a net force is applied, including activities and equipment such as toy cars, vehicle restraints, sports activities, and classroom objects;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF6F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(D)  assess the relationship between force, mass, and acceleration, noting the relationship is independent of the nature of the force, using equipment such as dynamic carts, moving toys, vehicles, and falling objects;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF70","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(E)  apply the concept of conservation of momentum using action and reaction forces such as students on skateboards;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF71","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(F)  describe the gravitational attraction between objects of different masses at different distances, including satellites; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF72","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(G)  examine electrical force as a universal force between any two charged objects and compare the relative strength of the electrical force and gravitational force."}]},{"leaf":false,"text":"(5)  Science concepts. The student recognizes multiple forms of energy and knows the impact of energy transfer and energy conservation in everyday life. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF73","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(A)  recognize and demonstrate that objects and substances in motion have kinetic energy such as vibration of atoms, water flowing down a stream moving pebbles, and bowling balls knocking down pins;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF74","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(B)  demonstrate common forms of potential energy, including gravitational, elastic, and chemical, such as a ball on an inclined plane, springs, and batteries;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF75","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(C)  demonstrate that moving electric charges produce magnetic forces and moving magnets produce electric forces;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF76","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(D)  investigate the law of conservation of energy;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF77","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(E)  investigate and demonstrate the movement of thermal energy through solids, liquids, and gases by convection, conduction, and radiation such as in weather, living, and mechanical systems;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF78","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(F)  evaluate the transfer of electrical energy in series and parallel circuits and conductive materials;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF79","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(G)  explore the characteristics and behaviors of energy transferred by waves, including acoustic, seismic, light, and waves on water as they superpose on one another, bend around corners, reflect off surfaces, are absorbed by materials, and change direction when entering new materials;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF7A","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(H)  analyze energy conversions such as those from radiant, nuclear, and geothermal sources; fossil fuels such as coal, gas, oil; and the movement of water or wind; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF7B","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(I)  critique the advantages and disadvantages of various energy sources and their impact on society and the environment."}]},{"leaf":false,"text":"(6)  Science concepts. The student knows that relationships exist between the structure and properties of matter. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF7C","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(A)  examine differences in physical properties of solids, liquids, and gases as explained by the arrangement and motion of atoms, ions, or molecules of the substances and the strength of the forces of attraction between those particles;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF7D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(B)  relate chemical properties of substances to the arrangement of their atoms or molecules;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF7E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(C)  analyze physical and chemical properties of elements and compounds such as color, density, viscosity, buoyancy, boiling point, freezing point, conductivity, and reactivity;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF7F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(D)  relate the physical and chemical behavior of an element, including bonding and classification, to its placement on the Periodic Table; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF80","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(E)  relate the structure of water to its function as a solvent and investigate the properties of solutions and factors affecting gas and solid solubility, including nature of solute, temperature, pressure, pH, and concentration."}]},{"leaf":false,"text":"(7)  Science concepts. The student knows that changes in matter affect everyday life. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF81","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(A)  investigate changes of state as it relates to the arrangement of particles of matter and energy transfer;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF82","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(B)  recognize that chemical changes can occur when substances react to form different substances and that these interactions are largely determined by the valence electrons;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF83","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(C)  demonstrate that mass is conserved when substances undergo chemical change and that the number and kind of atoms are the same in the reactants and products;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF84","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(D)  analyze energy changes that accompany chemical reactions such as those occurring in heat packs, cold packs, and glow sticks and classify them as exothermic or endothermic reactions;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF85","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(E)  describe types of nuclear reactions such as fission and fusion and their roles in applications such as medicine and energy production; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF86","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(F)  research and describe the environmental and economic impact of the end-products of chemical reactions such as those that may result in acid rain, degradation of water and air quality, and ozone depletion."}]}]},{"leaf":false,"text":"Physics","children":[{"leaf":false,"text":"(1)  Scientific processes. The student conducts investigations, for at least 40% of instructional time, using safe, environmentally appropriate, and ethical practices. These investigations must involve actively obtaining and analyzing data with physical equipment, but may also involve experimentation in a simulated environment as well as field observations that extend beyond the classroom. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF2C","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  demonstrate safe practices during laboratory and field investigations; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF2D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  demonstrate an understanding of the use and conservation of resources and the proper disposal or recycling of materials."}]},{"leaf":false,"text":"(2)  Scientific processes. The student uses a systematic approach to answer scientific laboratory and field investigative questions. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF2E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  know the definition of science and understand that it has limitations, as specified in subsection (b)(2) of this section;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF2F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  know that scientific hypotheses are tentative and testable statements that must be capable of being supported or not supported by observational evidence. Hypotheses of durable explanatory power which have been tested over a wide variety of conditions are incorporated into theories;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF30","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(C)  know that scientific theories are based on natural and physical phenomena and are capable of being tested by multiple independent researchers. Unlike hypotheses, scientific theories are well-established and highly-reliable explanations, but may be subject to change as new areas of science and new technologies are developed;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF31","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(D)  distinguish between scientific hypotheses and scientific theories;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF32","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(E)  design and implement investigative procedures, including making observations, asking well-defined questions, formulating testable hypotheses, identifying variables, selecting appropriate equipment and technology, and evaluating numerical answers for reasonableness;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF33","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(F)  demonstrate the use of course apparatus, equipment, techniques, and procedures, including multimeters (current, voltage, resistance), triple beam balances, batteries, clamps, dynamics demonstration equipment, collision apparatus, data acquisition probes, discharge tubes with power supply (H, He, Ne, Ar), hand-held visual spectroscopes, hot plates, slotted and hooked lab masses, bar magnets, horseshoe magnets, plane mirrors, convex lenses, pendulum support, power supply, ring clamps, ring stands, stopwatches, trajectory apparatus, tuning forks, carbon paper, graph paper, magnetic compasses, polarized film, prisms, protractors, resistors, friction blocks, mini lamps (bulbs) and sockets, electrostatics kits, 90-degree rod clamps, metric rulers, spring scales, knife blade switches, Celsius thermometers, meter sticks, scientific calculators, graphing technology, computers, cathode ray tubes with horseshoe magnets, ballistic carts or equivalent, resonance tubes, spools of nylon thread or string, containers of iron filings, rolls of white craft paper, copper wire, Periodic Table, electromagnetic spectrum charts, slinky springs, wave motion ropes, and laser pointers;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF34","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(G)  use a wide variety of additional course apparatus, equipment, techniques, materials, and procedures as appropriate such as ripple tank with wave generator, wave motion rope, micrometer, caliper, radiation monitor, computer, ballistic pendulum, electroscope, inclined plane, optics bench, optics kit, pulley with table clamp, resonance tube, ring stand screen, four inch ring, stroboscope, graduated cylinders, and ticker timer;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF35","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(H)  make measurements with accuracy and precision and record data using scientific notation and International System (SI) units;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF36","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(I)  identify and quantify causes and effects of uncertainties in measured data;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF37","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(J)  organize and evaluate data and make inferences from data, including the use of tables, charts, and graphs;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF38","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(K)  communicate valid conclusions supported by the data through various methods such as lab reports, labeled drawings, graphic organizers, journals, summaries, oral reports, and technology-based reports; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF39","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(L)  express and manipulate relationships among physical variables quantitatively, including the use of graphs, charts, and equations."}]},{"leaf":false,"text":"(3)  Scientific processes. The student uses critical thinking, scientific reasoning, and problem solving to make informed decisions within and outside the classroom. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF3A","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  in all fields of science, analyze, evaluate, and critique scientific explanations by using empirical evidence, logical reasoning, and experimental and observational testing, including examining all sides of scientific evidence of those scientific explanations, so as to encourage critical thinking by the student;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF3B","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  communicate and apply scientific information extracted from various sources such as current events, news reports, published journal articles, and marketing materials;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF3C","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(C)  draw inferences based on data related to promotional materials for products and services;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF3D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(D)  explain the impacts of the scientific contributions of a variety of historical and contemporary scientists on scientific thought and society;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF3E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(E)  research and describe the connections between physics and future careers; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF3F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(F)  express and interpret relationships symbolically in accordance with accepted theories to make predictions and solve problems mathematically, including problems requiring proportional reasoning and graphical vector addition."}]},{"leaf":false,"text":"(4)  Science concepts. The student knows and applies the laws governing motion in a variety of situations. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF40","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  generate and interpret graphs and charts describing different types of motion, including the use of real-time technology such as motion detectors or photogates;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF41","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  describe and analyze motion in one dimension using equations with the concepts of distance, displacement, speed, average velocity, instantaneous velocity, and acceleration;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF42","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(C)  analyze and describe accelerated motion in two dimensions using equations, including projectile and circular examples;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF43","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(D)  calculate the effect of forces on objects, including the law of inertia, the relationship between force and acceleration, and the nature of force pairs between objects;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF44","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(E)  develop and interpret free-body force diagrams; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF45","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(F)  identify and describe motion relative to different frames of reference."}]},{"leaf":false,"text":"(5)  Science concepts. The student knows the nature of forces in the physical world. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF46","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  research and describe the historical development of the concepts of gravitational, electromagnetic, weak nuclear, and strong nuclear forces;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF47","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  describe and calculate how the magnitude of the gravitational force between two objects depends on their masses and the distance between their centers;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF48","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(C)  describe and calculate how the magnitude of the electrical force between two objects depends on their charges and the distance between them;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF49","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(D)  identify examples of electric and magnetic forces in everyday life;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF4A","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(E)  characterize materials as conductors or insulators based on their electrical properties;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF4B","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(F)  design, construct, and calculate in terms of current through, potential difference across, resistance of, and power used by electric circuit elements connected in both series and parallel combinations;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF4C","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(G)  investigate and describe the relationship between electric and magnetic fields in applications such as generators, motors, and transformers; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF4D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(H)  describe evidence for and effects of the strong and weak nuclear forces in nature."}]},{"leaf":false,"text":"(6)  Science concepts. The student knows that changes occur within a physical system and applies the laws of conservation of energy and momentum. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF4E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  investigate and calculate quantities using the work-energy theorem in various situations;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF4F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  investigate examples of kinetic and potential energy and their transformations;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF50","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(C)  calculate the mechanical energy of, power generated within, impulse applied to, and momentum of a physical system;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF51","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(D)  demonstrate and apply the laws of conservation of energy and conservation of momentum in one dimension;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF52","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(E)  describe how the macroscopic properties of a thermodynamic system such as temperature, specific heat, and pressure are related to the molecular level of matter, including kinetic or potential energy of atoms;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF53","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(F)  contrast and give examples of different processes of thermal energy transfer, including conduction, convection, and radiation; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF54","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(G)  analyze and explain everyday examples that illustrate the laws of thermodynamics, including the law of conservation of energy and the law of entropy."}]},{"leaf":false,"text":"(7)  Science concepts. The student knows the characteristics and behavior of waves. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF55","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  examine and describe oscillatory motion and wave propagation in various types of media;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF56","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  investigate and analyze characteristics of waves, including velocity, frequency, amplitude, and wavelength, and calculate using the relationship between wavespeed, frequency, and wavelength;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF57","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(C)  compare characteristics and behaviors of transverse waves, including electromagnetic waves and the electromagnetic spectrum, and characteristics and behaviors of longitudinal waves, including sound waves;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF58","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(D)  investigate behaviors of waves, including reflection, refraction, diffraction, interference, resonance, and the Doppler effect;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF59","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(E)  describe and predict image formation as a consequence of reflection from a plane mirror and refraction through a thin convex lens; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF5A","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(F)  describe the role of wave characteristics and behaviors in medical and industrial applications."}]},{"leaf":false,"text":"(8)  Science concepts. The student knows simple examples of atomic, nuclear, and quantum phenomena. The student is expected to:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF5B","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(A)  describe the photoelectric effect and the dual nature of light;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF5C","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(B)  compare and explain the emission spectra produced by various atoms;"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF5D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(C)  describe the significance of mass-energy equivalence and apply it in explanations of phenomena such as nuclear stability, fission, and fusion; and"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113EF5E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"(D)  give examples of applications of atomic and nuclear phenomena such as radiation therapy, diagnostic imaging, and nuclear power and examples of applications of quantum phenomena such as digital cameras."}]}]}]}]