[{"leaf":false,"text":"1.0 CONTENT STANDARD: POLITICAL SCIENCE- Students will understand the historical development and current status of the fundamental concepts and processes of authority, power, and influence, with particular emphasis on democratic skills and attitudes necessary to become responsible citizens.","children":[{"leaf":false,"text":"(PreK-3 Standard) POLITICAL SCIENCE – Students will understand the historical development and current status of the democratic principles and the development of skills and attitudes necessary to become responsible citizens","children":[{"leaf":false,"text":"A. The Foundations and Function of Government","children":[{"leaf":false,"text":"1. Identify the importance of rules","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D74","dcterms_educationLevel":[{"prefLabel":"Pre-K"}],"text":"a. Recognize why people have rules at home and at school"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D75","dcterms_educationLevel":[{"prefLabel":"Pre-K"}],"text":"b. Generate and follow classroom rules, such as taking turns, walking inside, and forming a line that promote order and safety in the classroom"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D78","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"a. Identify reasons for classroom and school rules, such as maintaining order and keeping the community safe"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D7A","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"b. Recognize rules help promote fairness, responsible behavior, and privacy"}]},{"leaf":false,"text":"1. Explain the importance of rules","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D80","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"a. Explain how rules promote fairness, responsibility, and privacy in the school and community"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D82","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"b. Identify leadership positions in the school and community and recognize their authority in keeping students safe, following rules, and maintaining order"}]},{"leaf":false,"text":"1. Explain how rules and laws are made and necessary to maintain order and protect citizens","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D84","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"a. Explain how school and community rules promote orderliness, fairness, responsibility, privacy, and safety"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D86","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"b. Identify leadership positions and organizations in the community and explain how they can be helpful in maintaining safety and order"}]},{"leaf":false,"text":"1. Explain the role of individuals and groups in creating rules and laws to maintain order, protect citizens, and provide services","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D88","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"a. Identify local government leaders, such as the mayor, county council members or commissioners, and county executive and explain their role in protecting citizens and maintaining order"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D8A","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"b. Explain the consequences of violating rules and laws"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D8C","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"c. Describe the selection process and duties of local officials who make, apply, and enforce laws through government"}]},{"leaf":false,"text":"2. Identify symbols and practices associated with the United States of America","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D8E","dcterms_educationLevel":[{"prefLabel":"Pre-K"}],"text":"a. Recognize symbols, such as the American flag"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D90","dcterms_educationLevel":[{"prefLabel":"Pre-K"}],"text":"b. Recognize that the Pledge of Allegiance is a practice that happens in school"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D94","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"a. Identify common symbols, such as the American Flag, and Statue of Liberty"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D95","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"b. Recognize that saying the Pledge of Allegiance and singing \"The Star-Spangled Banner\" are practices associated with being a citizen"}]},{"leaf":false,"text":"2. Identify and discuss the meaning of symbols and practices associated with the United States of America","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D97","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"a. Identify and discuss the meaning of common symbols associated with the United States of America, such as bald eagle, White House, and the Statue of Liberty"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D99","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"b. Describe how actions, such as pledging allegiance to the American flag and singing \"The Star-Spangled Banner\" and \"America\" are associated with being a citizen"}]},{"leaf":false,"text":"2. Explain how democratic skills and attitudes are associated with being a responsible citizen","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D9A","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"a. Use appropriate informational text to develop an understanding of democratic skills and attitudes, such as rights and responsibilities, respect, fairness, honesty, loyalty, and courage"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D9C","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"b. Connect certain people, symbols, songs and poems to the ideals they represent, such as George Washington portrays leadership, the American flag represents loyalty and respect, and the Star Spangled Banner represents courage and freedom"}]},{"leaf":false,"text":"2. Explain how certain practices are connected with the democratic principles (skills, attitudes, and dispositions) of being a citizen","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D9E","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"a. Identify and explain democratic principles, such as individual rights and responsibilities, patriotism, common good, justice and equality"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D9F","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"b. Describe practices such as voting, following rules, volunteering, and recognizing national holidays associated with democratic principles"}]}]},{"leaf":false,"text":"B. Individual and Group Participation in the Political System","children":[{"leaf":false,"text":"1. Recognize people important to the American political system","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DA1","dcterms_educationLevel":[{"prefLabel":"Pre-K"}],"text":"a. Respond to informational text read aloud to develop an awareness of the contributions made by certain individuals that are remembered during the observance of national holidays and celebrations"}]},{"leaf":false,"text":"1. Identify people important to the American political system","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DA3","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"a. Identify the contributions of people, past and present, such as George Washington, Rosa Parks, and the current president"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DA4","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"b. Use informational text to identify and discuss the contributions of individuals recognized on national holidays, such as Martin Luther King, Jr. Day and Presidents' Day"}]},{"leaf":false,"text":"1. Identify and describe people important to the American political system","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DA6","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"a. Describe the contributions of people, past and present, such as George Washington, Abraham Lincoln, Martin Luther King, Jr. and the current president"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DA8","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"b. Explain how contributions of people may be recognized with holidays and celebrations, such as Presidents' Day and Veterans' Day"}]},{"leaf":false,"text":"1. Explain how contributions and events are important to the American political system","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DAA","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"a. Describe the contributions of local government leaders and current leaders of their school and community, such as county executives, county council or mayor, and city council"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DAC","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"b. Explain how contributions of people recognized in holidays, such as Memorial Day and Constitution Day, represent democratic beliefs and attitudes, that include rights and responsibilities, loyalty, respect, and courage"}]},{"leaf":false,"text":"1. Explain how people and events have contributed to the American political system.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DAF","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"a. Describe the contributions of local government leaders such as county executives, county council, mayor and city council"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DB0","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"b. Describe the contributions of people who contributed to the common good of society"}]},{"leaf":false,"text":"2. Analyze the role of individual and group participation in creating a supportive community","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DB2","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"a. Explain the decision making process used to accomplish a community goal or solve a community problem"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DB4","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"b. Explain the roles and responsibilities of effective citizens in a political process"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DB5","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"c. Describe the actions of people who have made a positive difference in their community, such as community and civic leaders, and organizations"}]}]},{"leaf":false,"text":"C. Protecting Rights and Maintaining Order","children":[{"leaf":false,"text":"1. Identify the roles, rights, and responsibilities of being a member of the family and school","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DB6","dcterms_educationLevel":[{"prefLabel":"Pre-K"}],"text":"a. Identify roles of family members"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DB8","dcterms_educationLevel":[{"prefLabel":"Pre-K"}],"text":"b. Identify the roles of members of the school, such as principal, teacher, and nurse"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DBA","dcterms_educationLevel":[{"prefLabel":"Pre-K"}],"text":"c. Identify and discuss rights, responsibilities and choices in the classroom and family"}]},{"leaf":false,"text":"1. Describe the roles, rights, and responsibilities of being a member of the family and school","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DBB","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"a. Describe the roles, rights, and responsibilities of family members"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DBD","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"b. Describe the roles of members of the school, such as principal, crossing guard, bus drivers, and teachers"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DBE","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"c. Identify and describe rights, and responsibilities n the classroom and family"}]},{"leaf":false,"text":"1. Describe the rights and responsibilities of being a participating member of the family, school and neighborhood","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DC0","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"a. Identify the rights, responsibilities and choices that students have in the family, school, and neighborhood"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DC1","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"b. Demonstrate ways to work together to maintain a clean and safe home, school, and neighborhood environment"}]},{"leaf":false,"text":"1. Describe the rights and responsibilities of being a participating member of the school and the community","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DC2","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"a. Recognize and describe how making choices affects self, family, school, and community"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DC3","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"b. Identify concerns in the community, such as safety issues and pollution problems and ways to resolve these concerns"}]},{"leaf":false,"text":"1. Explain the rights and responsibilities of being a member of the school and the community","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DC4","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"a. Describe the responsibilities of being an effective citizen, such as cleaning up your neighborhood, being informed, obeying rules and laws, participating in class decisions, and volunteering"}]}]}]},{"leaf":false,"text":"A. The Foundations and Function of Government","children":[{"leaf":false,"text":"1. Trace how the political structure in early Maryland developed and changed over time","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F61","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"a. Describe how the colony of Maryland was established and governed including the establishment of rule of law and power with authority, such as Proprietorships, Royal Governor, and early General Assembly"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F62","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"b. Explain the importance of the Office of the Governor and the Court of Appeals"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F63","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"c. Outline the structure and function of the Maryland General Assembly and the roles of state senators and delegates"}]},{"leaf":false,"text":"1. Examine the early foundations, functions, and purposes of government","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F64","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"a. Describe how the European policies affected the interactions of explorers and colonists with Native Americans, such as the French and Indian War"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F65","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"b. Explain and clarify how Europe's philosophies and policies affected the political structure of the early American Colonies"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F66","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"c. Identify and summarize how democratic principles, such as rule of law, limited government, consent of the governed, popular sovereignty, representative democracy, and the limitation of power influenced our founding documents"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F67","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"d. Trace the development of early democratic ideas and practices that emerged during the early colonial period, including the significance of representative assemblies and town meetings"}]},{"leaf":false,"text":"1. Examine the necessity and purpose of government in early world history","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F68","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"a. Identify and compare forms of government and various distributions of power, such as those found in ancient civilizations, dynastic China, absolute and constitutional monarchies"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F69","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"b. Summarize the positions taken on government by political philosophers from early civilizations through the Middle Ages"}]},{"leaf":false,"text":"1. Analyze the characteristics and structure of various systems of government around the world","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F6A","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"a. Describe and compare the advantages and disadvantages of limited governments, such as representative democracy and parliamentary democracy"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F6B","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"b. Compare the advantages and disadvantages of unlimited government, such as authoritarian and dictatorships"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F6C","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"c. Explain and demonstrate how nation-states interact with each other"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F6D","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"d. Using multi-perspectives, describe and trace how past events assisted or impeded the development of nations, such as the founding of Israel, the break up of the Soviet Union"}]},{"leaf":false,"text":"1. Investigate the evolution of the U.S. political system as expressed in the United States Constitution","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F6F","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"a. Compare the confederate form of government under the Articles of Confederation with the federal form under the Constitution"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F70","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"b. Explain and summarize the principles of federalism, popular sovereignty, rule of law, consent of the governed, separation of powers, checks and balances, majority rule, limited government and how they protect individual rights and impact the functioning of government"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F71","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"c. Compare how the powers and functions of the three branches of government are divided and how they are shared to protect popular sovereignty"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F72","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"d. Explain and summarize how the supremacy of the national government was defined by events, such as Shay's Rebellion and early decisions of the Supreme Court, such as McCulloch v. Maryland (1819)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F73","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"e. Evaluate the role and responsibility of a legislator in a representative democracy"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F74","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"f. Analyze the impact of precedence in the office of the President, such as the establishment of a cabinet and foreign policy"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F75","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"g. Summarize an individual's legal obligations to obey the law, pay taxes, serve on a jury and serve as a witness"}]},{"leaf":false,"text":"2. Analyze the documents, and democratic ideas that developed in the Maryland Colony","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F76","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"a. Analyze how colonial law influenced individuals in Maryland and other colonies, such as indentured servants contracts, Tolerance Acts of 1649, Maryland Charter of 1632"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F77","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"b. Describe how the Maryland State Constitution includes democratic principles and values"}]},{"leaf":false,"text":"2. Analyze the historic events, documents, and practices that are the foundations of our political systems","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F78","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"a. Explain and report on the early examples of self-government, such as the Mayflower Compact and the House of Burgesses"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F79","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"b. Analyze the successes and failures in meeting the challenges of governing under Articles of Confederation"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F7A","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"c. Explain the significance of principles in the development of the Declaration of Independence, Articles of Confederation, Preamble, U.S. Constitution and the Bill of Rights"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F7B","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"d. Describe the three branches of government and their individual powers and responsibilities, such as separation of powers and checks and balances"}]},{"leaf":false,"text":"2. Analyze the historic events, documents, and practices in early world history that are the foundations of political systems","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F7C","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"a. Examine and report on the roots of democratic principles in World History, such as Sumerian written law, Hammurabi's Code, Greek city-states, Roman Republicanism, and the British Constitution (Magna Carta, English Bill of Rights)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F7D","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"b. Examine the decline of feudalism and the emergence of monarchies"}]},{"leaf":false,"text":"2. Analyze the historic events, documents, and practices that are the foundations of political systems around the world","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F7E","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"a. Examine and report examples of historic events, documents and practices that have influenced individuals and groups around the world, such as the UN Declaration of Rights, German reunification, the formation of NATO, and Apartheid"}]},{"leaf":false,"text":"2. Analyze the impact of historic documents and practices that became the foundations of the American political system during the early national period","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F7F","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"a. Evaluate the power and authority of the government on individuals"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F80","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"b. Identify the principles in European historic documents and show their connections to the development of American political ideology such as Magna Carta and English Bill of Rights"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F81","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"c. Explain how the philosophies of Hobbes, Locke and Montesquieu influenced the principles that shaped United States government"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F82","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"d. Describe the significance of principles in the development of the Declaration of Independence, Articles of Confederation, Preamble, U.S. Constitution and the Bill of Rights"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F83","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"e. Describe the major debates and compromises that occurred during the Constitutional Convention and interpret their effects on the ratification process"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F84","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"f. Describe the development of political parties and their effects on elections and political life"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F85","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"g. Evaluate the significance of the Civil War Amendments (13th, 14th and 15th) and how they protected individual rights"}]},{"leaf":false,"text":"3. Analyze the role of Maryland government regarding public policy and issues","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F86","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"a. Analyze perspectives and policies in Maryland regarding historic and current public issues"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F87","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"b. Explain the effect that regional interests have on shaping government policy in and around Maryland, such as Chesapeake Bay issues, availability of land for mining, land use"}]},{"leaf":false,"text":"3. Analyze the roles of colonial government regarding public policy and issues","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F88","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"a. Identify the effect that regional interests and perspectives had on shaping government policy, and compare such as middling class v. gentry, plantation owners v. proprietors"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F89","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"b. Analyze how geographic information influenced the formation of policy, such as the Proclamation of 1763"}]},{"leaf":false,"text":"3. Analyze the roles of institutions and governments in early world history regarding public policy and issues","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F8A","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"a. Describe the conflict between the church and the state in the formation and implementation of policy"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F8B","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"b. Analyze perspectives regarding issues in a feudal society, such as the church leaders v. lords of the manor, joining the Crusades, the growth of trade"}]},{"leaf":false,"text":"3. Analyze the roles of governments around the world regarding public policy and issues","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F8C","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"a. Evaluate the effectiveness of the various policies of governments in addressing issues, such as health, poverty, crime, security, and environmental concerns"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F8D","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"b. Analyze the effects that different world issues have on shaping international responses, such as rainforest conservation, pollution, climate change, and energy sources (oil drilling, coal, nuclear"}]},{"leaf":false,"text":"3. Evaluate roles and policies of the United States government regarding public policy and issues","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F8E","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"a. Examine the effect that national interests have on shaping government policy, such as the abolitionist movement and slavery, states' rights, and regional commerce"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F8F","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"b. Evaluate regional and international perspectives regarding the formation and implementation of public policy, such as Washington's Farewell Address, Monroe Doctrine, westward expansion, sectionalism, plantation holders in the South v. the industrialists in the North"}]}]},{"leaf":false,"text":"B. Individual and Group Participation in the Political System","children":[{"leaf":false,"text":"1. Analyze how individuals and groups contributed to the political system in Maryland","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F90","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"a. Describe the contributions of of 17th century English settlers who influenced the early political structure"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F91","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"b. Research the role of Marylanders who influenced the building of our new nation, such as the Sons of Liberty, William Paca, Charles Carroll, Thomas Stone, and Samuel Chase"}]},{"leaf":false,"text":"1. Analyze how individuals' roles and perspectives shape the American political system","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F92","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"a. Examine the contributions of people associated with the drafting of the Declaration of Independence and the framing of the Constitution, such as James Madison, Thomas Jefferson, John Jay, and George Washington"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F93","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"b. Examine how the federalists and anti-federalist perspectives influenced government"}]},{"leaf":false,"text":"1. Analyze the methods used by individuals and groups to shape governmental policy and actions in early world history","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F94","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"a. Compare methods used in early world history to change governments, such as coups, elections and revolts"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F95","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"b. Examine the role of citizens in Greek city-states and the Roman Republic/Empire"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F96","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"c. Examine how religion shaped and influenced government policy"}]},{"leaf":false,"text":"1. Analyze the methods used by individuals and groups to shape governmental policy and actions","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F97","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"a. Compare methods used to change governments, such as coups, elections and revolts"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F98","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"b. Evaluate ways citizens use, monitor and influence the formation and implementation of public policy"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F99","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"c. Describe how political parties and special interest groups influence and change government policy, such as third parties, and non-governmental organizations"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F9A","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"d. Analyze the role of media and public opinion in shaping government policy and action"}]},{"leaf":false,"text":"1. Analyze the influence of individuals and groups on shaping public policy","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F9B","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"a. Analyze the influence of the media on political life"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F9C","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"b. Evaluate ways the citizens should use, monitor and influence the formation and implementation of public policy"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F9D","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"c. Examine the roles and functions of political parties in the American system of government"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F9E","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"d. Explain how the media, interest groups, and public opinion affected elected officials and government policy prior to the Civil War"}]},{"leaf":false,"text":"2. Defend the importance of civic participation as a citizen of Maryland","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F9F","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"a. Identify various sources of information that are available to citizens to make political decisions"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FA0","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"b. Analyze ways people can participate in the political process including voting, petitioning elected officials, and volunteering"}]},{"leaf":false,"text":"2. Analyze the importance of civic participation as a citizen of the United States","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FA1","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"a. Analyze the usefulness of various sources of information used to make political decisions"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FA2","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"b. Compare ways people can participate in the political process including voting, petitioning elected officials, and volunteering"}]},{"leaf":false,"text":"2. Analyze the importance of civic participation as a citizen of early world history","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FA3","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"a. Analyze the usefulness of various sources of information used to make political decisions"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FA4","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"b. Explain why common people did not have a voice in ancient civilizations"}]},{"leaf":false,"text":"2. Analyze the importance of civic participation as a citizen of the world","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FA5","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"a. Analyze the relevancy of sources and perspectives of information such as internet sites and online newspapers"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FA6","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"b. Analyze the concept of a global citizen and how the awareness and responsibilities have changed during the information age"}]},{"leaf":false,"text":"2. Defend the importance of civic participation as a citizen of the United States","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FA7","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"a. Evaluate ways people can participate in the political process including voting, analyzing the media, petitioning elected officials, and volunteering"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FA8","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"b. Analyze the concept of citizenship and explain how the concept has changed from colonial times through Reconstruction"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FA9","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"c. Evaluate how various groups provide opportunities for individuals to participate in the political process"}]}]},{"leaf":false,"text":"C. Protecting Rights and Maintaining Order","children":[{"leaf":false,"text":"1. Describe rights and responsibilities of being a citizen in Maryland","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FAA","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"a. Describe responsibilities associated with certain basic rights of citizens, such as freedom of speech, religion, and press, and explain why these responsibilities are important"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FAB","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"b. Describe the role of Maryland state judiciary system"}]},{"leaf":false,"text":"1. Describe individual rights and responsibilities in the United States","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FAC","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"a. Describe responsibilities associated with certain basic rights of citizens, such as freedom of speech, religion, and press, and explain why these responsibilities are important"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FAD","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"b. Describe the power and responsibility of the Supreme Court including the power of judicial review"}]},{"leaf":false,"text":"1. Analyze the individual rights and responsibilities in an ancient world civilization","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FAE","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"a. Describe the importance of citizenship in ancient Rome and Greece"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FAF","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"b. Describe the significance of Hammurabi's Code and how it defined rights of citizens"}]},{"leaf":false,"text":"1. Examine the rights and responsibilities of being a citizen of the world","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FB0","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"a. Justify the responsibilities associated with certain human rights in a global society such as a commitment to world peace and the elimination of poverty."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FB1","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"b. Explain how international rules and laws protect individual rights and protect the common good, such as the U.N. Declaration of Human Rights, European Union membership, Geneva Conventions"}]},{"leaf":false,"text":"1. Examine the impact of governmental decisions on individual rights and responsibilities in the United States","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FB2","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"a. Describe responsibilities associated with certain basic rights of citizens, such as freedom of speech, religion, and press, and explain why these responsibilities are important"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FB3","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"b. Explain how rules and laws protect individual rights and protect the common good"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FB4","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"c. Explain the significance of the landmark U.S. Supreme Court case Marbury v. Madison which established judicial review"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FB5","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"d. Describe the expansion of the powers of the national government in the decision of the landmark U.S. Supreme Court case McCulloch v. Maryland"}]},{"leaf":false,"text":"2. Explain how Maryland government protects the rights of individuals and groups","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FB6","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"a. Describe the rule of law and explain how it impacts individuals and groups"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FB7","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"b. Describe the balance between private life and government in providing order and protecting rights"}]},{"leaf":false,"text":"2. Evaluate how the United States government protects the rights of individuals and groups","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FB9","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"a. Explain the balance between providing for the common good and protecting individual rights"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FBA","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"b. Analyze how government needs to provide more protection and order during times of crisis, such as the natural disasters and threats to national security"}]},{"leaf":false,"text":"2. Evaluate how ancient governments around the world protected or failed to protect the rights of individuals and groups","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FBB","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"a. Explain how the Roman Republic and the rule of the Senate affected individuals and groups"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FBC","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"b. Compare power and authority of rulers in Ancient Egypt, India, Persia and China v. the protection of citizens in Greek city-states"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FBD","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"c. Examine the balance between providing for the common good of the manor v. the rights of the individual serfs"}]},{"leaf":false,"text":"2. Analyze how governments, organizations, and policies around the world protect or fail to protect the rights of individuals and groups","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FBE","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"a. Analyze how the definition of the common good differs in limited and unlimited governments"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FBF","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"b. Debate the need to balance between providing for the common good and how protecting individual rights differ in governments around the world"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FC0","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"c. Describe the role of international organizations and policies in maintaining order during a time of crisis, such as the International Red Cross/Red Crescent, the United Nations, the Geneva Conventions, and the World Health Organization"}]},{"leaf":false,"text":"2. Explain how the United States government protected or failed to protect the rights of individuals and groups","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FC1","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"a. Describe significance and effects of the Emancipation Proclamation"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FC2","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"b. Describe methods that were used to deny civil rights to women, African Americans and Native Americans"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FC3","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"c. Examine the use of Presidential power in Lincoln's suspension of the writ of habeas corpus"}]},{"leaf":false,"text":"3. Examine the principle of due process","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FC4","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"a. Describe the due process protections in the Bill of Rights"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FC5","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"a. Identify how due process of law protects individuals"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FC6","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"b. Describe the due process protections in the Bill of Rights and the 14th Amendment"}]}]}]},{"leaf":false,"text":"2.0 CONTENT STANDARD: PEOPLES OF THE NATIONS AND WORLD –Student will understand the diversity and commonality, human interdependence, and global cooperation of the people of Maryland, the United States, and the World through a multicultural and a historic perspective.","children":[{"leaf":false,"text":"(PreK-3 STANDARD) PEOPLES OF THE NATIONS AND WORLD -Students will understand how people in Maryland, the United States and around the world are alike and different.","children":[{"leaf":false,"text":"A. Elements of Culture","children":[{"leaf":false,"text":"1. Identify themselves as individuals and members of families that have the same human needs as others","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DC5","dcterms_educationLevel":[{"prefLabel":"Pre-K"}],"text":"a. Identify the members of their families and the ways that they meet their human needs for food, clothing, shelter, and other commonalties, such as recreation, stories, and music"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DC6","dcterms_educationLevel":[{"prefLabel":"Pre-K"}],"text":"b. Use personal experiences, stories, and electronic media to demonstrate understanding that all people need food, clothing, and shelter"}]},{"leaf":false,"text":"1. Identify similarities and differences in people's characteristics, habits, and living patterns to describe how they meet the same human needs","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DC7","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"a. Use experiences, such as class trips, classroom visitors, stories, and electronic media, to give examples of different choices people make about meeting their human needs for food, clothing, shelter, and other commonalities, such as recreation, stories, and music"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DC9","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"b. Give examples of qualities, such as customs, interests, skills, and experiences that make individuals and families in their immediate environment unique"}]},{"leaf":false,"text":"1. Observe and describe ways that people of different cultural backgrounds meet human needs and contribute to the community","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DCA","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"a. Observe and describe ways people in their school and community meet human needs for food, clothing, shelter, and other commonalities, such as recreation, music, and stories"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DCB","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"b. Discuss and respect traditions and customs of families in the community"}]},{"leaf":false,"text":"1. Analyze elements of two different cultures and how each meets their human needs and contributes to the community","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DCC","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"a. Use fiction and non-fiction to compare the elements of two different cultures, and how they meet their human needs for food, shelter, and other commonalities such as recreation, music, and stories"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DCD","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"b. Explain ways people of different ages and/or cultural backgrounds can respect and help to pass on traditions and customs"}]},{"leaf":false,"text":"1. Analyze and describe elements of a multicultural setting","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DCE","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"a. Use fiction and non-fiction to compare the elements of several cultures and how they meet their human needs for clothing, food, shelter, recreation, education, stories, art, music, and language"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DCF","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"b. Explain how and why media, such as the internet, television, radio, and newspaper provide an opportunity to understand various perspectives about cultures"}]}]},{"leaf":false,"text":"B. Cultural Diffusion","children":[{"leaf":false,"text":"1. Recognize that individuals and groups share and borrow from other cultures","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DD0","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"a. Identify how families choose to share and borrow traditions from other cultures"}]},{"leaf":false,"text":"1. Explain that individuals and groups share and borrow from other cultures to form a community","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DD1","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"a. Give examples of how families in the community share and borrow customs and traditions from other cultures"}]},{"leaf":false,"text":"1. Identify and describe how individuals and groups share and borrow from other cultures","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DD2","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"a. Use non-fiction texts to identify and discuss examples of how communities borrow and share from other cultures"}]}]},{"leaf":false,"text":"C. Conflict and Compromise","children":[{"leaf":false,"text":"1. Identify how groups of people interact","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DD5","dcterms_educationLevel":[{"prefLabel":"Pre-K"}],"text":"a. Identify and demonstrate appropriate social skills, such as listening to others, settling disagreements, and taking turns that help people live, work and play together at home and in school"}]},{"leaf":false,"text":"1. Demonstrate how groups of people interact","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DD7","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"a. Identify, discuss, and demonstrate appropriate social skills, such as listening to the speaker, taking turns, settling disagreements, and reaching compromise at home and in school"}]},{"leaf":false,"text":"1. Explain how groups of people interact","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DD8","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"a. Describe, discuss, and demonstrate appropriate social skills necessary for working in a cooperative group, such as sharing concern, care, and respect among group members"}]},{"leaf":false,"text":"1. Analyze how groups of people interact","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DD9","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"a. Identify and demonstrate appropriate social skills necessary for working in a cooperative group such as sharing concern, compassion, and respect among group members"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DDA","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"b. Analyze how different points of view in school and community situations may result in compromise or conflict"}]}]},{"leaf":false,"text":"C. Conflict, Cooperation and Compromise","children":[{"leaf":false,"text":"1. Analyze ways in which people interact","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DD3","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"a. Identify and demonstrate appropriate social skills necessary for working in a cooperative group, such as sharing concern, care, and respect among group members"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DD4","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"b. Analyze how different points of view in school situations may result in compromise or conflict."}]}]}]},{"leaf":false,"text":"A. Elements of Culture","children":[{"leaf":false,"text":"1. Describe the various cultures of early societies of Maryland","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FC7","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"a. Define how culture influences people"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FC8","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"b. Describe the social, political and religious character of the earliest colonies"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FC9","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"c. Examine and describe the unique and diverse cultures of early native American societies"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FCA","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"d. Compare the early cultures of the Native Americans with the European settlers and their influences on each other"}]},{"leaf":false,"text":"1. Describe the various cultures of colonial societies and how the environment influenced them","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FCB","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"a. Describe how environment and location influenced the cultures and lifestyle"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FCC","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"b. Define the social, political, and religious components of the early colonies"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FCD","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"c. Analyze the religious beliefs of early settlers, the motives for migration and the difficulties they encountered in early settlements"}]},{"leaf":false,"text":"1. Describe characteristics that historians use to organize people into cultures","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FCE","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"a. Describe how location and environment influenced early world cultures"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FCF","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"b. Describe and compare elements of culture such as art, music, religion, government, social structure, education, values, beliefs and customs, from civilizations in early world history"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FD0","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"c. Describe the social, political, and religious character of societies in early world history"}]},{"leaf":false,"text":"1. Analyze characteristics that are used to organize people into cultures","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FD1","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"a. Apply understandings of the elements of culture to the studies of modern world regions, such as art, music, religion, government, social structure, education, values, beliefs and customs"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FD2","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"b. Describe the characteristics of a sovereign nation, such as the legitimate use of authority, autonomy and establishment of borders"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FD3","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"c. Describe the characteristics of democratic and authoritarian societies"}]},{"leaf":false,"text":"1. Analyze how America became a diverse society","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FD4","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"a. Describe the influence of religious tolerance and intolerance in the colonies"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FD5","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"b. Describe how the colonies developed into diverse states reflecting various cultural elements"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FD6","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"c. Explain the interaction of cultures in Antebellum America"}]}]},{"leaf":false,"text":"B. Cultural Diffusion","children":[{"leaf":false,"text":"1. Analyze how Maryland society was influenced by the contributions of people and groups","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FD7","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"a. Describe the contributions of past Maryland leaders"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FD8","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"b. Describe the contribution of individuals and groups"}]},{"leaf":false,"text":"1. Analyze how native societies were influenced by the diverse cultures of the explorers and settlers","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FD9","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"a. Compare perspectives of Native American, Africans, and the European explorers"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FDA","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"b. Describe how cultures changed as a result of Native American, African, and European interaction"}]},{"leaf":false,"text":"1. Explain how cultural diffusion influenced the development of cultures","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FDB","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"a. Identify cultural groups within a region in early world history"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FDC","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"b. Describe factors that resulted in cultural diffusion, such as trade, conflict and migration"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FDD","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"c. Describe interactions that promoted or failed to promote relationships between groups, civilizations, empires, and nations"}]},{"leaf":false,"text":"1. Analyze how diverse cultures shape a pluralistic society","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FDE","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"a. Identify cultural groups within a contemporary world region"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FDF","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"b. Describe how migration contributes to the diversity of nations and regions"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FE0","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"c. Analyze how cultural diffusion is influenced by factors, such as trade, migration, immigration and conflict"}]},{"leaf":false,"text":"1. Analyze how America continued to evolve into a society consisting of diverse cultures, customs, and traditions","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FE1","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"a. Describe the effects of cultural exchange and interactions among Europeans, Africans, and Native Americans on the development of the United States"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FE2","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"b. Examine how the diversity of the United States represents a blending of cultures and ideas from around the world"}]},{"leaf":false,"text":"2. Describe cultural characteristics of various groups of people in Maryland","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FE3","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"a. Describe the similarities and differences of religious, ethnic, and economic groups in colonial and contemporary times"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FE4","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"b. Site example of how various cultures borrow and share traditions"}]},{"leaf":false,"text":"2. Analyze how increased diversity in the colonies resulted from immigration, settlement patterns and economic development","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FE5","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"a. Analyze how the influx of immigrants led to economic growth and cultural diversity"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FE6","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"b. Provide examples of how the interactions of various groups resulted in the borrowing and sharing of traditions and technology"}]},{"leaf":false,"text":"2. Analyze how increased diversity in early world history resulted from immigration, settlement patterns and economic development","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FE7","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"a. Examine the practices and beliefs of world religions and philosophies including monotheism and polytheism"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FE8","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"b. Describe the impact of various religions on a civilization, such as its effect on political, economic and social systems"}]},{"leaf":false,"text":"2. Examine how increasing diversity in global societies results from immigration, settlement, and economic development","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FE9","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"a. Examine policies related to human rights, such as foreign aid, subsidies to developing countries, ethnic persecution and economic sanctions"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FEA","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"b. Examine contemporary world wide concerns that affect international relationships, such as world health, nation building, national security, and human rights"}]},{"leaf":false,"text":"2. Describe how the increased diversity of American culture resulted from immigration, settlement, and economic development in the United States","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FEB","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"a. Analyze consequences of immigration including assimilation, and Nativism"}]}]},{"leaf":false,"text":"C. Conflict and Compromise","children":[{"leaf":false,"text":"1. Evaluate how various perspectives of Marylanders can cause compromise and/or conflict","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FEC","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"a. Describe the differing historical conflicts such as between the Patriots and Loyalists"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FED","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"b. Investigate the causes of contemporary conflict and compromises"}]},{"leaf":false,"text":"1. Analyze factors that affected relationships in the colonial period","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FEE","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"a. Analyze how conflict affected relationships among individuals and groups, such as early settlers and Native Americans, free and enslaved people"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FEF","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"b. Provide the examples of conflicts and compromises among differing groups of people during the Constitutional Convention"}]},{"leaf":false,"text":"1. Analyze factors that affected relationships in early world history","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FF0","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"a. Examine the causes and effects of social, economic, and political conflict such as the Crusades"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FF1","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"b. Describe the impact of trade and migration on the exchange of ideas and beliefs"}]},{"leaf":false,"text":"1. Analyze major sources of tension, cooperation, and conflict in the world and the efforts that have been made to address them","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FF2","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"a. Evaluate causes of conflict in the global community, such as Apartheid, the acquisition of natural resources, the decline of communism, ethnic persecution, and domestic and international terrorism"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FF3","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"b. Analyze and describe the efforts of world nations and groups to assist in the resolution of conflicts within and among regions, such as the United Nations, the International Red Cross/Red Crescent, United States Agency for International Development and other humanitarian organizations"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FF4","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"c. Analyze and describe efforts by nations to promote cooperation within and among those regions, such as the creation of the International Monetary Fund, North American Free Trade Agreement, World Bank, European Union and world-wide healthcare initiatives"}]},{"leaf":false,"text":"1. Analyze factors that affected relationships in the United States prior to 1877","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FF5","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"a. Examine examples of conflict and compromise among different ethnic, religious, and gender groups"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FF6","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"b. Describe how cultural, economic and political differences contributed to sectionalism"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FF7","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"c. Describe various reform movements, such as abolition, women's rights, and education"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FF8","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"d. Describe the effects of early industrialization on individuals and families"}]}]}]},{"leaf":false,"text":"3.0 CONTENT STANDARD: GEOGRAPHY – Students will use geographic concepts and processes to examine the role of culture, technology, and the environment in the location and distribution of human activities and spatial connections throughout time.","children":[{"leaf":false,"text":"(PreK-3 Standard) GEOGRAPHY – Students will use geographic concepts and processes to understand location and its relationship to human activities","children":[{"leaf":false,"text":"A. Using Geographic Tools","children":[{"leaf":false,"text":"1. Recognize that a globe and maps are used to help people locate places","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DDB","dcterms_educationLevel":[{"prefLabel":"Pre-K"}],"text":"a. Recognize that maps are models of places"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DDC","dcterms_educationLevel":[{"prefLabel":"Pre-K"}],"text":"b. Recognize that a globe is a model of Earth"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DDD","dcterms_educationLevel":[{"prefLabel":"Pre-K"}],"text":"c. Make maps by drawing, building with blocks, and playing with clay, puzzles, pictures, and photographs"}]},{"leaf":false,"text":"1. Identify and describe how a globe and maps can be used to help people locate places","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DDE","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"a. Describe a globe as a model of Earth showing land and water"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DDF","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"b. Describe how maps are models showing physical features and/or human features of places"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DE0","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"c. Identify a location by using terms such as near-far, above-below, and here-there"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DE1","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"d. Identify pictures and photographs that represent places on a map such as, a playground and a fire station"}]},{"leaf":false,"text":"1. Use geographic tools to locate and describe places on Earth","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DE2","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"a. Locate the continents and oceans using maps and a globe"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DE3","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"b. Use photographs and pictures to describe a place"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DE4","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"c. Identify a place using bird's eye view"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DE5","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"d. Define map elements as parts of a map that make it easy to use"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DE6","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"e. Describe where places are located on a map using relative distance and direction, such as near-far, above-below and cardinal directions (north, south, east, and west)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DE7","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"a. Identify the purpose and use of a globe and a variety of maps and atlases, such as school maps, neighborhood maps and simple atlases"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DE8","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"b. Identify and use map elements, such as title, compass rose, simple grid system, legend/key, date, and author to interpret a map"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DE9","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"c. Identify the equator, poles, seven continents, four oceans, and countries on a map and globe"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DEA","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"d. Describe a place using bird's eye view, and satellite images, photographs, and pictures"}]},{"leaf":false,"text":"1. Use geographic tools to locate and construct meaning about places on Earth","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DEB","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"a. Describe the purposes of a variety of maps and atlases, such as transportation maps, physical maps, and political maps"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DEC","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"b. Construct and interpret maps by using elements, such as title, compass rose, simple grid system, scale, legend/key, date, and author"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DED","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"c. Identify the location of communities, major cities in Maryland, and United States using a globe, maps, and atlases"}]}]},{"leaf":false,"text":"B. Geographic Characteristics of Places and Regions","children":[{"leaf":false,"text":"1. Recognize that places in the immediate environment have specific physical and human-made features","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DEE","dcterms_educationLevel":[{"prefLabel":"Pre-K"}],"text":"a. Discuss that places have natural/physical features such as mountains, rivers, and hills"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DEF","dcterms_educationLevel":[{"prefLabel":"Pre-K"}],"text":"b. Discuss that places have human-made features, such as streets, buildings, and parks"}]},{"leaf":false,"text":"1. Describe places in the immediate environment using natural/physical and human-made features","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DF0","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"a. Recognize physical features as landforms and bodies of water using photographs and pictures"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DF1","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"b. Identify land forms, such as mountains and hills, and bodies of water, such as oceans, rivers, and streams"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DF2","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"c. Using photographs and pictures, recognize human-made features as modifications people have made to the land"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DF3","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"d. Identify human-made features, such as buildings, sidewalks, streets, and bridges"}]},{"leaf":false,"text":"1. Describe places in the environment using geographic characteristics","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DF4","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"a. Identify and describe physical characteristics of a place (physical features, climate, vegetation and animal life)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DF5","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"b. Identify human characteristics of a place (human-made features, language, political system, how people make a living)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DF6","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"c. Describe places by how people make a living and where they live"}]},{"leaf":false,"text":"1. Classify places and regions in an environment using geographic characteristics","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DF7","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"a. Identify natural/physical features and human – made features using maps and photographs"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DF8","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"b. Describe and classify regions using climate, vegetation, animal life, and natural/physical features"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DF9","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"c. Classify places as rural and urban"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DFA","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"d. Describe how geographic characteristics determine choices, such as climate guides decisions about food, clothing, and shelter"}]},{"leaf":false,"text":"1. Compare places and regions around the world using geographic characteristics","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DFB","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"a. Compare places and regions using geographic features"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DFC","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"b. Identify natural/physical and human-made features of places and regions"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DFD","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"c. Describe population distribution of places and regions such as rural and urban"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048DFF","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"d. Describe how geographic characteristics of places and regions change over time and influence the way people live and work"}]}]},{"leaf":false,"text":"C. Movement of People, Goods and Ideas","children":[{"leaf":false,"text":"1. Identify the role of transportation in the community","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E00","dcterms_educationLevel":[{"prefLabel":"Pre-K"}],"text":"a. Recognize transportation as a means of traveling from place to place"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E02","dcterms_educationLevel":[{"prefLabel":"Pre-K"}],"text":"b. Identify ways in which people travel to various places in the community, such as bus, car, and bicycle"}]},{"leaf":false,"text":"1. Describe how transportation and communication link people and places","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E03","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"a. Identify ways that people travel on land, water, and air"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E04","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"b. Explain how transportation is used to move goods and people from place to place"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E05","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"c. Identify ways that people communicate messages"}]},{"leaf":false,"text":"1. Explain how transportation and communication link people and places by the movement of goods, messages, and people","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E06","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"a. Identify how transportation links people and goods between places"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E07","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"b. Explain how communication links people and messages between places"}]},{"leaf":false,"text":"1. Explain how transportation and communication link places by the movement of people, goods, and ideas","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E09","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"a. Compare types of transportation used to move goods and people today and long ago"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E0A","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"b. Compare ways people communicate ideas today and long ago"}]},{"leaf":false,"text":"1. Describe how transportation and communication networks link places through the movement of people, goods, and ideas","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E0B","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"a. Explain how transportation and communication networks connect places, people, and ideas"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E0C","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"b. Identify reasons for the movement of people from one community or region to another"}]}]},{"leaf":false,"text":"D. Modifying and Adapting to the Environment","children":[{"leaf":false,"text":"1. Describe how people adapt to their immediate environment","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E0E","dcterms_educationLevel":[{"prefLabel":"Pre-K"}],"text":"a. Identify ways people adapt to the environment, such as wearing clothing that is appropriate to the weather"}]},{"leaf":false,"text":"1. Describe how people adapt to and modify their immediate environment","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E0F","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"a. Identify ways people adapt to the environment, such as wearing clothing that is appropriate to the weather"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E12","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"b. Identify ways that people change their environment to meet their needs, such as planting crops or cutting forests"}]},{"leaf":false,"text":"1. Explain how people modify, protect, and adapt to their environment","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E13","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"a. Describe how people in a community modify their environment to meet changing needs for shelter, such as clearing land for a housing community"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E14","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"b. Describe why and how people protect the environment"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E16","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"c. Explain how people adapt to changes in the environment, such as using less water in the drought"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E17","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"a. Describe ways, such as clearing trees and farming land, that people modify their environment and the impact of those modifications"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E18","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"b. Describe how and why people protect or fail to protect the environment"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E1A","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"c. Explain how people adapt to changes in the environment"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E1C","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"a. Describe how people in a community modify their environment to meet changing needs for transportation, shelter, and making a living"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E1D","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"b. Describe why and how people make decisions about protecting the environment"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E1E","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"c. Compare ways that people adapt to the environment for food, clothing, and shelter"}]}]}]},{"leaf":false,"text":"A. Using Geographic Tools","children":[{"leaf":false,"text":"1. Use geographic tools to locate places and describe the human and physical characteristics of those places","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FF9","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"a Construct and interpret a variety of maps using map elements"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FFA","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"b. Use photographs, maps, charts, graphs, and atlases to describe geographic characteristics of Maryland/United States"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FFB","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"c. Identify and locate natural/physical features and human-made features of Maryland such as Appalachian Mountains, Piedmont Plateau, and Atlantic Coastal Plain"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FFC","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"d. Identify and locate natural/physical features and human-made features of the United States"}]},{"leaf":false,"text":"1. Use geographic tools to locate places and describe human and physical characteristics in Colonial America","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FFD","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"a. Use map elements to interpret and construct a variety of maps"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FFE","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"b. Use a globe and a variety of maps, atlases to identify natural/physical features of colonial settlements"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048FFF","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"c. Use photographs, maps, and drawings to describe geographic characteristics"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049000","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"d. Compare geographic locations and geographic characteristics of colonial settlements, such as, Jamestown, Plymouth, Boston, Philadelphia, Charleston, and New York City"}]},{"leaf":false,"text":"1. Use geographic tools to locate places and describe the human and physical characteristics in early world history","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049001","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"a. Use maps to compare geographic locations of civilizations from world history to:<ul> <li>Mesopotamia</li> <li>Africa including Egypt, Nubia/Kush and sub-Saharan Africa</li> <li>Indus River Valley</li> <li>Northern China</li> <li>Greeks and Romans</li> <li>Mesoamerican, such as the Incas, Mayans and Aztecs</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049002","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"b. Use photographs and thematic maps, to identify and describe physical and human characteristics of early civilizations"}]},{"leaf":false,"text":"1. Use geographic tools to locate places and describe the human and physical characteristics in the contemporary world","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049003","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"a. Use maps to compare geographic locations of places and regions"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049004","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"b. Use photographs and thematic maps to compare human and physical characteristics of places and regions"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049005","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"c. Analyze geographic issues and problems"}]},{"leaf":false,"text":"1. Use geographic tools to analyze geographic issues and problems prior to 1877","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049006","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"a. Use thematic maps to locate places and describe the human and physical characteristics, such as settlement patterns, migration, population density, transportation, and communication networks"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049007","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"b. Explain interrelationships among physical and human characteristics that shaped the nation"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049008","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"c. Analyze thematic maps to determine demographic and economic information about a region"}]}]},{"leaf":false,"text":"B. Geographic Characteristics of Places and Regions","children":[{"leaf":false,"text":"1. Describe similarities and differences of regions by using geographic characteristics","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049009","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"a. Compare physical characteristics of different places and regions of Maryland and the United States including natural/physical features, weather and climate, soil, vegetation, minerals and animal life"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104900A","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"b. Compare human characteristics of different places and regions of Maryland the United States, including human-made features, language, religions, political systems, economic activity, and population distribution"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104900B","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"c. Describe how geographic characteristics of a place or region change over time and affect the way people live and work"}]},{"leaf":false,"text":"1. Examine the similarities and differences of regions in Colonial America","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S104900C","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"a. Compare the natural/physical and human characteristics of the three colonial regions<ul> <li>New England</li> <li>Middle</li> <li>Southern</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104900D","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"b. Describe how geographic characteristics of a place or region changed from early settlements through the colonial period"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104900E","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"c. Explain how geographic characteristics affect how people live and work, and the population distribution of a place or region"}]},{"leaf":false,"text":"1. Examine how physical and human characteristics shape the identity of places and regions and influence the development of civilizations in world history","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S104900F","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"a. Identify and describe physical characteristics that influenced human settlement"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049010","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"b. Explain how physical characteristics of a place influenced human activities, such as agriculture, transportation, art and architecture and economic activity in the ancient world"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049011","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"c. Explain how human perceptions of and interactions with the environment changed over time in due to technologies, such as road building, dam construction, and agricultural improvements"}]},{"leaf":false,"text":"1. Analyze interrelationships among physical and human characteristics that shape the identity of places and regions around the world","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049012","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"a. Identify and describe physical characteristics that influenced human settlement"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049013","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"b. Explain how physical and human characteristics of a region such as vegetation, climate, minerals, population density and religion, affect its economic growth and the way people make a living"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049014","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"c. Analyze how regional characteristics and interests including economic development, climate, and the environmental impact government policies"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049015","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"d. Identify geographic factors that have influenced international relations and economic development in world regions, such as trade, infrastructure, and health issues"}]},{"leaf":false,"text":"1. Analyze how geographic characteristics influenced the location and development of regions in the United States prior to 1877","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049016","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"a. Analyze how geographic characteristics influenced the location and development of economic activities, such as farming, lumbering, fur trading, whaling and the rise of the industry in the early national period"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049017","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"b. Describe how changes in transportation systems, such as roads, canals and railroads affected the expansion of trade and settlement"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049018","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"c. Analyze how geographic characteristics stimulated regional growth, such as the purchase of the Louisiana Territory"}]}]},{"leaf":false,"text":"C. Movement of People, Goods and Ideas","children":[{"leaf":false,"text":"1. Describe and analyze population growth, migration, and settlement patterns in Maryland and regions of the United States","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049019","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"a. Explain how geographic characteristics influenced settlement patterns in Maryland and the United States"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104901A","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"b. Explain how changes in transportation and communication led to the growth and development of towns and cities in Maryland and United States"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104901B","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"d. Describe the transportation and communication networks for the movement of people, goods, and ideas to, from and within Maryland such as Bay Bridge, National Road, B & O Railroad, the Port of Baltimore, and C & O Canal"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104901C","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"e. Identify the reasons for the movement of peoples to, from, and within Maryland and the United States"}]},{"leaf":false,"text":"1. Describe and analyze population growth, migration and settlement patterns in Colonial America","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S104901D","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"a. Explain how geographic characteristics influenced settlement patterns in Colonial America"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104901E","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"b. Analyze the consequences of migration between the colonies and immigration to the colonies, such as Europeans and Africans immigrating to the east coast of the United States"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104901F","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"c. Explain the importance of shipping and trading to the economic development of the colonies, such as Triangular Trade"}]},{"leaf":false,"text":"1. Describe and analyze population growth, migration and settlement patterns in early world history","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049020","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"a. Identify reasons why people migrate, such as economic opportunity, climate, and political reasons"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049021","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"b. Explain how the development of transportation and communication networks influenced the movement of people, goods and ideas from place to place, such as trade routes in Africa, Asia and Europe, and the spread of Islam"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049022","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"c. Describe how economic systems and cultural diffusion help to shape patterns of human settlement and interaction"}]},{"leaf":false,"text":"1.Describe and analyze population growth, migration and settlement patterns in contemporary world regions","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049023","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"a. Identify reasons why people migrate, such as economic opportunity, climate, political reasons and government policies"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049024","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"b. Evaluate the consequences of migration and settlement in various regions of the world, such as employment, changes in population and cultural diversity/conflict"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049025","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"c. Explain how regional population patterns, trends, and projections affect the environment and influence government policies"}]},{"leaf":false,"text":"1. Analyze population growth, migration and settlement patterns in the United States prior to 1877","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049026","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"a. Explain why Americans migrated west, such as fertile soil, minerals, and economic opportunity, and the impact on that region"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049027","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"b. Describe the effects of the influx of immigrants on the United States"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049028","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"c. Explain how the regional demographic factors of constituents, such as race, ethnicity, education, occupation, and wealth affect public policy and voting issues"}]}]},{"leaf":false,"text":"D. Modifying and Adapting to the Environment","children":[{"leaf":false,"text":"1. Describe how people adapt to, modify and impact the natural environment","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049029","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"a. Compare ways Native American societies in Maryland used the natural environment for food, clothing, and shelter"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104902A","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"b. Describe ways and reasons people in Maryland and the United States modify the natural environment and the consequences of modifications"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104902B","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"c. Explain how the growth of communities and suburbs have had consequences on the environment, loss of farmland, and pollution"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104902C","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"d. Describe how land use and urban growth are influenced by governmental decisions"}]},{"leaf":false,"text":"1. Explain why and how people adapt to and modify the natural environment and the impact of those modifications","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S104902D","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"a. Compare ways Native American societies used the natural environment for food, clothing, and shelter"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104902E","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"b. Describe ways that colonists in the New England, Middle and Southern regions adapted to and modified the environment, such as the uses of the grist mill, water wheels and plantation farming"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104902F","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"c. Explain how colonists adapted to and modified their environments and how these modifications sometimes created environmental problems"}]},{"leaf":false,"text":"1. Analyze why and how people modify their natural environment and the impact of those modifications","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049030","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"a. Describe ways people modified their environment to meet their needs, such as cultivating lands, building roads, dams, and aqueducts"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049031","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"b. Analyze how people in early world history perceived and reacted to environmental concerns, such as flooding, drought, and depletion of natural resources and evaluate the consequences of those actions"}]},{"leaf":false,"text":"1. Analyze why and how people in contemporary world regions modify their natural environment and the impact of those modifications","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049032","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"a. Identify trade offs of using resources to pursue economic opportunities v. preserving the environment, such as water use, the burning of fossil fuels, deforestation, and strip mining"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049033","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"b. Evaluate the consequences of modifying the natural environment, such as desertification, air pollution, and climate change"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049034","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"c. Identify and explain land use issues that illustrate the conflict between economic growth, deforestation, mining, and burning fossil fuels"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049035","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"d. Explain how land use and environmental issues such as burning the rain forest and environmental preservation are addressed by government policy"}]},{"leaf":false,"text":"1. Analyze why and how people in the United States modify their natural environment and the impact of those modifications","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049036","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"a. Analyze the trade offs of using resources to pursue economic opportunities v. preserving the environment, such as westward movement"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049037","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"b. Explain the consequences of modifying the natural environment, such as soil erosion, loss of soil fertility and over -fishing"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049038","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"c. Identify and explain land use issues that illustrate the conflict between economic growth and using the environment"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049039","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"d. Analyze how land use was managed by the federal government such as the Land Ordinance of 1785 and the Northwest Ordinance of 1787"}]}]}]},{"leaf":false,"text":"4.0 CONTENT STANDARD: ECONOMICS – Students will develop economic reasoning to understand the historical development and current status of economic principles, institutions, and processes needed to be effective citizens, consumers, and workers participating in local communities, the nation, and the world.","children":[{"leaf":false,"text":"(PreK-3 Standard) ECONOMICS - Students will identify the economic principles and processes that are helpful to producers and consumers when making good decisions.","children":[{"leaf":false,"text":"A. Scarcity and Economic Decision-making","children":[{"leaf":false,"text":"1. Recognize that people have to make choices because of unlimited economic wants","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E20","dcterms_educationLevel":[{"prefLabel":"Pre-K"}],"text":"a. Identify that goods are things that people make or grow"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E21","dcterms_educationLevel":[{"prefLabel":"Pre-K"}],"text":"b. Demonstrate the ability to make a choice"}]},{"leaf":false,"text":"2. Identify that materials/resources are used to make products","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E22","dcterms_educationLevel":[{"prefLabel":"Pre-K"}],"text":"a. Recognize that workers do jobs in the home and school"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E24","dcterms_educationLevel":[{"prefLabel":"Pre-K"}],"text":"b. Participate in steps that are followed in making a product, such as a drawing, a block building, and a card for a friend or relative"}]},{"leaf":false,"text":"3. Explain how technology affects the way people live, work, and play","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E25","dcterms_educationLevel":[{"prefLabel":"Pre-K"}],"text":"a. Begin to be aware of technology and how it affects daily life, such as different ways to fasten shoes and different appliances to cook food"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E26","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"a. Begin to be aware of technology and how it affects life"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E27","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"a. Describe how tools and products have affected the way people live, work, or play"}]},{"leaf":false,"text":"1. Describe choices people make because of unlimited economic wants","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E28","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"a. Explain that goods are things that people make or grow"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E29","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"b. Identify situations where people make choices"}]},{"leaf":false,"text":"2. Identify that resources are used to make products","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E2A","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"a. Recognize workers as human resources"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E2B","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"b. Describe some jobs and what is required to perform them"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E2C","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"c. Recognize that natural resources, such as water, trees, and plants are used to make products"}]},{"leaf":false,"text":"1. Describe economic choices people make about goods and services","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E2D","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"a. Identify and discuss goods and services provided in the community"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E2E","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"b. Explain how getting something one wants may mean giving up something in return"}]},{"leaf":false,"text":"2. Describe the production process","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E2F","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"a. Give examples of natural and human resources used in production, such as making butter, making ice cream, and building houses"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E30","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"b. Describe the skills people need for their work in the home, school, and community"}]},{"leaf":false,"text":"1. Explain why people have to make economic choices about goods and services","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E31","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"a. Identify and explain economic choices people make"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E32","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"b. Identify and give examples of the positive and negative aspects of each choice"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E33","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"c. Explain that choices have consequences, some of which are more important than others"}]},{"leaf":false,"text":"2. Explain the production process","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E34","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"a. Identify the natural, capital, and human resources used in the production of a good or service"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E35","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"b. Identify examples of specialized workers in the school and community, such as nurses, truck drivers, lawyers, and postal workers"}]},{"leaf":false,"text":"3. Examine how technology affects the way people live, work and play","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E36","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"a. Identify examples of technology used by consumers, such as automobiles, cameras, telephones, microwaves, televisions, and computers"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E37","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"b. Analyze why consumers use technology in their daily lives"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E38","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"a. Describe how changes in technology have affected the lives of consumers, such as UPC bar codes and online shopping"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E39","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"b. Describe how changes in technology have affected lives of producers, such as robot-powered assembly lines"}]},{"leaf":false,"text":"1. Explain that people must make choices because resources are limited relative to unlimited wants for goods and services","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E3A","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"a. Explain why people must make economic choices"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E3B","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"b. Identify and apply the steps in the decision-making process"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E3C","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"c. Identify the opportunity cost of a choice or decision"}]},{"leaf":false,"text":"2. Examine the production process","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E3D","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"a. Explain how producers make choices because of limited natural, human, and capital resources"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E3E","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"b. Give examples of when limited resources affect the decisions producers make"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E3F","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"c. Describe steps in the production process to produce a product"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E40","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"d. Explain how specialized work results in increased production"}]}]},{"leaf":false,"text":"B. Economic Systems and the Role of Government in the Economy","children":[{"leaf":false,"text":"1. Identify types of local markets","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E41","dcterms_educationLevel":[{"prefLabel":"Pre-K"}],"text":"a. Identify markets as places where buyers and sellers meet"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E42","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"a. Describe how buyers and sellers make exchanges at the market"}]},{"leaf":false,"text":"2. Identify how goods are acquired","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E43","dcterms_educationLevel":[{"prefLabel":"Pre-K"}],"text":"a. Identify that coins and bills are money"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E44","dcterms_educationLevel":[{"prefLabel":"Pre-K"}],"text":"b. Identify that money is used to buy goods"}]},{"leaf":false,"text":"2. Describe how goods are acquired","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E45","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"a. Explain that money is one way to acquire goods"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E46","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"b. Explain that trading is another way to acquire goods"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E47","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"c. Recognize that goods have different values"}]},{"leaf":false,"text":"1. Describe types of markets in the community","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E48","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"a. Explain how markets operate"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E49","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"b. Identify markets in the local community, such as grocery stores, farmers' markets, toy stores, and fast food restaurants"}]},{"leaf":false,"text":"2. Describe how goods and services are acquired","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E4A","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"a. Describe how people earn money by working at a job"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E4B","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"b. Compare goods that have different values, such as same item at different stores"}]},{"leaf":false,"text":"1. Describe different types of markets","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E4D","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"a. Describe different market situations where buyers and sellers meet to exchange goods and services"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E4E","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"b. Describe how people meet in market communities around the world, such as farmers' markets and door-to-door sales"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E4F","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"a. Identify markets that are not face-to-face meetings, such as Internet shopping or catalog shopping"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E51","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"b. Describe how countries around the world trade in the global market"}]},{"leaf":false,"text":"2. Describe how consumers acquire goods and services","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E53","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"a. Identify goods and services provided by businesses"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E55","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"b. Identify goods and services provided by government"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E57","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"c. Explain different ways to pay for goods and services, such as credit cards, checks, debit cards, and money orders"}]},{"leaf":false,"text":"2. Identify goods and services provided by the government and paid for by taxes","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E5C","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"a. Classify goods and services according to who produces them such as, the government, business, or both"}]},{"leaf":false,"text":"3. Describe how consumers acquire goods and services","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E5E","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"a. Develop a budget indicating income and expenses"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E5F","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"b. Develop a plan that shows how money is obtained, such as selling things, getting a gift, and getting allowance"}]}]}]},{"leaf":false,"text":"A. Scarcity and Economic Decision-making","children":[{"leaf":false,"text":"1. Explain that people must make choices because resources are limited relative to economic wants for goods and services in Maryland, past and present","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S104903A","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"a. Identify opportunity cost of economic decisions made by individuals, businesses, and governments"}]},{"leaf":false,"text":"1. Explain that people made choices because resources were limited relative to economic wants for goods and services in Colonial America","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S104903B","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"a. Identify the opportunity cost of economic decisions, such as whether or not to buy products on which British taxes were imposed"}]},{"leaf":false,"text":"1. Explain that people made choices because resources relative to economic wants to goods and services in the context of early world history","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S104903C","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"a. Identify opportunity cost of economic decisions made by individuals and groups such as the decision to engage in trade"}]},{"leaf":false,"text":"1. Analyze the decisions that people made because resources were limited relative to economic wants for goods and services in contemporary world regions","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S104903D","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"a. Identify the opportunity cost of economic decisions made by individuals, businesses, and governments such as decisions about investing in education"}]},{"leaf":false,"text":"1. Analyze the decisions that people made because resources were limited relative to economic wants for goods and services in America","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S104903E","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"a. Describe the opportunity cost of economic decisions by individuals, businesses, and governments in the U.S. through 1877, such as the decision about territorial acquisition"}]},{"leaf":false,"text":"2. Explain how limited economic resources are used to produce goods and services to satisfy economic wants in Maryland","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S104903F","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"a. Describe how scarcity and the availability of economic resources determine what is produced and the effects on consumers"}]},{"leaf":false,"text":"2. Analyze how limited economic resources were used to satisfy economic wants in Colonial America","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049040","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"a. Describe how limited resources and unlimited economic wants caused colonists to choose certain goods and services"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049041","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"b. Describe how available resources affected specialization and trade"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049042","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"c. Analyze how changing from a British colony to an independent nation affected economic resources, production, and economic wants"}]},{"leaf":false,"text":"2. Analyze how scarce economic resources were used to satisfy economic wants in early world history","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049043","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"a. Identify ways people have used resources to meet economic wants such as domesticating agriculture"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049044","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"b. Describe how available resources affected specialization and trade"}]},{"leaf":false,"text":"2. Analyze how scarcity of economic resources affects economic choices in contemporary world regions","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049045","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"a. Describe how goals of countries affect the use of resources in the pursuit of economic growth, and sustainable development"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049046","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"b. Identify tradeoffs made in economic decisions by producers and consumers"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049047","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"c. Explain how available resources affect specialization and trade"}]},{"leaf":false,"text":"2. Analyze how scarcity affected economic choices prior to 1877","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049048","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"a. Compare how scarce resources affected the decisions of consumers and producers in different regions of the United States"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049049","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"b. Describe the importance of economic freedom and economic equity on growth in the North and South prior to 1860"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104904A","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"c. Evaluate socio-economic goals in the North and South after to the Civil War"}]},{"leaf":false,"text":"3. Explain how technological changes have affected production and consumption in Maryland","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S104904B","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"a. Describe how changes in technology, such as refrigeration, impacted the lives of consumers"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104904C","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"b. Describe how entrepreneurship inspired technological changes and affected business productivity"}]},{"leaf":false,"text":"3. Analyze how technological changes affected production and consumption in Colonial America","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S104904D","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"a. Explain how the development of new products and new technologies affected the way people lived"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104904E","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"b. Examine how technology has changed production such as wheat/grist mills"}]},{"leaf":false,"text":"3. Analyze how technological changes affected consumption and production in early world history","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S104904F","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"a. Give examples of how technology changed consumption and provided greater access to goods and services"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049050","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"b. Examine why technology has changed production such as the development of the printing press"}]},{"leaf":false,"text":"3. Analyze how technological changes have affected the consumption and production in the contemporary world","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049051","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"a. Give examples of how technology has changed consumption of goods and services, such as the development of computers"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049052","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"b. Examine why technology has changed job skills and the influenced productivity"}]},{"leaf":false,"text":"3. Analyze how technological changes affected production in the United States prior to 1877","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049053","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"a. Describe the effects of new technology and resource use on economic growth, such as factories, machinery, roads and the telegraph"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049054","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"b. Examine why and how technology and production in the industrial North influenced the outcome of the Civil War"}]},{"leaf":false,"text":"4. Describe regional economic specialization in Maryland and the ways people live and work","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049055","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"a. Explain how available resources determine which careers are more common in one region such as waterman on the Eastern Shore"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049056","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"b. Describe how specialization results in the interdependence of people"}]},{"leaf":false,"text":"4. Analyze the consequences of specialized work on interdependence, trade, and economic growth","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049057","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"a. Analyze examples of regional specialization and how it contributed to economic growth through the colonies"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049058","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"b. Explain specialization and interdependence using the triangular trade routes"}]},{"leaf":false,"text":"4. Examine how specialization, interdependence and trade affected the production of goods and services in early world history","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049059","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"a. Analyze examples of regional specialization that resulted from economic resources, such as silk production, bronze casting and terraced farming"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104905A","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"b. Describe the effects of agricultural surplus and job specialization on the emergence of early towns and cities in various parts of the world"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104905B","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"c. Identify African and Eurasian trade routes to explain how surplus goods and regional specialization resulted in economic interdependence"}]},{"leaf":false,"text":"4. Compare the levels of specialization and economic development in different parts of the contemporary world","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S104905C","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"a. Analyze examples of specialization that result from economic resources"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104905D","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"b. Describe the standard of living and the quality of life in a world region using data, such as Gross National Product (GNP), Gross Domestic Product (GDP), per capita income and the Human Development Index (HDI)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104905E","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"c. Identify factors that have influenced economic development in various regions, such as individuals, corporations, natural resources, technology, military power, population growth, international organizations, infrastructure and public health issues"}]},{"leaf":false,"text":"4. Analyze economic activities, economic decisions, and specialization before and after the Civil War","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S104905F","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"a. Describe how differences between the agrarian South and the industrial North heightened tensions"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049060","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"b. Examine the importance of population growth, specialization and trade to economic development prior to the Civil War"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049061","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"c. Describe the economic opportunities and obstacles faced by different individuals and groups of people before and after the Civil War"}]}]},{"leaf":false,"text":"B. Economic Systems and the Role of Government in the Economy","children":[{"leaf":false,"text":"1. Describe the types of economic systems in Maryland","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049062","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"a. Provide examples of tradition in the Maryland economy, such as businesses and skills that are handed down through families"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049063","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"b. Give examples of the kinds of goods and services produced in Maryland during different historical periods"}]},{"leaf":false,"text":"1. Describe the types of economic systems in colonial America","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049064","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"a. Identify examples of tradition, such as the economic roles of men and women"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049065","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"b. Describe examples of command decisions, such as the imposition of the Stamp Act and the Tea Act"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049066","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"c. Analyze a market economy and give examples of how the colonial economy exhibited these characteristics such as private ownership and consumer choice"}]},{"leaf":false,"text":"1. Describe the types of economic systems in early world societies","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049067","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"a. Describe how various early world societies answer the basic question of what, how, and for whom to produce"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049068","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"b. Describe examples of tradition in economies such as the economic roles of men and women in tribal societies"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049069","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"c. Describe examples of command in economies, such as the feudal system"}]},{"leaf":false,"text":"1. Evaluate the types of economic systems in countries throughout the contemporary world","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S104906A","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"a. Examine how different economic systems, traditional, command, market, and mixed answer the basic economic question of what, how, and for whom to produce"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104906B","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"b. Describe examples of decisions in (traditional economies , such as the economic roles of men and women"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104906C","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"c. Describe examples of command modern economies, such as government ownership of land and other resources"}]},{"leaf":false,"text":"1. Evaluate the types of economic systems prior to 1877","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S104906D","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"a. Analyze how 19th century societies answered the basic question of what, how, and for whom to produce"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104906E","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"b. Analyze how the characteristics of a market economy affected the economic development of the 19th century such as the role of entrepreneurs, markets, and competition"}]},{"leaf":false,"text":"2. Describe the role of government in regulating economic activity and providing goods and services","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S104906F","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"a. Give examples of how governments' decision making affect economic growth and the ability to provide jobs and provide services"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049070","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"b. Explain how local and state governments in Maryland provide goods and services and are paid for by taxes"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049071","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"c. Give examples of government's rules and laws that affect how people in businesses work such as, requiring licenses to drive and regulating resources"}]},{"leaf":false,"text":"2. Describe the role of British government on the colonial economy","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049072","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"a. Explain how colonists were forced to change their purchasing habits based on the scarcity of goods imposed by taxes"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049073","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"b. Evaluate the trade-offs of British protectionism"}]},{"leaf":false,"text":"2. Describe the transition from feudalism and the manor system to the development of early towns","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049074","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"a. Explain how the growth and management of towns, guilds, and the banking system were affected by technology and agriculture"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049075","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"b. Analyze how the guild system addressed changes in the economy, such as dictating price and production"}]},{"leaf":false,"text":"2. Analyze the role of government in the economies of contemporary societies","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049076","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"a. Explore how government spending and taxation influence an economy's ability to grow and provide jobs and services"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049077","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"b. Evaluate the trade-offs of government regulations"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049078","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"c. Analyze the ways that governments can help or impede economic activity, such as providing a stable monetary system, protecting property rights, maintaining infrastructure and providing public goods and services"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049079","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"d. Examine the impact of regulatory agencies in different countries, such as, consumer behavior such as air traffic management and environmental protection"}]},{"leaf":false,"text":"2. Analyze the role of government in the U.S. economy prior to 1877","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S104907A","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"a. Give examples of how government spending and taxation influenced the U.S economy's ability to grow and provide jobs, such as the expansion of the railroad system"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104907B","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"b. Explain how the protection of private property rights, regulation of trade, imposition of taxes, and creation of a monetary system are included in the Constitution"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104907C","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"c Examine ways in which the government influenced the economy such as spending, taxing and acquisition of territories"}]},{"leaf":false,"text":"3. Examine the progression from a barter system to a money economy in Colonial America","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S104907D","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"a. Give examples of barter exchanges of goods and services in Maryland"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104907E","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"b. Give examples of contemporary money exchanges"}]},{"leaf":false,"text":"3. Describe the role of money and barter in the colonial trade","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S104907F","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"a. Compare the benefits of a money economy to a barter economy"}]},{"leaf":false,"text":"3. Describe the importance of medium of exchange in early world history","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049080","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"a. Explain how societies used mediums of exchange to facilitate trade and help their economies grow"}]},{"leaf":false,"text":"3. Describe the money and banking systems in various countries in the contemporary world","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049081","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"a. Explain why a stable money and banking system is necessary for an economy to grow and prosper"}]},{"leaf":false,"text":"3. Describe the effects of government actions on the banking system prior to 1877","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049082","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"a. Explain the effects of the boom and bust cycles on economic growth and stability"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1049083","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"b. Describe the effects of the absence of a national banking system on economic stability, such as the effects of the Panic of 1837"}]}]}]},{"leaf":false,"text":"5.0 CONTENT STANDARD: HISTORY: Students will examine significant ideas, beliefs, and themes; organize patterns and events; and analyze how individuals and societies have changed over time in Maryland and the United States.","children":[{"leaf":false,"text":"(PreK-3 Standard) HISTORY-Students will use historical thinking skills to understand how individuals and events have changed society over time.","children":[{"leaf":false,"text":"A. Change over Time","children":[{"leaf":false,"text":"1. Distinguish among past, present, and future time","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E63","dcterms_educationLevel":[{"prefLabel":"Pre-K"}],"text":"a. Describe the events of the day (things that have happened in the immediate past, in the present and might happen in the future) using terms, such as morning/afternoon, night/day"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E64","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"a. Identify and describe events of the day in chronological order"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E66","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"b. Describe daily events in terms of yesterday, today, and tomorrow"}]},{"leaf":false,"text":"2. Compare daily life and objects of today and long ago","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E67","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"a. Compare tools and toys of the past with those of today"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E68","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"b. Tell about people in the past using informational text and features"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E6A","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"c. Observe and discuss photographs of the past and compare with photographs of similar images, such as old photographs of the school and community"}]}]},{"leaf":false,"text":"A. Individuals and Societies Change over Time","children":[{"leaf":false,"text":"1. Examine differences between past and present time","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E6C","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"a. Use terms related to time to order events sequentially that have occurred in the school"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E6D","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"b. Classify events as belonging to past or present"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E6F","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"a. Develop a personal timeline in each students' life"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E71","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"b. Describe the relationship among events in a variety of timelines"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E73","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"a. Develop a timeline of events in the community"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E75","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"b. Explain the relationship among events in a variety of timelines"}]},{"leaf":false,"text":"2. Compare people and objects of today and long ago","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E77","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"a. Construct meaning from informational text and text features about the past"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E78","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"b. Collect and examine photographs of the past and compare with current photographs of similar images, such as old photographs of the school and community"}]},{"leaf":false,"text":"2. Describe people, places and artifacts of today and long ago","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E7A","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"a. Gather and interpret information about the past from informational sources and biographies"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E7B","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"b. Collect and examine photographs of the past and compare with similar, current images, such as, photographs of modes of transportation and communication"}]},{"leaf":false,"text":"2. Investigate how people lived in the past using a variety of primary and secondary sources","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E7D","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"a. Collect and examine information about people, places, or events of the past using pictures, photographs, maps, audio or visual tapes, and or documents"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048E7F","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"b. Compare family life in the local community by considering jobs, communication, and transportation"}]}]}]},{"leaf":false,"text":"A. Individuals and Societies Change Over Time","children":[{"leaf":false,"text":"1. Analyze the chronology and significance of key historical events leading to early settlement in Maryland","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F09","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"a. Explain how and why the Maryland colony was established, including political and economic motives for coming to the new world"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F0A","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"b. Compare the development of places and regions, such as St. Mary's City, Western Maryland, Kent Island, and Annapolis"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F0B","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"c. Describe the establishment of slavery and how it shaped life in Maryland"}]},{"leaf":false,"text":"1. Analyze the chronology and significance of key historical events during the age of European exploration","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F0C","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"a. Describe the origin, destination and goals of the North American explorers"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F0D","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"b. Evaluate the results of the interactions between European explorers and native peoples"}]},{"leaf":false,"text":"1. Analyze how the rise of the earliest communities led to the emergence of agricultural societies","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F0E","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"a. Describe characteristics and innovations of hunting and gathering societies, such as nomadic lifestyles, inventors of tools, adaptation to animal migration and vegetation cycles and the shift from food gathering to food-producing activities"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F0F","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"b. Explain how and why towns and cities grew from early human settlements, including the need for security and government"}]},{"leaf":false,"text":"2. Compare Native American societies in Maryland before and after European colonization","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F10","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"a. Identify the development of indigenous societies from the Pale- Indians to the Woodland Indians"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F11","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"b. Describe Native American societies indigenous to Maryland after European contact"}]},{"leaf":false,"text":"2. Analyze the chronology and the significance of key historical events leading to early settlements in Colonial America","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F12","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"a. Describe the major settlements in Roanoke, St. Augustine and Jamestown"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F13","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"b. Analyze how key historical events impacted Native American societies"}]},{"leaf":false,"text":"2. Examine the emergence, growth and decline of empires in the Americas","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F14","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"a. Describe and trace the development of political and social structures of the Incas, Mayans and Aztecs"}]}]},{"leaf":false,"text":"B. Emergence, Expansion and Changes in Nations and Empires","children":[{"leaf":false,"text":"1. Analyze how civilizations emerged in the river valley areas","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F15","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"a. Describe the characteristics of a civilization, such as social hierarchy, government, writing system, specialization in an area of trade and the establishment of cities"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F16","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"b. Compare major cultural, political and economic achievements of river valley civilizations, such as the Tigris and Euphrates River Valley, the Huang River Valley, the Indus River Valley and the Nile River Valley including Egypt, Nubia and Kush"}]},{"leaf":false,"text":"1. Analyze the growth and the development of nations in the contemporary world","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F17","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"a. Describe the social, political and economic impacts of various world religions on a global society, such as Judaism, Christianity, Islam, Hinduism, Taoism and Buddhism"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F18","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"b. Compare the effects of political and cultural changes in nations such as independence movements and democratic reforms"}]},{"leaf":false,"text":"1. Analyze the growth and the development of the United States","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F19","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"a. Explain the political and economic impact of the Louisiana Purchase on the United States"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F1A","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"b. Evaluate Manifest Destiny and its impact on territorial expansion of the nation"}]},{"leaf":false,"text":"2. Analyze the growth and development of colonial America","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F1B","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"a. Describe the religious, political and economic motives of individuals who migrated to North America and the difficulties they encountered"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F1C","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"b. Compare the political, economic and social lives of people in New England, Middle and the Southern colonies"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F1D","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"c. Analyze the different roles and viewpoints of individuals and groups, such as women, men, free and enslaved Africans, and Native Americans during the Revolutionary period"}]},{"leaf":false,"text":"2. Analyze the emergence and enduring influence of Aegean civilizations","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F1E","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"a. Describe the major cultural achievements of the Greek civilization, such as art, science, political systems, and philosophy across time"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F1F","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"b. Explain the emergence, rise and decline of the Greek city-states"}]},{"leaf":false,"text":"2. Evaluate the importance of Jacksonian Democracy and how it represented a change in the social, political and economic life of the United States","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F20","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"a. Explain how the philosophies and policies of the Jacksonian Era represented a move towards greater democratization"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F21","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"b. Analyze how tariff policy and issues of states' rights influenced the development of political parties and prompted sectional differences"}]},{"leaf":false,"text":"3. Analyze the emergence, expansion and decline of the Roman Empire","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F22","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"a. Describe the major achievements of the Roman Era, such as legal, artistic, architectural, technological, and literary"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F23","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"b. Explain the transition from Roman Republic to Roman Empire including the social structure, significance of citizenship and the development of political institutions"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F24","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"c. Summarize the factors that led to the decline of the Roman Empire"}]},{"leaf":false,"text":"3. Evaluate westward movement in the United States before 1877","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F25","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"a. Explain the political, economic, and social factors that motivated people to move west"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F26","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"b. Describe the government strategies used to acquire territory"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F27","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"c. Analyze the impact of westward movement on relations with Native Americans, such as treaty relations, land acquisition and the policy of Indian Removal"}]},{"leaf":false,"text":"4. Compare the dynasties and empires in ancient China","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F28","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"a. Describe the causes and consequences of the unification of China under early imperial dynasties, such as the Shang, Zhou, Qin, Han and Tang"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F29","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"b. Explain the major traditions, customs and beliefs of Confucianism and Taoism in the context of early Chinese imperial dynasties"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F2A","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"c. Analyze China's cultural, political and economic influence on Japan, Korea, and countries in Southeast Asia"}]},{"leaf":false,"text":"4. Analyze patterns of immigration to the United States before 1877","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F2B","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"a. Identify the push and pull factors responsible for immigration to the United States, such as the forced migration of Africans and Western European migration"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F2C","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"b. Analyze the consequences of the rapid settlement of California and Oregon"}]},{"leaf":false,"text":"5. Analyze the emergence, growth and decline of African Empires","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F2D","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"a. Describe the contributions of major African monarchies, cities, and trade networks, such as Ghana, Mali and Songhai"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F2E","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"b. Analyze the cultural and economic impact of African regional and worldwide trade routes"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F2F","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"c. Summarize the factors that led to the decline of the African empires"}]},{"leaf":false,"text":"5. Analyze the political, economic, and social goals of Reconstruction","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F30","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"a. Explain the goals and policies of the various Reconstruction plans"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F31","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"b. Explain how the 13th, 14th and 15th Amendments addressed the issue of civil rights through abolition, the granting of citizenship, and the right to vote"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F32","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"c. Identify the legal and illegal actions used to deny African-Americans civil rights"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F33","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"d. Evaluate the social and economic impact of sharecropping, tenant farming and the Freedman's Bureau in the post Civil War South"}]}]},{"leaf":false,"text":"C. Conflict between Ideas and Institutions","children":[{"leaf":false,"text":"1. Examine the consequences of interactions among groups and cultures in Maryland","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F34","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"a. Describe Maryland colonists' reactions to changing economic policies from England using events that led to the American Revolutionary War"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F35","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"b. Explain the interactions between colonists and the British during the Pre-Revolutionary period"}]},{"leaf":false,"text":"1. Analyze the causes of the American Revolution","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F36","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"a. Identify and sequence key events between the French and Indian War and the American Revolution"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F37","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"b. Examine the viewpoints of Patriots and Loyalists regarding British colonial policy after the Seven Years' War"}]},{"leaf":false,"text":"1. Analyze the effect of interactions between civilizations in early world history","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F38","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"a. Describe how interactions promoted or failed to promote development, such as the Fertile Crescent Empire, Greek city-states, and Latin Empires"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F39","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"b. Analyze the causes of the rise and fall, expansion and contraction of political entities and nation-states"}]},{"leaf":false,"text":"1. Analyze the major sources of tension and conflict in the contemporary world","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F3A","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"a. Describe how the changes in political structures impacted individuals and groups"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F3B","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"b. Examine the impact of philosophies and policies of leaders in the modern world"}]},{"leaf":false,"text":"1. Examine and explain the role of religious, social and political institutions in America at the end of the American Revolution","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F3C","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"a. Analyze the political effects of the American Revolution on American society and culture"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F3D","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"b. Describe the evolution of the American system of government from a confederal to a federal system of government"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F3E","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"c. Describe how unresolved social, economic, and political issues impacted disenfranchised groups"}]},{"leaf":false,"text":"2. Explain the political, cultural, economic and social changes in Maryland during the early 1800s","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F3F","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"a. Describe Maryland's role in the War of 1812"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F40","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"b. Describe the importance of changes in industry, transportation, education, rights and freedoms in Maryland, such as roads and canals, slavery, B&O railroad, the National Road, immigration, public schools, and religious freedoms"}]},{"leaf":false,"text":"2. Analyze the effects of the American Revolution","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F41","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"a. Analyze how the revolution altered colonial and national governments"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F42","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"b. Describe individual freedoms that resulted from the formation of an independent nation"}]},{"leaf":false,"text":"2. Analyze the major traditions, customs, and beliefs of Hinduism and Buddhism and their expansion throughout Asia","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F43","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"a. Describe the major traditions, customs and beliefs of Buddhism"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F44","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"b. Explain the major traditions, customs and beliefs of Hinduism and its political and social impact on India"}]},{"leaf":false,"text":"2. Analyze the major traditions, customs and beliefs of world religions and their expansion","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F45","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"a. Explain how the establishment of religions in areas caused conflict"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F46","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"b. Analyze the political and social impact of religious and traditions in areas such as Europe and the Middle East"}]},{"leaf":false,"text":"2. Analyze the emerging foreign policy of the United States","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F47","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"a. Explain why the United States adopted a policy of neutrality prior to the War of 1812"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F48","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"b. Explain how the continuing conflict between Great Britain and France influenced the domestic and foreign policy of the United States"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F49","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"c. Evaluate the origins and provisions of the Monroe Doctrine and explain how it influenced foreign affairs"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F4A","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"d. Explain causes and effects of the Mexican-American War"}]},{"leaf":false,"text":"3. Analyze regional differences in the Civil War and its effects on people in Maryland","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F4B","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"a. Describe the economic interests in Maryland, such as agricultural v. industrial and slave v. non-slave"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F4C","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"b. Explain why loyalties to the North and the South were divided in Maryland"}]},{"leaf":false,"text":"3. Analyze the emergence and expansion of Islamic civilization","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F4D","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"a. Analyze the major traditions, customs, and beliefs of Islam"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F4E","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"b. Describe causes and consequences of the expansion of Islam into other regions, such as Southwest Asia, Southeast Asia, North Africa, Europe and India"}]},{"leaf":false,"text":"3. Analyze the influence of industrialization and technological developments on society in the United States before 1877","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F4F","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"a. Describe changes in land and water transportation, including the expanding network of roads, canals, and railroads, and their impact on the economy and settlement patterns"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F50","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"b. Explain how the cotton gin and the opening of new lands in the South and West impacted the institution of slavery"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F51","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"c. Analyze the advantages and disadvantages of early industrialization on the economy and society"}]},{"leaf":false,"text":"4. Analyze how the institution of slavery impacted individuals and groups in Maryland","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F52","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"a. Compare the lives of slave families and free blacks"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F53","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"b. Describe the anti-slavery movement in Maryland"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F54","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"c. Describe the growth of the Underground Railroad"}]},{"leaf":false,"text":"4. Analyze the changes in the European society during the Middle Ages","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F55","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"a. Analyze the major traditions, customs, and beliefs of Christianity"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F56","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"b. Explain the origins and consequences of the Black Death during the 14th century, such as a population decrease, a decline in trade, the elimination of the social order and the decline of religious power"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F57","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"c. Analyze the characteristics of the development and decline of feudalism and the emergence of monarchies"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F58","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"d. Describe the causes, consequences and cultural diffusion that resulted from the Crusades, such as the increase in Mediterranean trade and the exchange of knowledge and ideas"}]},{"leaf":false,"text":"4. Analyze the institution of slavery and its influence on societies in the United States","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F59","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"a. Describe pro-slavery and anti-slavery positions and explain how debates over slavery influenced politics and sectionalism"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F5A","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"b. Analyze the experiences of African-American slaves, and free blacks"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F5B","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"c. Compare the relationship of abolitionists to the other reform movements"}]},{"leaf":false,"text":"5. Analyze factors affecting the outcome of the Civil War","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F5C","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"a. Analyze government policies regarding slavery, such as the three-fifths clause, the Missouri Compromise (1820) and the Compromise of 1850"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F5D","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"b. Analyze the ideological breakdown that resulted from different events and issues, such as Virginia-Kentucky resolutions, the Hartford Convention, nullification/states' rights, political party division, the Dred Scott decision, John Brown raids"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F5E","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"c. Explain why the 1860 election led to the secession of the southern states"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F5F","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"d. Identify the goals, resources and strategies of the North and the South"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048F60","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"e. Describe the political impact of Lincoln's decisions regarding the deployment of black regiments"}]}]}]},{"leaf":false,"text":"6.0 CONTENT STANDARD: SOCIAL STUDIES SKILLS AND PROCESSES- Students shall use reading, writing, and thinking processes and skills to gain knowledge and understanding of political, historical, and current events using chronological and spatial thinking, economic reasoning, and historical interpretation, by framing and evaluating questions from primary and secondary sources.","children":[{"leaf":false,"text":"A. Learn to Read and Construct Meaning about Social Studies","children":[{"leaf":false,"text":"1. Develop and apply social studies vocabulary through exposure to a variety of text and portions of text","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048CC7","dcterms_educationLevel":[{"prefLabel":"Pre-K"},{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"a. Acquire new vocabulary through listening to and reading a variety of grade-appropriate print and non-print sources"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048CC8","dcterms_educationLevel":[{"prefLabel":"Pre-K"},{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"b. Discuss words and word meanings as they are encountered in texts, instruction, and conversation"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048CC9","dcterms_educationLevel":[{"prefLabel":"Pre-K"},{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"c. Make connections to prior knowledge and new vocabulary by listening, reading, and responding to a variety of texts"}]},{"leaf":false,"text":"2. Use strategies to prepare for reading (before reading)","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048CCA","dcterms_educationLevel":[{"prefLabel":"Pre-K"},{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"a. Make and explain the connections made using prior knowledge and experiences with the text"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048CCB","dcterms_educationLevel":[{"prefLabel":"Pre-K"},{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"b. Make predictions or ask questions about the text by examining the title, cover, illustrations/photographs/text, and familiar author or topic"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048CCC","dcterms_educationLevel":[{"prefLabel":"Pre-K"},{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"c. Set a purpose for reading the text"}]},{"leaf":false,"text":"3. Use strategies to monitor understanding and derive meaning from text and portions of text (during reading)","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048CCD","dcterms_educationLevel":[{"prefLabel":"Pre-K"},{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"a. Recall and discuss what they understand"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048CCE","dcterms_educationLevel":[{"prefLabel":"Pre-K"},{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"b. Identify and question what did not make sense"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048CCF","dcterms_educationLevel":[{"prefLabel":"Pre-K"},{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"c. Reread difficult parts slowly and carefully and use own words to restate difficult parts"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048CD0","dcterms_educationLevel":[{"prefLabel":"Pre-K"},{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"d Read on, revisit, and restate the difficult parts in your own words"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048CD1","dcterms_educationLevel":[{"prefLabel":"Pre-K"},{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"e. Make, confirm, or adjust predictions"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048CD2","dcterms_educationLevel":[{"prefLabel":"Pre-K"},{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"f. Ask and answer questions about the text"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048CD3","dcterms_educationLevel":[{"prefLabel":"Pre-K"},{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"g. Periodically summarize while reading"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048CD4","dcterms_educationLevel":[{"prefLabel":"Pre-K"},{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"h. Visualize what was read"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048CD5","dcterms_educationLevel":[{"prefLabel":"Pre-K"},{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"i. Look back though the text to search for connection to the topic, characters, events, and actions in text"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048CD6","dcterms_educationLevel":[{"prefLabel":"Pre-K"},{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"j. Explain personal connections to the topics, events, characters, and actions in texts"}]},{"leaf":false,"text":"4. Use strategies to demonstrate understanding of the text (after reading)","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048CD7","dcterms_educationLevel":[{"prefLabel":"Pre-K"},{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"a. Review/restate and explain what the text is mainly about"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048CD8","dcterms_educationLevel":[{"prefLabel":"Pre-K"},{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"b. Identify and explain what is directly stated in the text (details, literal meaning)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048CD9","dcterms_educationLevel":[{"prefLabel":"Pre-K"},{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"c. Identify and explain what is not stated in the text (implied or inferential meaning)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048CDA","dcterms_educationLevel":[{"prefLabel":"Pre-K"},{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"d. Summarize the text orally"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048CDB","dcterms_educationLevel":[{"prefLabel":"Pre-K"},{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"e. Confirm, refute, or make predictions to form new ideas"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048CDC","dcterms_educationLevel":[{"prefLabel":"Pre-K"},{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"f. Connect the text to prior knowledge or personal experience"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048CDD","dcterms_educationLevel":[{"prefLabel":"Pre-K"},{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"g. Engage in conversation to understand what has been read"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048CDE","dcterms_educationLevel":[{"prefLabel":"Pre-K"},{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"h. Retell explicit and implicit main ideas of texts"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048CDF","dcterms_educationLevel":[{"prefLabel":"Pre-K"},{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"i. Answer questions (what if, why, and how) in writing"}]}]},{"leaf":false,"text":"B. Learn to Write and Communicate Social Studies Understandings","children":[{"leaf":false,"text":"1. Compose oral, written, and visual presentations that express personal ideas, inform, and persuade","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048CE0","dcterms_educationLevel":[{"prefLabel":"Pre-K"},{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"a. Write to express social studies ideas using a variety of forms, such as journals, narratives, letters, and reports"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048CE1","dcterms_educationLevel":[{"prefLabel":"Pre-K"},{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"b. Contribute to a shared writing experience about a social studies topic"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048CE2","dcterms_educationLevel":[{"prefLabel":"Pre-K"},{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"c. Write a variety of responses to text, such as response logs, journals, and constructed responses"}]},{"leaf":false,"text":"2. Locate, retrieve, and use information from various sources to accomplish a purpose","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048CE3","dcterms_educationLevel":[{"prefLabel":"Pre-K"},{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"a. Identify and use sources of information on a topic"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048CE4","dcterms_educationLevel":[{"prefLabel":"Pre-K"},{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"b. Use note taking and organizational strategies to record and organize information"}]}]},{"leaf":false,"text":"C. Ask Social Studies Questions","children":[{"leaf":false,"text":"1. Identify a topic that requires further study","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048CE5","dcterms_educationLevel":[{"prefLabel":"Pre-K"},{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"a. Identify prior knowledge about the topic"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048CE6","dcterms_educationLevel":[{"prefLabel":"Pre-K"},{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"b. Pose questions about the topic"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048CE7","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"c. Formulate research questions"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048CE8","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"d. Develop a plan for how to answer questions about the topic"}]},{"leaf":false,"text":"2. Identify a situation or problem that requires study","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048CE9","dcterms_educationLevel":[{"prefLabel":"Pre-K"},{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"a. Define the problem/situation"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048CEA","dcterms_educationLevel":[{"prefLabel":"Pre-K"},{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"b. Identify prior knowledge about the problem/situation"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048CEB","dcterms_educationLevel":[{"prefLabel":"Pre-K"},{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"c. Pose/Ask questions about the problem/situation"}]},{"leaf":false,"text":"2. Identify a problem/situation that requires further study","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048CEC","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"a. Define the problem/situation"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048CED","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"b. Identify prior knowledge about the problem/situation"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048CEE","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"c. Pose questions about the problem/ situation from a variety of perspectives"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048CEF","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"d. Pose questions that elicit higher order thinking responses"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048CF0","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"e. Formulate simple research questions"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048CF1","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"f. Develop a plan for how to answer questions about the problem/situation"}]},{"leaf":false,"text":"2. Identify a situation/issue that requires further study","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048CF2","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"a. Define the situation/issue"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048CF3","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"b. Identify prior knowledge about the situation/issue"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048CF4","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"c. Pose questions about the situation/issue from a variety of perspectives"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048CF5","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"d. Pose questions that elicit higher order thinking responses"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048CF6","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"e. Formulate research questions"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048CF7","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"f. Develop a plan for how to answer questions about the situation/issue"}]}]},{"leaf":false,"text":"D. Acquire Social Studies Information","children":[{"leaf":false,"text":"1. Identify primary and secondary sources of information that relate to the topic/situation/problem being studied","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048CF8","dcterms_educationLevel":[{"prefLabel":"Pre-K"},{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"a. Gather and read appropriate print sources, such as journals, textbooks, timelines, and trade books"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048CF9","dcterms_educationLevel":[{"prefLabel":"Pre-K"},{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"b. Read and obtain information from texts representing diversity in content and culture"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048CFA","dcterms_educationLevel":[{"prefLabel":"Pre-K"},{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"c. Locate and gather data and information from appropriate non-print sources, such as music, maps, graphs, photographs, and illustrations"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048CFB","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"a. Gather and read appropriate print sources, such as textbooks, government documents, timelines, trade books, and web sites"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048CFC","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"b. Read and obtain information from texts representing diversity in content, culture, authorship, and perspective"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048CFD","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"c. Locate and gather data and information from appropriate non-print sources, such as music, artifacts, charts, maps, graphs, photographs, video clips, illustrations, paintings, political cartoons, interviews, and oral histories"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048CFE","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"a. Gather and read appropriate print sources, such as journals, periodicals, government documents, timelines, databases, reference works, and web sites"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048CFF","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"c. Locate and gather data and information from appropriate non-print sources, such as music, artifacts, charts, maps, graphs, photographs, video clips, illustrations, paintings, political cartoons, multimedia, interviews, and oral histories"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D00","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"d. Access and process information that is factual and reliable from readings, investigations, and/or oral communications"}]},{"leaf":false,"text":"2. Engage in field work that relates to the topic/ situation/ problem being studied","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D01","dcterms_educationLevel":[{"prefLabel":"Pre-K"},{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"a. Gather data"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D02","dcterms_educationLevel":[{"prefLabel":"Pre-K"},{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"b. Make and record observations"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D03","dcterms_educationLevel":[{"prefLabel":"Pre-K"},{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"c. Conduct surveys"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D04","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"c. Design and conduct surveys and oral histories"}]}]},{"leaf":false,"text":"E. Organize Social Studies Information","children":[{"leaf":false,"text":"1. Organize information from non-print sources","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D05","dcterms_educationLevel":[{"prefLabel":"Pre-K"},{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"a. Distinguish factual from fictional information"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D06","dcterms_educationLevel":[{"prefLabel":"Pre-K"},{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"b. Find relationships between gathered information"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D07","dcterms_educationLevel":[{"prefLabel":"Pre-K"},{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"c. Display information on various types of graphic organizers and charts"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D08","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"a. Prioritize information gathered according to importance and relevance"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D09","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"b. Distinguish factual from fictional information"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D0A","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"c. Find relationships between gathered information"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D0B","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"d. Display information on various types of graphic organizers, maps, and charts"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D0C","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"e. Categorize information obtained from surveys and field work"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D0D","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"c. Find relationships among gathered information"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D0E","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"e. Summarize information obtained from surveys and field work"}]},{"leaf":false,"text":"2. Organize information from print sources","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D0F","dcterms_educationLevel":[{"prefLabel":"Pre-K"},{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"a. Distinguish factual from fictional information"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D10","dcterms_educationLevel":[{"prefLabel":"Pre-K"},{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"b. Find relationships between gathered information"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D11","dcterms_educationLevel":[{"prefLabel":"Pre-K"},{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"c. Display information on various types of graphic organizers, maps, and charts"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D12","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"a. Prioritize information gathered according to importance and relevance"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D13","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"b. Distinguish factual from fictional information"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D14","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"c. Find relationships between gathered information"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D15","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"d. Construct various types of graphic organizers, maps, and charts to display information"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D16","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"b. Determine the bias and reliability of a source"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D17","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"c. Find relationships among gathered information"}]}]},{"leaf":false,"text":"F. Analyze Social Studies Information","children":[{"leaf":false,"text":"1. Interpret information from secondary sources including pictures, graphics, maps, atlases, and timelines","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D18","dcterms_educationLevel":[{"prefLabel":"Pre-K"},{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"a. Compare information from a variety of sources"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D19","dcterms_educationLevel":[{"prefLabel":"Pre-K"},{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"b. Compare information to prior knowledge"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D1A","dcterms_educationLevel":[{"prefLabel":"Pre-K"},{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"c. Recognize relationships in and among ideas or events, such as cause and effect, sequential order, main idea, and details"}]},{"leaf":false,"text":"1. Interpret information from primary and secondary sources","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D1B","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"a. Interpret information in maps, charts and graphs"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D1C","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"b. Interpret information from field studies and surveys"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D1D","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"c. Analyze a document to determine point of view"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D1E","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"d. Analyze the perspective of the author"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D1F","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"e. Identify bias and prejudice"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D20","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"d. Analyze the perspective of the author to determine if the document or topic is historically significant"}]},{"leaf":false,"text":"2. Evaluate information from a variety of sources","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D21","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"a. Compare information from a variety of sources"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D22","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"b. Compare information to prior knowledge"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D23","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"c. Determine the reliability of the document"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D24","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"d. Compare ideas, models, systems, and perspectives"}]},{"leaf":false,"text":"3. Synthesize information from a variety of sources","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D25","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"a. Recognize relationships in and among ideas or events, such as cause and effect, sequential order, main idea, and details"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D26","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"b. Reconstruct the arguments of issues or events"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D27","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"c. Assess the costs and benefits of alternatives"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D28","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"d. Modify understandings of social studies concepts and trend"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D29","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"e. Verify or change prior understandings based on new information"}]}]},{"leaf":false,"text":"G. Answer Social Studies Questions","children":[{"leaf":false,"text":"1. Describe how the community has changed over time and how people have contributed to its change, drawing from maps, photographs, newspapers, and other sources","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D2A","dcterms_educationLevel":[{"prefLabel":"Pre-K"},{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"a. Present social studies information in a variety ways, such as plays, skits, posters, songs, poems, murals, and oral presentations"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D2B","dcterms_educationLevel":[{"prefLabel":"Pre-K"},{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"b. Plan and engage in school and community events, such as a mock election, playground clean-up, writing letters to community officials, and fund-raising for a cause"}]},{"leaf":false,"text":"1. Describe how the country has changed over time and how people have contributed to its change, drawing from maps, photographs, newspapers, and other sources","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D2C","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"a. Present social studies information in a variety ways, such as mock trials, simulations, debates, and skits"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D2D","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"b. Engage in civic participation and public discourse"}]},{"leaf":false,"text":"2. Use historic contexts to answer questions","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D2E","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"a. Use historically accurate resources to answer questions, make predictions, and support ideas"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D2F","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"b. Explain why historic interpretations vary and are subject to change"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D30","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"c. Construct a sound historical interpretation"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D31","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"d. Understand the meaning, implication and impact of historic events and recognize that events could have taken other directions"}]},{"leaf":false,"text":"3. Use current events/issues to answer questions","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D32","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"a. Summarize the main points of an issue explaining different viewpoints"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D33","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"b. Make a decision based on the analysis of issues and evaluate the consequences of these decisions"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D34","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"c. Identify and formulate a position on a course of action or an issue"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D35","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"d. Propose and justify solutions to social studies problems"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D36","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"e. Use media resources to deliberate and advocate issues and policy"}]}]},{"leaf":false,"text":"A. Read to Learn and Construct Meaning about Social Studies","children":[{"leaf":false,"text":"1. Use appropriate strategies and opportunities to increase understandings of social studies vocabulary","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D38","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"a. Acquire and apply new vocabulary through investigating, listening, independent reading and discussing a variety of print and non-print sources"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D39","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"b. Identify and use new vocabulary acquired through study of relationships to prior knowledge and experiences"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D3A","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"c. Use context clues to understand new social studies vocabulary"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D3B","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"d. Use new vocabulary in speaking and writing to gain and extend content knowledge and clarify expression"}]},{"leaf":false,"text":"2. Use strategies to prepare for reading (before reading)","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D3C","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"a. Identify the characteristics of informational texts, such as print features, graphic aids, informational aids, organizational aids, and online features"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D3D","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"b. Preview the text by examining features, such as the title, pictures, maps, illustrations, photographs, charts, timelines, graphs, and icons"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D3E","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"c. Set a purpose for reading the text"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D3F","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"d. Ask questions and make predictions about the text"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D40","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"e. Make connections to the text using prior knowledge and experiences"}]},{"leaf":false,"text":"3. Use strategies to monitor understanding and derive meaning from text and portions of text (during reading)","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D41","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"a. Identify and use knowledge of organizational structures, such as chronological order, cause/effect, main ideas and details, description, similarities/differences, and problem/solution to gain meaning"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D42","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"b. Reread slowly and carefully, restate, or read on and revisit difficult parts"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D43","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"c. Use a graphic organizer or another note-taking technique to record important ideas or information"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D44","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"d. Look back through the text to search for connections between and among ideas"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D45","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"e. Make, confirm, or adjust predictions about the text"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D46","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"f. Periodically summarize or paraphrase important ideas while reading"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D47","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"g. Visualize what was read for deeper meaning"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D48","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"h. Explain personal connections to the ideas or information in the text"}]},{"leaf":false,"text":"4. Use strategies to demonstrate understanding of the text (after reading)","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D49","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"a. Identify and explain what is directly stated in the text"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D4A","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"b. Identify, paraphrase, or summarize the main idea of the text"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D4B","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"c. Determine and explain the author's purpose"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D4C","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"d. Distinguish between facts and opinions"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D4D","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"e. Explain whether or not the author's opinion is presented fairly"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D4E","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"f. Explain what is not directly stated in the text by drawing inferences"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D4F","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"g. Confirm or refute predictions made about the text to form new ideas"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D50","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"h. Connect the text to prior knowledge or personal experiences"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D51","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"i. Draw conclusions and make generalizations based on the text, multiple texts, and/or prior knowledge"}]}]},{"leaf":false,"text":"B. Write to Learn and Communicate Social Studies Understandings","children":[{"leaf":false,"text":"1. Use informal writing strategies, such as journal writing, note taking, quick writes, and graphic organizers to clarify, organize, remember and/or express new understandings","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D52","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"a. Identify key ideas"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D53","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"b. Connect key ideas to prior knowledge (personal experience, text, and world)"}]},{"leaf":false,"text":"2. Use formal writing, such as multi-paragraph essays, historical investigations, research reports, letters and summaries to inform","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D54","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"a. Identify form, audience, topic, and purpose before writing"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D55","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"b. Organize facts and/or data to support a topic"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D56","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"c. Provide introduction, body, and conclusion"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D57","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"d. Cite sources of information"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D58","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"b. Organize facts and/or data/statistics to support a topic"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D59","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"d. Cite sources when paraphrasing, summarizing, and quoting"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D5A","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"e. Enhance text with graphics, such as charts, maps, and diagrams"}]},{"leaf":false,"text":"3. Use formal writing, such as multi-paragraph essays, historical investigations, editorials, and letters to persuade","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D5B","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"a. Identify form audience, topic and purpose"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D5C","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"b. State a clear opinion or position"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D5D","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"c. Support the opinion or position with facts and/or data"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D5E","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"c. Modify or refute a position when appropriate"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D5F","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"d. Provide reasons and cite reliable supporting evidence"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D60","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"e. Demonstrate understandings of social studies knowledge"}]},{"leaf":false,"text":"4. Use timed, on-demand writing to demonstrate understanding on assessments (Constructed Responses)","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D61","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"a. Address the topic"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D62","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"b. Provide accurate information"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D64","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"c. Support topic with appropriate details"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D66","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"d. Incorporate social studies knowledge"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D67","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"d. Integrate social studies concepts and skills"}]},{"leaf":false,"text":"1. Select and use informal writing strategies, such as short/response/essay answer/ brief constructed responses, journal writing, note taking, and graphic organizers, to clarify, organize, remember, and/or express new understandings","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D6B","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"a. Identify key ideas"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048D6C","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"b. Connect key ideas to prior knowledge (personal experience, text and world)"}]}]}]},{"leaf":false,"text":"American Government","children":[{"leaf":false,"text":"1.0 CONTENT STANDARD: POLITICAL SCIENCE- Students will understand the historical development and current status of the fundamental concepts and processes of authority, power, and influence, with particular emphasis on the democratic skills and attitudes necessary to become responsible citizens.","children":[{"leaf":false,"text":"CLG Expectation 1.1: The student will demonstrate understanding of the structure and functions of government and politics in the United States","children":[{"leaf":false,"text":"A. The Foundations and Function of Government","children":[{"leaf":false,"text":"1. The student will evaluate how the principles of government assist or impede the functioning of government (1.1.2).","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048B48","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"a. Evaluate the principles of federalism, representative democracy, popular sovereignty, consent of the governed, separation of powers, checks and balances, rule of law, limited government, majority rule and how they protect individual rights and impact the functioning of government"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048B49","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"b. Explain how the powers of government are divided and shared on the federal and state levels including delegated, reserved and concurrent powers"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048B4A","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"c. Analyze the principle of equal protection and how it has affected individual rights"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048B4B","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"d. Examine the purpose of eminent domain and how it affects citizens rights"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048B4C","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"e. Describe the formal process for amending the Constitution and why this process is necessary"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048B4D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"f. Describe how the Constitution provides for checks and balances, such as Legislative overrides of vetoes, the limitations on the powers of the President and the appointment process (Unit 2)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048B4E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"g. Explain the powers denied to the national and state governments including: bills of attainder, ex post facto laws and the suspension of habeas corpus in the Constitution"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048B4F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"h. Identify and explain the implied powers of Congress including the Elastic Clause (necessary and proper) and its effects on the functioning of government"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048B50","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"i. Describe the bicameral structure, powers and organization of the United States Congress and the Maryland General Assembly"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048B51","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"j. Describe legislative tools that can be used during the law making process, such as filibuster, conference committees, and over-riding a veto"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048B52","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"k. Examine the powers and functions of local legislative bodies in Maryland, such as county councils, county commissioners, and city councils (Unit 3)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048B53","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"l. Describe the structure, powers and authority of the executive branch on the federal, state, and local levels"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048B54","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"m. Analyze the degree to which the powers of the executive branch have changed over time, such as the War Powers Act (1973)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048B55","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"n. Describe the selection process for the president of the United States including the Electoral College (Unit 4)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048B56","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"o. Describe the powers, structure and organization of the Federal and Maryland court systems"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048B57","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"p. Explain the difference between original jurisdiction and appellate jurisdiction"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048B58","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"q. Explain how judicial review affects the functioning of government"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048B5A","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"r. Analyze why the United States Supreme Court justices' interpretations of the Constitution change over time"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048B5C","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"s. Explain the methods of selecting federal justices/judges and Maryland judges (Unit 5)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048B5D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"t. Describe an individual's legal obligations to obey the law, pay taxes, serve on a jury and serve as a witness"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048B5E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"u. Describe the election process in the United States including the nominating process, primary and general elections (Unit 7)"}]},{"leaf":false,"text":"2. The student will analyze historic documents to determine the basic principles of United States government and apply them to real-world situations (1.1.1).","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048B61","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"a. Describe the purposes of government, such as protecting individual rights, promoting the common good and providing economic security"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048B62","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"b. Evaluate why governments are formed (Unit 1)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048B63","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"c. Examine the fundamental principles of government and law developed by leading philosophers, such as Hobbes, Locke, Montesquieu and Rousseau"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048B65","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"d. Explain how common law and historic documents, such as Magna Carta, the English Bill of Rights and the Mayflower Compact influenced the framers of the Constitution and its development"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048B66","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"e. Analyze how the Constitution eliminated the weaknesses of the Articles of Confederation"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048B68","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"f. Examine the ratification process of the Constitution and the arguments that occurred including the view points of the Federalists and the Anti- Federalists"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048B69","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"g. Explain the fundamental principles of American government contained in the Declaration of Independence, Articles of Confederation, United States Constitution and the Maryland Constitution"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048B6A","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"h. Analyze the Preamble as the mission statement of the Constitution of the United States"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048B6B","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"i. Identify the rights in the Bill of Rights and how they protect individuals and limit the power of government"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048B6C","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"j. Apply the principles of federalism, checks and balances, rule of law, judicial review, separation of powers, consent of the governed and majority rule to real world situations"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048B6D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"k. Explain how amendments to the Constitution expand or limit individual civil liberties, such as the 14th Amendment, 18th Amendment & proposed flag burning amendment (Unit 2)"}]},{"leaf":false,"text":"3. The student will evaluate roles and policies the government has assumed regarding public issues (1.1.3).","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048B6E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"a. Describe how executive departments and agencies enforce governmental policies that address public issues, such as the Center for Disease Control (CDC), Federal Bureau of Investigation (FBI), Environmental Protection Agency (EPA), Drug Enforcement Agency (DEA) (Unit 4)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048B6F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"b. Analyze significant issues in domestic policy and how they reflect the national interest, values and principles, such as healthcare, high level of security awareness, environmental concerns"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048B71","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"c. Analyze the decisions made by the government on domestic issues and their effect on society, such as entitlements, socioeconomic status, individuals with disabilities, welfare reform"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048B73","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"d. Evaluate the effects of crime and crime prevention as a public policy issue on government spending, quality of life and campaign issues"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048B75","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"e. Evaluate the effect that international, national, and regional interests have on shaping environmental policy, such as logging forested areas, oil drilling, pollution, nuclear power, or alternative energy sources"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048B77","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"f. Define public health and health care issues and evaluate existing government policy, such as smoking in public places, Medicare and Medicaid"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048B79","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"g. Evaluate censorship of the media and technology as a public policy issue, such as obscene material and mass media, right to privacy, internet filters, hate speech, intellectual property, or invasive technology"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048B7B","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"h. Describe public policies that promote equity, such as affirmative action, and Higher Education Act Title IX (1972)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048B7D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"i. Describe how the United States provides national and international service programs to meet the critical needs of society, such as AmeriCorps, Peace Corps (Unit 6)"}]}]},{"leaf":false,"text":"B. Individual and Group Participation in the Political System","children":[{"leaf":false,"text":"1. The student will explain roles and analyze strategies individuals or groups may use to initiate change in governmental policy and institutions (1.1.4).","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048B7F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"a. Explain how initiative, referendum, and recall are opportunities for individuals and groups to initiate change in state and local government policy"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048B81","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"b. Analyze the external factors that influence the law-making process including the roles of the media, lobbyists, Political Action Committees (PACs), special-interest groups, citizens and public opinion (Unit 3)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048B83","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"c. Analyze the role of the media, special-interest groups, and public opinion in influencing the policy and decisions of the executive branch (Unit 4)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048B84","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"d. Evaluate how the media, political parties, special-interest groups, lobbyists, Political Action Committees (PACs) influence public opinion and government policies"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048B85","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"e. Evaluate the reliability and influence of the media on elections, elected officials and public opinion"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048B87","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"f. Describe the roles of political parties in the United States and how they influence elections, elected officials and public opinion"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048B89","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"g. Describe how citizens, candidates, campaigns and campaign financing influence the political process in the United States"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048B8B","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"h. Analyze the roles of participants in the election process including voting, contributing, and electioneering"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048B8D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"i. Analyze how citizens make informed decisions regarding candidates, issues, and policies"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048B8F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"j. Describe the importance of being informed on civic issues, volunteering and public service"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048B90","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"k. Analyze various methods that individuals or groups may use to influence laws and governmental policies including petitioning, letter writing and acts of civil disobedience (Unit 7)"}]}]}]},{"leaf":false,"text":"CLG Expectation 1.2 The student will evaluate how the United States government has maintained a balance between protecting rights and maintaining order.","children":[{"leaf":false,"text":"C. Protecting Rights and Maintaining Order","children":[{"leaf":false,"text":"1. The student will analyze the impact of landmark Supreme Court decisions on governmental powers, rights, and responsibilities of citizens in our changing society (1.2.1).","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048B9C","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"a. Analyze the United States Supreme Court case Marbury v. Madison (1803) and the establishment of judicial review"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048B9E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"b. Analyze the historical expansion of the powers of the federal government by examining the United States Supreme Court case McCulloch v. Maryland (1819)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048BA0","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"c. Analyze how the Supreme Court decisions in Plessy v. Ferguson (1896) and Brown v. Board of Education of Topeka (1954) impacted the rights of individuals"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048BA2","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"d. Examine the significance of the United States Supreme Court's decisions on the rights of those accused of crimes in the cases Gideon v. Wainwright (1963) and Miranda v. Arizona (1966)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048BA3","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"e. Examine the expansion or restriction of student rights in the cases Tinker v. Des Moines School District (1969) and New Jersey v. T.L.O (1985)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048BA4","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"f. Examine the impact of United States Supreme Court decisions on minority and civil rights issues, such as Regents of the University of California v. Bakke (1978)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048BA5","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"g. Evaluate the decisions of the United States Supreme Court that have limited or expanded the liberties of citizens, such as Schenck v. U.S.(1919), Gitlow v. New York (1925), Engel v. Vitale (1962), Katz v. U.S. (1967), Hazelwood School District v. Kuhlmeier (1988), Texas v. Johnson (1989) (Unit 5)"}]},{"leaf":false,"text":"2. The student will analyze legislation designed to protect the rights of individuals and groups and to promote equity in American society (1.2.2).","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048BA6","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"a. Evaluate the effectiveness of legislation in promoting equity and civil rights, such as the Civil Rights Act (1964), Voting Rights Act (1965), Higher Education Act Title IX (1972), Indian Education Act (1972), Americans with Disabilities Act (ADA 1990) and Individuals with Disabilities Education Act (IDEA 1997)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048BA8","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"b. Examine immigration policies the government has implemented, such as the Immigration Reform and Control Act (1986) and the Immigration Act of 1990"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048BAA","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"c. Identify the purpose of affirmative action and explain how the implementation of affirmative action has changed over time (Unit 3)"}]},{"leaf":false,"text":"3. The student will evaluate the impact of governmental decisions and actions that have affected the rights of individuals and groups in American society and/or have affected maintaining order and/or safety (1.2.3).","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048BAC","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"a. Describe the purpose, limitations and impact of executive orders in maintaining order and providing safety for citizens"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048BAE","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"b. Explain how executive departments and regulatory agencies assist in maintaining order and protecting the safety of the nation, such as the Department of Defense (DOD), Federal Bureau of Investigation (FBI), Department of Homeland Security (DHS)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048BAF","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"c. Analyze the impact of national emergencies on the expansion of the powers of the government"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048BB1","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"d. Analyze the relationship between governmental authority and maintaining order under the rule of law"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048BB3","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"e. Describe how the governor of Maryland can use executive power to maintain order and safety in the state, such as calling out the National Guard in the case of a natural disaster (Unit 4)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048BB5","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"f. Examine the impact of government decisions on individuals and groups, such as approval policies of the Food and Drug Administration (FDA), environmental standards set by the Environmental Protection Agency (EPA), regulations by the Maryland Department of the Environment"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048BB7","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"g. Evaluate the role of state and national governments concerning issues related to public safety and maintaining order, such as crime prevention, changes in driver's license requirements, seat belt laws, and immunization shots (Unit 6)"}]},{"leaf":false,"text":"4. The student will evaluate the principle of due process (1.2.4).","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048BBA","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"a. Explain the meaning of due process of law as set forth in the Fifth Amendment"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048BBB","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"b. Explain how procedural due process limits the powers of government and protects the accused"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048BBD","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"c. Explain why it is necessary to have both substantive and procedural due process"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048BBE","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"d. Analyze the implications and applications of the Fourteenth Amendment, focusing on the due process and equal protection clauses"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048BBF","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"e. Explain how the Supreme Court used the incorporation doctrine to expand the influence of the due process clause of the Fourteenth Amendment in cases, such as Gitlow v. New York (1925), Near v. Minnesota (1931), Mapp v. Ohio (1961) (Unit 5)"}]},{"leaf":false,"text":"5. The student will analyze elements, proceedings, and decisions related to criminal and civil law (1.2.5).","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048BC0","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"a. Describe the role of the courts in settling disputes between individuals"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048BC1","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"b. Analyze alternatives to litigation in the United States legal system for maintaining order and resolving conflicts including out-of-court settlements, arbitration and mediation"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048BC2","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"c. Identify the elements of civil law including: plaintiff, defendant, contract, breach of contract, torts, damages, preponderance of evidence, petit jury"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048BC3","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"d. Identify the elements of criminal law including: defendant, prosecutor, reasonable doubt, felony, misdemeanor, grand jury, indictment, probable cause, presumption of innocence, plea bargaining, writ of habeas corpus, subpoena"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048BC4","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"e. Compare the proceedings of civil and criminal cases including: grand jury, petit jury, indictment, standards of proof (beyond a reasonable doubt and preponderance of the evidence), plea bargaining, probable cause, writ of habeas corpus, and subpoena (Unit 5)"}]}]}]}]},{"leaf":false,"text":"2.0 CONTENT STANDARD: PEOPLES OF THE NATION AND WORLD – Students will understand the diversity and commonality, human interdependence, and global cooperation of the people of Maryland, the United States and the World through both a multicultural and historic perspective.","children":[{"leaf":false,"text":"CLG Expectation 2.1 The student will evaluate the interdependent relationship of United States politics and government to world affairs.","children":[{"leaf":false,"text":"B. Cultural Diffusion: Foreign Policy","children":[{"leaf":false,"text":"1. The student will analyze economic, political, social issues and their effect on foreign policies of the United States (2.1.1)","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048BEE","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"a. Explain how the executive develops and implements foreign policy, such as executive agreements, the appointment of foreign ambassadors and the creation of treaties"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048BEF","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"b. Evaluate how policies of the executive affect relationships with other countries including alliances for national defense, arms control, economic trade, and social programs (Unit 4)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048BF1","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"c. Analyze isolationism v. interventionism in United States foreign policy"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048BF3","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"d. Evaluate how international issues and interests affect national government policy, such as anti-terrorism policy, protection of human rights and international economic stability"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048BF4","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"e. Examine how foreign aid affects the United States relationships with other countries"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048BF6","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"f. Evaluate the goals of United States foreign policy, such as national security, economic stability, promoting the spread of democracy"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048BF8","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"g. Analyze the effect of trade and trade policy including: free trade agreements, embargoes, tariffs and economic sanctions on relationships with other countries"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048BFA","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"h. Analyze contemporary concerns that affect international relationships and government policies, such as world health, human rights, nation-building, national security and weapons of mass destruction, outsourcing and technology transfer (Unit 6)"}]}]},{"leaf":false,"text":"C. Conflict and Compromise","children":[{"leaf":false,"text":"1. The student will evaluate the effectiveness of international alliances and organizations from the perspective of the United States (2.1.2).","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048BFE","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"a. Explain the various roles of the United Nations (UN) such as maintaining international peace, enforcing international law, addressing human rights violations and solving international problems"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048C00","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"b. Explain the role of the International Federation of the Red Cross and the Red Crescent and other agencies, such as United States Agency for International Development (USAID) and the World Health Organization (WHO) in addressing humanitarian issues"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048C02","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"c. Describe the roles of the International Monetary Fund (IMF) and the World Bank"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048C04","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"d. Examine the function and purpose of the North American Free Trade Agreement (NAFTA), the United Nations and the North Atlantic Treaty Organization (NATO)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048C05","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"e. Describe the responsibility of the United States as a member of various international organizations including the United Nations (UN), North Atlantic Treaty Organization (NATO), and the World Bank (Unit 6)"}]}]}]},{"leaf":false,"text":"CLG Expectation 2.2 The student will compare and evaluate the effectiveness of the United States system of government and various other political systems.","children":[{"leaf":false,"text":"A. Elements of Culture: Governments","children":[{"leaf":false,"text":"1. The student will analyze advantages and disadvantages of various types of governments throughout the world (2.2.1)","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048BDE","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"a. Describe the advantages and disadvantages of a direct and representative democracy"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048BE0","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"b. Compare confederate, unitary and federal forms of government and determine how each assists or impedes the functioning of government"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048BE1","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"c. Compare parliamentary and presidential democracies"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048BE3","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"d. Describe the characteristics of limited (democratic) and unlimited (authoritarian) governments"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048BE4","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"e. Evaluate the advantages and disadvantages of limited and unlimited political systems"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048BE6","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"f. Explain how governments with written constitutions are not necessarily constitutional governments which follow the rule of law such as Peoples Republic of China and North Korea (Unit 1)"}]}]}]}]},{"leaf":false,"text":"3.0 CONTENT STANDARD: GEOGRAPHY – Students will use geographic concepts and processes to examine the role of culture, technology, and the environment in the location and distribution of human activities and spatial connections throughout time.","children":[{"leaf":false,"text":"CLG Expectation 3.1 The student will demonstrate an understanding of the relationship of cultural and physical geographic factors in the development of government policy.","children":[{"leaf":false,"text":"A. Using Geographic Tools","children":[{"leaf":false,"text":"1. Analyze geographic issues and problems using geographic concepts","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048C08","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"a. Compare climate, land use, natural resources, population distribution, demographic and density maps of Maryland and the United States"}]}]},{"leaf":false,"text":"B. Geographic Characteristics of Places and Regions","children":[{"leaf":false,"text":"1. The student will analyze the roles and relationships of regions on the formation and implementation of government policy (3.1.3).","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048C0B","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"a. Explain how geographic characteristics and shared interests stimulate regional cooperation between governments"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048C0D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"b. Analyze how the population shifts in and between regions affects the formation and implementation of government policy, such as the relocation or loss of industry and urban flight"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048C0E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"c. Analyze the importance of regional characteristics and interests including economic development, natural resources, climate and environmental issues in formulating local, state, and national government policy"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048C10","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"d. Explain the geographic factors that influence foreign policy and international political relations (Unit 6)"}]}]},{"leaf":false,"text":"C. Movement of People, Goods and Ideas","children":[{"leaf":false,"text":"1. The student will evaluate demographic factors related to political participation, public policy and government policies (3.1.1).","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048C14","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"a. Evaluate the impact of changing population size on representation in legislative bodies as determined by the United States Census"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048C16","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"b. Explain the reasons for reapportionment and its impact on fiscal decisions and representation (Unit 3)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048C18","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"c. Determine the influence demographic factors, such as race, age, education, ethnicity and gender have on voting patterns"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048C1A","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"d. Analyze patterns, trends, and projections of population in regions and how these may affect the environment, society and government policy"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048C1C","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"e. Analyze the influence of demographic factors on the formation and implementation of government policy and funding decisions, such as education, health care and social security (Unit 6)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048C1E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"f. Determine the impact of reapportionment and redistricting on individuals, groups, local communities and regions"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048C20","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"g. Determine the impact of gerrymandering on groups, communities and the legislative bodies involved"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048C22","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"h. Analyze how demographic characteristics of constituents affect the election of representatives and the policy decisions they make (Unit 7)"}]}]},{"leaf":false,"text":"D. Modifying and Adapting the Environment","children":[{"leaf":false,"text":"1. The student will evaluate the role of government in addressing land use and other environmental issues (3.1.2).","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048C26","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"a. Analyze the affect of legislative decisions on land use and environmental issues"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048C28","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"b. Describe how local governments control the use of land and manage growth through zoning laws and/or ordinances (Unit 3)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048C29","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"c. Analyze the role of the state executive branch in addressing land use and environmental issues, such as Smart Growth, deforestation, urban sprawl, pollution, natural disasters, water resources, wetland preservation and critical areas"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048C2A","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"d. Analyze the role of the state and local governments in addressing land use, such as zoning issues, building moratoriums and wetland preservation (Unit 4)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048C2B","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"e. Evaluate the way national, state, and local governments develop policy to address land use and environmental issues, such as urban sprawl, Smart Growth and commercial use of public land (Unit 6)"}]}]}]}]},{"leaf":false,"text":"4.0 CONTENT STANDARD: ECONOMICS – Students will develop economic reasoning to understand the historical development and current status of economic principles, institutions, and processes needed to be effective citizens, consumers, and workers participating in local communities, the nation, and the world.","children":[{"leaf":false,"text":"CLG Expectation 4.1 The student will demonstrate an understanding of economic principles, institutions, and processes required to formulate government policy.","children":[{"leaf":false,"text":"A. Scarcity and Economic Decision-making","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048C2C","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. The student will utilize the principles of economic costs and benefits and opportunity cost to analyze the effectiveness of government policy in achieving socio-economic goals (4.1.2)."}]},{"leaf":false,"text":"B. Economic Systems and the Role of Government in the Economy","children":[{"leaf":false,"text":"1. The student will evaluate how governments affect the answers to the basic economic questions of what to produce, how to produce, and for whom to produce (4.1.1).","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048C31","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"a. Explain how traditional, command and market economies answer the basic economic questions of what to produce, how to produce and for whom to produce"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048C33","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"b. Describe how governments organize their economic system for the production, distribution and consumption of goods and services"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048C35","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"c. Explain how elements of market, command and tradition have shaped the United States' mixed economic system, such as consumer preferences and tariff policies (Unit 1)"}]},{"leaf":false,"text":"2. The student will examine regulatory agencies and their social, economic, and political impact on the country, a region, or on/within a state (4.1.3).","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048C37","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"a. Describe the role of regulatory agencies in carrying out the policies of the executive on the national and state level (Unit 4)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048C39","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"b. Describe the purpose, roles and responsibilities of regulatory agencies: Federal Trade Commission (FTC), Federal Aviation Administration (FAA), Environmental Protection Agency (EPA), Food and Drug Administration (FDA), Federal Communications Commission (FCC)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048C3A","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"c. Analyze how the actions of regulatory agencies address public issues, market failures and monopolies at the local, state and/or national level"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048C3B","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"d. Examine how other government agencies, such as the Maryland Public Service Commission, the Consumer Product Safety Commission, Securities and Exchange Commission, Occupational Safety and Health Administration fulfill the obligations of government and respond to issues in society (Unit 6)"}]},{"leaf":false,"text":"3. The student will evaluate the effectiveness of current monetary and fiscal policy on promoting full employment, price stability, and economic performance (4.1.4).","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048C3F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"a. Describe the role of the United States Congress and the Maryland General Assembly in developing fiscal policy and the approval of budgets"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048C41","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"b. Describe how national, state, and local legislative bodies use taxing and spending to influence the economy"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048C43","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"c. Evaluate the effectiveness of fiscal policy in achieving economic growth and employment, such as tax incentives and changes in spending (Unit 3)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048C45","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"d. Analyze the role of the executive on the national, state and local level in the budgetary process"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048C46","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"e. Determine how the executive branch influences economic performance by using the tools of fiscal policy including increasing and decreasing taxes and tariffs and/or spending (Unit 4)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048C48","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"f. Describe how the Federal Reserve System uses the three tools of monetary policy, including open market operations, changes in the discount (interest) rate and changes in the reserve requirements to influence the economy"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048C4A","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"g. Describe the effectiveness of monetary policy in achieving economic growth, full employment and price stability"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048C4C","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"h. Explain how the Consumer Price Index (CPI), the unemployment rate and the Gross Domestic Product (GDP) measure economic performance"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048C4E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"i. Explain how economic instability, including periods of growth and recession, is a part of the free enterprise system"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1048C50","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"j. Explain how inflation reduces buying power and may contribute to a slow down in the economy (Unit 6)"}]}]}]}]}]}]