[{"leaf":false,"text":"Civics-Government","children":[{"leaf":false,"text":"Civics-Government Standard: The student uses a working knowledge and understanding of governmental systems of Kansas and the United States and other nations with an emphasis on the United States Constitution, the necessity for the rule of law, the civic values of the American people, and the rights, privileges, and responsibilities of becoming active participants in our representative democracy.","children":[{"leaf":false,"text":"Benchmark 1: The student understands the rule of law as it applies to individuals; family; school; local, state and national governments.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047A8A","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"1. (K) recognizes rules and why they exist (e.g., home, classroom, playground)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047ABF","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"1. (K) discusses the need for rules in the family, school, and community with an understanding of both positive and negative consequences."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047ADF","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"1. (K) recognizes that rules provide order and safety and benefit all school and community members."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B01","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"1. (K) explains the purpose of rules and laws and why they are important in a community."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B02","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"2. (K) explains the necessity of rules in order to provide public safety in a free and orderly society."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B27","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"1. (A) evaluates rules and laws using two basic criteria: the law or rule serves the common good, the law or rule must be possible to follow."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047BCD","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"1. (K) understands laws must be followed by those in authority as well as those who are governed (limited government)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047BCE","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"2. (K) defines the rule of law as a legal principle that is easily understood, and can be applied to all, including those who are rule makers."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C11","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"1. (K) recognizes that every civilization has a form of law or order."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C48","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"1. (K) understands the difference between criminal and civil law as it applies to individual citizens (e.g., criminal: felony, misdemeanor, crimes against people, crimes against property, white-collar crimes, victimless crimes; civil: contracts, property settlements, child custody)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C49","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"2. (A) compares how juveniles and adults are treated differently under law (e.g., due process, trial, age restrictions, punishment, rehabilitation, diversion)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C4A","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"3. (A) evaluates the importance of the rule of law in protecting individual rights and promoting the common good."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CE0","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. (A) evaluates the purposes and function of law."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CE1","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. (A) analyzes how the rule of law can be used to protect the rights of individuals and to promote the common good (e.g., eminent domain, martial law during disasters, health and safety issues)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CE2","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. (K) defines civic life, politics, and governments."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CE3","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. (K) recognizes contracts may be verbal or legal agreements and are binding."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CE4","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. (A) defines and illustrates examples of torts (e.g., wrongful death, medical malpractice, defamation, personal injury, dignitary harms against a person, such as bodily injury or civil rights violations)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CE5","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. (A) defines and illustrates examples of misdemeanors and felonies (e.g. misdemeanors: traffic violation, small theft, trespassing; felonies: murder, sexual assault, large theft)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CE6","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"5. (K) explains Kansas court structure (e.g., Municipal Courts, District Courts, Court of Appeals, Supreme Court)."}]},{"leaf":false,"text":"Benchmark 2: The student understands the shared ideals and diversity of American society and political culture.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AA5","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"1. (K) recognizes appropriate ways to behave in the classroom."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AA6","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"2. (K) identifies the characteristics of a friend and/or helpful classmate."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AC0","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"1. (K) identifies shared ideals within American society (e.g., truth, fairness, justice, loyalty, freedom)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AE0","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"1. (K) identifies and defines the characteristics of a good citizen (e.g., honesty, courage, patriotism, tolerance, respect)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B03","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"1. (K) understands that civic values are influenced by people's beliefs and needs (e.g., need for safety, health, and well-being)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B28","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"1. (A) defines shared ideals across regions in the United States (e.g., the right to vote, freedom of religion and speech, concern for general welfare, consent of the governed)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047BCF","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"1. (K) describes the principles contained in the Declaration of Independence and the Constitution of the United States including the Bill of Rights (e.g., right to question the government, having a voice in government through representation)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047BD0","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"2. (K) compares how the Magna Carta, Mayflower Compact, Articles of Confederation and other similar documents influenced the development of American constitutional government."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047BD1","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"3. (A) explains the basic ideals of the American republican system (e.g., liberty, justice, equality of opportunity, human dignity)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047BD2","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"4. (K) identifies important founding fathers and their contributions (e.g., George Mason, Thomas Jefferson, James Madison, George Washington, Benjamin Franklin, Thomas Paine, Samuel Adams, John Adams)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C4B","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"1. (K) defines the rights guaranteed, granted, and protected by the Kansas Constitution and its amendments."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CA6","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"1. (K) explains the recurring problems and solutions involving minority rights (e.g., Title IX, job discrimination, affirmative action)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CE7","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. (K) recognizes that a nation's values are embodied in the Constitution, statutes, and important court cases (e.g., Dred Scott vs. Sanford, Plessy vs. Ferguson, Brown vs. Board of Education of Topeka)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CE8","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. (K) understands core civic values inherent in the United States Constitution, Bill of Rights, and Declaration of Independence that have been the foundation for unity in American society (e.g., right to free speech, religion, press, assembly; equality; human dignity; civic responsibility, sovereignty of the people)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CE9","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. (A) examines the fundamental values and principles of the American political tradition as expressed in historic documents, speeches and events, and ways in which these values and principles conflict (e.g., equal opportunity and fairness vs. affirmative action)."}]},{"leaf":false,"text":"Benchmark 3: The student understands how the United States Constitution allocates power and responsibility in the government.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AA7","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"1. (K) knows school authority figures and ways they establish order and provide safety in a school setting."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AC1","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"1. (A) demonstrates leadership qualities by taking on responsibilities in the classroom and home (e.g., line leader, passing out papers, keeping room clean)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AE1","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"1. (K) recognizes that the United States Constitution is a written plan for the rules of government (e.g., knows the Constitution lists rules of the government compared to the rules for the family, classroom, or school)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B29","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"1. (K) recognizes the United States Constitution as the document that defines the rights and responsibilities of citizens in the United States."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047BD3","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"1. (K) defines federalism as a system of government in which power is divided between national (central) and state governments as a way to distribute power by preventing a concentration of power."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047BD4","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"2. (K) defines the separation of power and gives examples of how power is limited (e.g., the President can nominate a Supreme Court Justice, but Congress has to approve)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047BD5","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"3. (K) describes how the United States Constitution supports the principle of majority rule, but also protects the rights of the minority."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047BD6","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"4. (A) explains the functions of the three branches of federal government (e.g., legislative-makes laws, executive-enforces laws, judicial-interprets laws)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047BD7","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"5. (K) identifies the key ideas of the Preamble."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C4C","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"1. (K) explains the three branches of Kansas government."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C4D","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"2. (K) explains how authority and responsibility are balanced and divided between national and state governments in a federal system (e.g., federal: postage regulation, coinage of money, federal highways, national defense; state: state highways, state parks, education)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C4E","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"3. (K) explains why separation of powers and a system of checks and balances are important to limit government."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C4F","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"4. (K) describes how citizens, legislators, and interest groups are involved in a bill becoming a law at the state level."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CA7","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"1. (K) understands that the United States Constitution is written by and for the people and it defines the authority and power given to the government as well as recognizes the rights retained by the state governments and the people (e.g., separation of power, limited government, state's rights, the concept \"by and for the people\")"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CA8","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"2. (A) researches historical examples of how legislative, executive, and judicial powers have been challenged at the national level (e.g., secession, appointment of officials, Marbury v Madison)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CA9","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"3. (K) explains how the United States Constitution can be changed through amendments."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CAA","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"4. (A) analyzes the Declaration of Independence and the United States Constitution to identify essential ideas of American constitutional government."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CEA","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. (K) describes the purposes, organization, and functions of the three branches of government and independent regulatory agencies in relation to the United States Constitution."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CEB","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. (K) explains Constitutional powers (e.g., expressed/enumerated, implied, inherent, reserved, concurrent)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CEC","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. (K) discusses that the United States Constitution has been able to sustain American government over time by the ability of the people to amend the document."}]},{"leaf":false,"text":"Benchmark 4: The student identifies and examines the rights, privileges, and responsibilities in becoming an active civic participant.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AA8","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"1. (A) demonstrates good citizenship (e.g., sharing, listening, taking turns, and following rules)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AC2","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"1. (K) identifies privileges as benefits which can be granted or taken away (e.g., being first in line, attending a field trip, extended recess time)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AE2","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"1. (A) discusses how rights and privileges change over time and in different situations (e.g., the right to vote at eighteen, the privilege of being louder on the playground than in the classroom)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B04","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"1. (K) recognizes that citizenship has rights, privileges, and civic responsibilities (e.g., community service, voting, treating others with respect)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B05","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"2. (K) understands the importance of communicating ideas to community leaders (e.g., expressing the need for a new city park, expressing concern over a landfill, requesting recycling programs)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B2A","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"1. (K) determines how people can participate in government and why it is important (e.g., jury duty, voting, running for office, community service)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B2B","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"2. (K) recognizes how individuals have a civic responsibility for meeting the needs of communities (e.g., responding to disasters with donations and volunteering, recycling)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047BD8","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"1. (K) understands that rights are personal, political and economic (e.g., personal: privacy, speech, religion; political: holding public office, voting; economic: employment, owning property, copyrights and patents)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047BD9","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"2. (K) understands that privileges require qualifications (e.g., driving: pass exam, age requirement; running for office: age requirement, must be a United States citizen, residency)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047BDA","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"3. (K) Recognizes that rights require responsibilities of citizenship (e.g., paying taxes, jury duty, military service, voting, obeying the law, public service)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047BDB","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"4. (K) examines the steps necessary to become an informed voter (e.g., voter registration, recognizes issues and candidates, personal choice, and voting)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C12","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"1. (A) compares and contrasts the rights of people living in Ancient Greece (Sparta and Athens) and Classical Rome with the modern United States."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C50","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"1. (A) designs, researches and completes a civic project related to a public issue at the state or local level (e.g., designs and carries out a civic-oriented project)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C51","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"2. (K) knows various procedures for contacting appropriate representatives for the purpose of expressing ideas or asking for help at the state or local level (e.g., public hearing, open meeting, phone, email, letter, personal interview)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CAB","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"1. (K) compares the popular vote with the Electoral College as a means to elect government officials."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CAC","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"2. (A) researches and analyzes a current issue involving rights from an historical perspective (e.g., civil rights, native Americans, organized labor)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CED","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. (A) examines the role of political parties in channeling public opinion, allowing people to act jointly, nominating candidates, conducting campaigns, and training future leaders."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CEE","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. (K) explains how public policy is formed and carried out at local, state, and national levels and what roles individuals and groups can play in the process."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CEF","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. (A) analyzes policies, actions, and issues regarding the rights of individuals to equal protection under the law."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CF0","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. (A) examines issues regarding political rights (e.g., to be an informed voter, participate in the political process, assume leadership roles)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CF1","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"5. (K) understands that civil disobedience is a form of protest and if taken to extreme, punishable by law."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CF2","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"6. (A) analyzes issues regarding economic freedoms within the United States (e.g., free enterprise, rights of individual choice, government regulation)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CF3","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"7. (K) explores issues regarding civic responsibilities of American citizens (e.g., obeying the law, paying taxes, voting, jury duty, serving our country, providing leadership, involvement in the political process)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CF4","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"8. (A) examines the role of interest groups and their impact on governmental policy."}]},{"leaf":false,"text":"Benchmark 5: The student understands various systems of governments and how nations and international organizations interact.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AA9","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"1. (K) identifies leaders at home and school (e.g., parents, guardians, teachers, principal)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AC3","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"1. (K) recognizes that people can make rules and leaders can enforce rules."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AE3","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"1. (A) demonstrates leadership in the classroom."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B06","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"1. (K) defines government as people or groups who make, apply, and enforce rules and laws for others within a family, school, or community."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B07","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"2. (K) identifies people or groups who make, apply, and enforce rules or laws within a family, school, or community (e.g., parent/guardian, police, mayor, governor, president)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B2C","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"1. (K) describes the function of state governments (e.g., establish law for the state, provide public service, provide public safety)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B2D","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"2. (K) defines capital as the location of state and national government."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B2E","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"3. (K) defines capitol as the building in which government is located."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C13","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"1. (K) identifies the basic features of systems of government (e.g., republic, democracy, monarchy, dictatorship, oligarchy, theocracy)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C14","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"2. (K) describes the ways political systems meet or fail to meet the needs and wants of their citizens (e.g., republic, democracy, monarchy, dictatorship oligarchy, theocracy)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C15","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"3. (K) defines the characteristics of nations (e.g., territory, population, government, sovereignty)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C52","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"1. (K) recognizes that cities are formed through a process of incorporation, establishing boundaries, creating a government, levying taxes."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C53","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"2. (K) identifies the types of local government (e.g., cities, townships, counties)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C54","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"3. (K) identifies the goods and services provided by local government in the community (e.g., education, health agency, fire department, police, care for local community property, parks and recreation)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C55","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"4. (A) researches the roles of people who make up local government (e.g., police, mayor/city manager, county commissioner, city council members, school board members)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C56","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"5. (K) understands the role of school boards."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CAD","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"1. (A) examines government responses to international affairs from an historical perspective (e.g., immigration, Spanish-American war,)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CF5","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. (A) compares various governmental systems with that of the United States government in terms of sovereignty, structure, function, decision-making processes, citizenship roles, and political culture and ideology (e.g., systems: constitutional monarchy, parliamentary democracy, dictatorship, totalitarianism; ideology: fascism, socialism, communism)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CF6","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. (K) discusses the structure of international relations both regional and world-wide (e.g., trade, economic and defense alliances, regional security)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CF7","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. (A) examines the purpose and functions of multi-national organizations (e.g., United Nations, NATO, International Red Cross)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CF8","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. explains the changing roles of the United States Government in the international community (e.g., treaties, NATO, UN, exploitative, altruistic, benign)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CF9","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"5. (A) examines a position concerning the use of various tools in carrying out United States foreign policy (e.g., trade sanctions, extension of the \"most favored nation\" status, military interventions)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CFA","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"6. (A) examines the issues of social justice and human rights as expressed in the United Nations Declaration of Human Rights."}]}]}]},{"leaf":false,"text":"Economics","children":[{"leaf":false,"text":"Economics Standard: The student uses a working knowledge and understanding of major economic concepts, issues, and systems of the United States and other nations; and applies decision-making skills as a consumer, producer, saver, investor, and citizen of Kansas and the United States living in an interdependent world.","children":[{"leaf":false,"text":"Benchmark 1: The student understands how limited resources require choices.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AAA","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"1. (K) - ($) understands that a person cannot have everything he/she wants, so a choice has to be made (e.g., play video games or watch television; play on swings or play soccer)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AAB","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"2. (K) - ($) explains what he/she gives up when a choice is made."}]}]},{"leaf":false,"text":"Economics Standard: The student uses a working knowledge and understanding of major economic concepts, issues, and systems, applying decision-making skills as a consumer, producer, saver, investor, and citizen of Kansas and the United States living in an interdependent world.","children":[{"leaf":false,"text":"Benchmark 1: The student understands how limited resources require choices.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AC4","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"1. (K) - ($) understands individuals and families cannot have everything they want, so they have to make choices (e.g., having to decide whether to buy a new video game or a pair of shoes)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AE4","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"1. (A) knows the difference between goods and services, and provides examples how each satisfies people's wants and needs."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AE5","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"2. (K) identifies examples of producers and consumers."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AE6","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"3. (A) - ($) identifies the opportunity cost of a choice (e.g., next best alternative not chosen)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B08","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"1. (K) knows that there are not enough available resources to satisfy all wants for goods and services."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B2F","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"1. (K) - ($) knows that every spending and saving decision has an opportunity cost."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B30","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"2. (A) identifies examples of how natural, capital, and human resources are used in production of goods and services (e.g., land resources [natural] are used to produce wheat [goods] that is harvested by skilled farmers [human] using combines [capital])."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B31","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"3. (A) traces the production, distribution, and consumption of a particular good in the state or region."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B32","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"4. (A) gives an example of economic specialization that leads to trade between regions of the United States (e.g., Kansas produces wheat and beef and trades with other regions, Michigan produces automobiles, the Southeast produces rice, the Northwest produces paper)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047BDC","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"1. (K) explains how scarcity of resources requires individuals, communities, states, and nations to make choices about goods and services (e.g., what food to eat, type of housing to live in, how to use land)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047BDD","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"2. (A) determines how unlimited wants and limited resources lead to choices that involve opportunity costs."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047BDE","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"3. (K) describes how specialization results in increased productivity (e.g., when each person in a city specializes in producing one product and then sells or trades with each other, there is more produced than if everyone tried to make everything they need for themselves)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047BDF","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"4. (A) gives examples of economic interdependence at either the local, state, regional, or national level. (e.g., Western settlers depended on Easterners for textiles; Easterners depended on Westerners for furs and hides)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C16","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"1. (K) explains how scarcity of resources requires communities and nations to make choices about goods and services (e.g., what foods to eat, where to settle, how to use land)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C17","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"2. (A) gives examples of international economic interdependence. (e.g., Europe depended on the Far East for spices & tea; Far East received silver and gem stones in exchange)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C57","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"1. (K) identifies substitutes and complements for selected goods and services (e.g., substitutes: sod houses vs. wood houses, wagons vs. railroads; complements: trains and rails, wagons and wheels)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C58","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"2. (K) explains that how people choose to use resources has both present and future consequences."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CAE","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"1. (A) analyzes the effect of scarcity on the price, production, consumption and distribution of goods and services (e.g., price goes up and production goes down, consumption goes down and distribution is limited)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CFB","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. (A) explains how economic systems affect the allocation of scarce resources (e.g., monarchies, financing explorers, mercantilism, rise of capitalism)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CFC","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. (K) explains how economic choices made by societies have intended and unintended consequences. (e.g., mercantilism, \"planned economy\" under Soviet Union, Adam Smith-Invisible hand/Laissez Faire)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CFD","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. (K) explains how people respond to incentives in order to allocate scarce resources (e.g., government subsidies/farm production, rationing coupons/WWII, emission regulations, profits/war production, women/WWII workforce)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CFE","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. (K) explains how economic choices made by individuals, businesses, or governments often have intended and unintended consequences (e.g., individual: build a house in a flood plain; business: car, need for roads, railroads, ecosystems; government: isolationism at beginning of WWI, Prohibition Act, Space Race, building of atomic bomb)."}]},{"leaf":false,"text":"Benchmark 2: The student understands how the market economy works in the United States.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AAC","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"1. (K) - ($) understands the use of money to purchase goods and services."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AC5","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"1. (K) - ($) understands the concept of exchange and the use of money to purchase goods and services."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AE7","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"1. (K) - ($) understands the concept of exchange and the use of money to purchase goods and services (e.g., trade with barter or money)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B09","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"1. (A) identifies and gives examples of markets that occur when buyers and sellers exchange goods and services in the community."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B33","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"1. (K) - ($) defines the characteristics of an entrepreneur and gives an example of someone who shows those characteristics (e.g., risk taker, innovator, gets together all resources needed to produce a product)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047BE0","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"1. (A) defines supply as the quantity of resources, goods, or services that sellers offer at various prices at a particular time and demand as the number of consumers willing and able to purchase a good or service at a given price."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047BE1","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"2. (K) identifies factors that change supply or demand for a product (e.g., supply: technology changes; demand: invention of new and substitute goods; supply or demand: climate and weather)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047BE2","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"3. (K) describes how changes in supply and demand affect prices of specific products."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C59","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"1. (A) - ($) analyzes the impact of inflation or deflation on the value of money and people's purchasing power (e.g., cattle towns, mining towns, time of \"boom\", time of depression)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CAF","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"1. (K) explains how relative price, people's economic decisions, and innovations influence the market system (e.g., cotton gin led to increased productivity, more cotton produced, higher profits, and lower prices; steamboat led to increased distribution of goods, which brought down prices of goods and allowed goods to be more affordable to people across the United States; development of railroad led to transportation of cattle to eastern markets, price was decreased and profit was increased, timely access to beef)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CB0","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"2. (K) - ($) describes the four basic types of earned income (e.g., wages and salaries, rent, interests, and profit)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CB1","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"3. (K) - ($) explains the factors that cause unemployment (e.g., seasonal demand for jobs, changes in skills needed by employers, other economic influences, downsizing, outsourcing)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CB2","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"4. (K) - ($) describes the positive and negative incentives to which employees respond (e.g., wage levels, benefits, work hours, working conditions)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CFF","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. (K) defines Gross Domestic Product (GDP) and indicates the components that make up our nation's GDP (e.g., consumption, investment, government, and net exports)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D00","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. (K) explains the factors that have contributed to United States economic growth (e.g., increasing education and literacy, health care advances, technology developments)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D01","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. (K) explains the principles of demand and supply (e.g., laws, equilibrium, change in quantity vs. change in demand and supply)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D02","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. (K) explains the factors that could change supply of or demand for a product (e.g., societal values: prohibition of alcohol; scarcity of resources: war; technology: assembly line production)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D03","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"5. (A) analyzes how changes in prices affect consumer behavior and sometimes result in government actions (e.g., WWII-rationing, fuel, metals, nylon; Arab oil embargo of 1974; droughts (Ag products), changes in consumer preferences—fads, health information)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D04","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"6. (K) describes what happens to the product price and output of businesses when the degree of competition changes in an industry (e.g., oil, steel, automobiles (1970s), railroads in late 1800's and early 1900's, AT&T, Microsoft, Trusts of 1920's & 1930's)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D05","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"7. (A) analyzes the role of central banks and the Federal Reserve System in the economy of the United States (e.g., interest rates, monetary policy, government bonds)."}]},{"leaf":false,"text":"Benchmark 3: The student analyzes how different incentives, economic systems and their institutions, and local, national, and international interdependence affect people.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AAD","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"1. (K) - ($) discusses the benefits of saving money."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AC6","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"1. (K) - ($) discusses why people save money in a bank."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AE8","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"1. (K) - ($) explains the advantage of choosing to save or spend money that is earned or received."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AE9","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"2. (K) - ($) defines a budget as a plan for spending and saving income."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B0A","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"1 (K) - ($) knows that when borrowing money the consumer is receiving credit that must be repaid."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B34","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"1. (K) defines market economy as an economic system in which buyers and sellers make major decisions about production and distribution, based on supply and demand."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047BE3","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"1. (K) - ($) understands that banks are institutions where people (individuals, families, and businesses) save money and earn interest and where people borrow money and pay interest."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047BE4","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"2. (A) - ($) gives examples of how positive and negative incentives affect people's behavior (e.g., laws: Stamp Act, Sugar Act; profit; product price; indentured servant)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047BE5","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"3. (K) recognizes barriers to trade among people across nations (e.g., quotas, tariffs, boycotts, geography)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C18","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"1. (K) recognizes the economic conditions under which trade takes place among nations (e.g., students recognize that trade takes place when nations have wants or needs they cannot fulfill on their own)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C19","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"2. (K) identifies barriers to trade among nations (e.g., treaties, war, transportation, geography)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C5A","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"1. (A) describes examples of factors that might influence international trade (e.g., United States economic sanctions, weather, exchange rates, war, boycotts, embargos)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C5B","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"2. (K) explains the costs and benefits of trade between people across nations (e.g., job loss vs. cheaper prices, environmental costs vs. wider selection of goods and services)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C5C","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"3. (A) gives examples of factors that might influence international trade (e.g., United States economic sanctions, weather, exchange rate, war, boycotts, embargos)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C5D","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"4. (A) gives examples of how tariffs, quotas, and other trade barriers affect consumers and the prices of goods (e.g., a country fearful of purchasing Kansas beef for fear of disease, tariffs on Kansas wheat)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CB3","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"1. (K) describes examples of specialized economic institutions found in market economies (e.g., corporations, partnerships, proprietorships, labor unions, banks, and non-profit organizations)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D06","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. (A) compares the benefits and costs of different allocation methods (e.g., first come, first serve; prices, contests, lottery, majority rule)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D07","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. (A) compares characteristics of traditional command, market, and mixed economies on the basis of property rights, factors of production and locus of economic decision making (e.g., what, how, for whom)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D08","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. (A) uses comparative advantage to explain the benefits of trade among nations (e.g., nations can benefit from free trade while reducing or eliminating production of a good in which it is technologically superior at producing; to benefit from specialization and free trade, one nation should specialize and trade the good in which it is \"most best\" at producing, while the other nation should specialize and trade the good in which it is \"least best\" at producing; benefits include more product selection, lower prices, higher wages in both nations)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D09","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. (A) outlines the cost and benefits of free trade or restricted trade policies in world history (e.g., restrictions of trade under mercantilism, regional trade agreements, Smoot-Hawley Tariff Act of 1930, General Agreement on Tariffs & Trade (GATT), World Trade Organization (WTO))."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D0A","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"5. (K) explains how a change in exchange rates affects the flow of trade between nations and a nation's domestic economy (e.g., using historical examples such as development of the Euro, devaluation of the United States dollar in the early 1970s, & currency boards in the transitional economies of Eastern Europe)."}]},{"leaf":false,"text":"Benchmark 4: The student analyzes the role of the government in the economy.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B0B","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"1. (A) - ($) lists goods and services in the community that are paid for by taxes (e.g., roads, parks, schools, fire protection)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047BE6","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"1. (K) - ($) describes revenue sources for different levels of government (e.g., personal income taxes, property taxes, sales tax, interest, bonds)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C5E","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"1. (K) identifies goods and services provided by local, state, and national governments (e.g., transportation, education, defense)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C5F","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"2. (A) examines relationship between local and state revenues and expenditures (e.g., school bonds, sales tax, property tax, teacher salaries, curbs and gutters, police force)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CB4","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"1. (K) gives examples of how monopolies affect consumers, the prices of goods, laborers, and their wages (e.g., monopolistic employers and development of labor unions; oil, steel, and railroad monopolies; anti-trust laws)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D0B","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. (A) explains why certain goods and services are provided by the government (e.g., infrastructure, schools, waste management, national defense, parks, environmental protection)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D0C","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. (A) explains the advantages and disadvantages of the use of fiscal policy by the Federal Government to influence the United States economy (e.g., change in taxes & spending to expand or contract the economy, such as Franklin D. Roosevelt's New Deal, George W. Bush's tax cuts, Gerald Ford's WIN program)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D0D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. (K) distinguishes between government debt and government budget deficit."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D0E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. (A) evaluates the costs and benefits of governmental economic and social policies on society (e.g., minimum wage laws, anti-trust laws, EPA Regulations, Social Security, farm subsidies, international sanctions on agriculture, Medicare, unemployment insurance, corporate tax credits, public work projects)."}]},{"leaf":false,"text":"Benchmark 5: The student makes effective decisions as a consumer, producer, saver, investor, and citizen.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AAE","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"1. (A) - ($) gives examples of types of jobs that he/she does within the family."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AC7","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"1. (K) - ($) understands that people have jobs to earn a wage."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AEA","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"1. (K) - ($) understands that people earn an income and sometimes benefits for the work they do and gives examples of different types of work within a community both today and in the past."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AEB","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"2. (K) - ($) knows that a decision-making process can help people make spending and saving decisions."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B0C","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"1. (A) - ($) analyzes how needs and wants are met through spending and saving decisions."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B0D","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"2. (K) - ($) identifies consequences of borrowing and lending."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B0E","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"3. (A) - ($) gives an example of income and how the money was spent or saved."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B35","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"1. (A) - ($) discusses ways workers can improve their ability to earn income by gaining new knowledge, skills, and experience."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B36","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"2. (A) analyzes the costs and benefits of making a choice."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047BE7","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"1. (A) - ($) determines the costs and benefits of a spending, saving, or borrowing decision."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047BE8","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"2. (K) - ($) recognizes that supply of and demand for workers in various careers affect income."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C1A","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"1. (A) - ($) determines the costs and benefits of a spending, saving, or borrowing decision."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C1B","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"2. (K) - ($) explains that budgeting requires trade-offs in managing income and spending."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C1C","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"3. (K) identifies the opportunity cost that resulted from a spending decision."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C1D","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"4. (A) - ($) analyzes how supply of and demand for workers in various careers affect income."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C60","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"1. (A) - ($) compares the benefits and costs of spending, saving, or borrowing decisions based on information about products and services."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C61","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"2. (K) explains how an individual's income will differ in the labor market depending on supply of and demand for his/her human capital (e.g., skills, abilities, and/or education level)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CB5","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"1. (K) - ($) explains how saving accumulation is influenced by the amount saved, the rate of return and time."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CB6","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"2. (A) - ($) determines the opportunity cost of decisions related to a personal finance plan or budget."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D0F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. (K) - ($) describes how various jobs and employment are impacted by changes in the economy."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D10","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. (K) - ($) illustrates how the demand for labor is influenced by productivity of labor and explains the factors that influence labor productivity (e.g., education, experience, health, nutrition, technology)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D11","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. (A) - ($) explains how the demand for and supply of labor are influenced by productivity, education, skills, retraining, and wage rates (e.g., spinning mills and the beginning of the modern factory system, the increased use of machinery throughout the Industrial Revolution, assembly lines)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D12","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. (A) - ($) develops a personal budget that identifies sources of income and expenditures (e.g., wages, rent payments, savings, taxes, insurance)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D13","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"5. (K) - ($) determines the costs and benefits of using credit."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D14","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"6. (A) - ($) analyzes the costs and benefits of investment alternatives (e.g., stock market, bonds, real estate)."}]}]}]},{"leaf":false,"text":"Geography","children":[{"leaf":false,"text":"Geography: The student uses a working knowledge and understanding of the spatial organization of Earth's surface and relationships between peoples and places and physical and human environments in order to explain the interactions that occur in Kansas, the United States, and in our world.","children":[{"leaf":false,"text":"Benchmark 1: Geographic Tools and Location: The student uses maps, graphic representations, tools, and technologies to locate, use, and present information about people, places, and environments.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AAF","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"1. (A) identifies and correctly uses terms related to location, direction, and distance (e.g., up/down, left/right, near/far, here/there)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AB0","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"2. (K) locates major geography features (e.g., Equator, North Pole, South Pole, his/her Hometown, Kansas)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AC8","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"1. (K) describes the purposes of maps and globes (e.g., model of earth, representation of earth's features)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AC9","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"2. (A) finds Kansas on a wall map."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047ACA","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"3. (A) makes a map to represent some location important to them."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047ACB","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"4. (K) locates major geography locations (e.g., United States, Canada, Mexico, Atlantic Ocean, Pacific Ocean)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AEC","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"1. (A) makes and uses maps to represent and locate familiar places within cities and Kansas (e.g., title, symbols, legend, compass rose, cardinal directions, grid system)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AED","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"2. (K) identifies and correctly uses terms: North, South, East, West."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AEE","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"3. (K) locates major geography features (e.g., Rocky Mountains, Missouri River, Gulf of Mexico, Kansas City, Wichita, Topeka, Washington, DC)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B0F","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"1. (A) applies geographic tools, including grid systems, symbols, legends, scales and a compass rose to construct and interpret maps."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B10","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"2. (A) uses a data source as a tool (e.g., graphs, charts, tables)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B11","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"3. (A) identifies and gives examples of the difference between political and physical features on a map."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B12","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"4. (K) locates the oceans and continents (e.g., Pacific, Atlantic, Arctic, and Indian Ocean; North America, South America, Asia, Australia, Europe, Africa, Antarctica)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B13","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"5. (A) compares characteristics of urban, suburban, and rural areas."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B14","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"6. (A) discusses reasons for the particular locations in a community are used for certain human activities (e.g., residential, commercial, industrial, transportation, recreation, agricultural)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B15","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"7. (K) locates major political features (e.g., Los Angeles, New York City, Denver, Chicago, his/her county, his/her neighboring cities, his/her county seat)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B37","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"1. (A) applies geographic tools, including grid systems, symbols, legends, scales, and a compass rose to construct and interpret maps."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B38","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"2. (A) uses a data source as a tool (e.g., graphs, charts, tables)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B39","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"3. (A) identifies and give examples of the difference between political and physical features within a region."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B3A","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"4. (K) identifies major landforms and bodies of water in regions of the United States (e.g., mountains, plains, islands, peninsulas, rivers, oceans)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B3B","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"5. (K) locates major physical and political features of regions from memory (e.g., Appalachian Mountains, the Great Lakes, 50 States, Kansas River, Arkansas River, Atlanta, Grand Canyon, Gulf of California, Mt. McKinley, Puerto Rico, Prime Meridian, International Dateline, Arctic Circle, Antarctic Circle, San Francisco, Dallas, Phoenix, Seattle, Everglades, Yellowstone National Park, Niagara Falls, Mississippi River)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047BE9","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"1. (A) explains and uses map titles, symbols, cardinal directions and intermediate directions, legends, latitude and longitude."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047BEA","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"2. (K) locates major physical and political features of Earth from memory (e.g., Boston, Philadelphia, England, France, Italy, Spain, North America, Atlantic Ocean, Pacific Ocean, Yucatan Peninsula, Germany, Aleutian Islands, Bering Strait, Chesapeake Bay, Hudson Bay, Mexico City, Montreal, Netherlands, Norway, Ohio River, Portugal, Quebec City, St. Lawrence River)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C1E","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"1. (A) explains and uses map titles, symbols, cardinal and intermediate directions, legends, latitude and longitude."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C1F","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"2. (K) locates major physical and political features of Earth from memory (e.g., China, Egypt, Greece, Central America, Mediterranean Sea, Nile River, Persian Gulf, Rome, India, Sahara Desert, Saudi Arabia, Adriatic Sea, Aegean Sea, Constantinople (modern Istanbul), Ganges River, Himalayan Mountains, Huan He (Yellow River), Indus River, Jerusalem, Mecca, Mesopotamia (modern Iraq), Persia (modern Iran), Red Sea, Tigris River, Yangtze River, Chile, Brazil, Peru, Amazon River, Andes Mountains)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C20","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"3. (A) identifies major patterns of world populations, physical features, ecosystems, and cultures using historic and contemporary geographic tools (e.g., maps, illustrations, photographs, documents, data)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C62","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"1. (K) locates major political and physical features of Earth from memory and describes the relative location of those features (e.g., see Appendix 2 for list of items)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C63","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"2. (A) develops and uses different kinds of maps, globes, graphs, charts, databases, and models."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C64","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"3. (A) uses mental maps of Kansas to answer questions about the location of physical and human features (e.g., drier in the West; major rivers; population centers; major cities: Topeka, Wichita, Hays, Dodge City, Kansas City; major interstates and highways: I- 70, US 56)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C65","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"4. (A) selects and explains reasons for using different geographic tools, graphic representation, and/or technologies to analyze selected geographic problems (e.g., map projections, aerial photographs, satellite images, geographic information systems)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C66","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"5. (A) uses geographic tools, graphic representation, and/or technologies to pose and answer questions about past and present spatial distributions and patterns (e.g., mountain ranges, river systems, field patterns, settlements, transportation routes)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CB7","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"1. (K) locates major political and physical features of Earth from memory and describes the relative location of those features (e.g., Atlanta, New Orleans, Salt Lake City, San Antonio, Columbia River, St. Louis, Rio Grande, Black Hills, Continental Divide)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CB8","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"2. (A) creates maps, graphs, charts, databases and/or models to support historical research."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D15","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. (K) locates major political and physical features of Earth from memory and compares the relative locations of those features. Locations will be included in indicator at each grade level (e.g., Beijing, English Channel, India, Iraq, Moscow, Sahara Desert, South Africa, Venezuela, Balkan Peninsula, Berlin, Black Sea, Bosporus Strait, Euphrates River, Geneva, Hong Kong, Israel, Libya, North Korea, Pakistan, Saudi Arabia, Singapore, South Korea, Suez Canal, Tigris River, Tokyo, Yangtze River)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D16","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. (A) interprets maps and other graphic representations to analyze United States and world issues (e.g., urban vs. urban areas, development vs. conservation, land use in the world vs. local community, nuclear waste disposal, relocation of refugees)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D17","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. (A) analyzes ways in which mental maps influence past, present, and future decisions about location, settlement, and public policy (e.g., building sites, planned communities, settlement sites)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D18","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. (A) produces maps and other geographic representations, using data from a variety of sources to answer questions and solve problems (e.g., census data, interviews, geographic information system (GIS) and other databases, questionnaires)."}]},{"leaf":false,"text":"Benchmark 2: Places and Regions: The student analyzes the human and physical features that give places and regions their distinctive character.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AB1","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"1. (K) describes characteristics of local surroundings (e.g., classroom, playground, neighborhood, city, school)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047ACC","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"1. (A) maps physical and human features of the school (e.g., physical: hills, creeks, trees; human: play equipment, fences, sidewalks)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AEF","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"1. (K) identifies physical and human changes that have taken place over time in the local region (e.g., physical: tornadoes, drought, Kansas as an inland sea; human: new shopping centers, highways, houses)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B16","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"1. (A) identifies the physical characteristics of the local community (e.g., landforms, bodies of water, natural resources, weather, seasons)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B3C","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"1. (A) identifies and compares the physical characteristics of eastern to western Kansas and regions of the United States (e.g., rainfall, location, land and water features, climate, vegetation, natural resources)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B3D","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"2. (K) identifies the human characteristics of Kansas and regions of the United States (e.g., people, religions, languages, customs, economic activities, housing, foods)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047BEB","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"1. (K) identifies and compares the major physical characteristics of New England Colonies, Middle Colonies, and Southern Colonies and French and Spanish territories (e.g., location, climate, and resources)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047BEC","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"2. (K) identifies and compares the human characteristics of the New England Colonies, Middle Colonies, and Southern Colonies and French and Spanish territories (e.g., national origins, religion, customs, government, agriculture, industry, and architecture)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C21","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"1. (A) identifies types of regions (e.g., climatic, economic, cultural)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C22","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"2. (K) describes how places and regions may be identified by cultural symbols (e.g., Acropolis in Athens, Muslim minaret, Indian sari)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C23","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"3. (K) identifies and describes the location, landscape, climate, and resources of early world civilizations (e.g., Mesopotamia, Egypt, India, China, Greece, Rome, Middle/South America, Western Europe, West Africa, Japan)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C24","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"4. (A) compares and contrasts early world civilizations in terms of human characteristics (e.g., people, religion, language, customs, government, agriculture, industry, architecture, arts, education)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C25","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"5. (A) traces the movement (diffusion) from one region or center of civilization to other regions of the world (e.g., people, goods, and ideas)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C68","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"1. (A) identifies and compares the physical characteristics of world regions (e.g., locations, landscape, climate, vegetation, resources)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C69","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"2. (A) identifies and compares the human characteristics of world regions (e.g., people, religion, language, customs, government, agriculture, industry, architecture, arts, education)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C6A","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"3. (K) identifies and explains how Kansas, United States, and world regions are interdependent (e.g., through trade, diffusion of ideas, human migration, international conflicts and cooperation)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C6B","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"4. (K) identifies the various physical and human criteria that can be used to define a region (e.g., physical: mountain, coastal, climate; human: religion, ethnicity, language, economic, government)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C6C","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"5. (K) identifies ways technology or culture has influenced regions (e.g., perceptions of resource availability, dominance of specific regions, economic development)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C6D","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"6. (A) explains the effects of a label on the image of a region (e.g., Tornado Alley, Sun Belt, The Great \"American\" Desert)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CB9","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"1. (K) identifies and explain the changing criteria that can be used to define a region (e.g., North, South, Border States, Northwest Territory)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CBA","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"2. (A) explain why labels are put on regions to create an identity (e.g., Coal/Iron/Rust Belt, North-Yankee/ South-Dixie)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D19","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. (A) demonstrates how various regional frameworks are used to interpret the complexity of Earth (e.g., vegetation, climate, religion, language, occupations, industries, resources, governmental systems, economic systems)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D1A","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. (A) analyzes the factors that contribute to human changes in regions (e.g., technology alters use of place, migration, changes in cultural characteristics, political factors)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D1B","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. (K) recognizes how regional identity both unifies and delineates groups of people (e.g., being from the Midwest both connects a person to others from that region and defines them to others as Midwesterners with particular characteristics and values)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D1C","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. (A) uses regions to analyze past and present issues to answer questions (e.g., conflicts caused by overlapping regional identities, causes and impacts of regional alliances, changing regional identities)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D1D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"5. (A) analyzes the ways in which people's perception of places and regions affect their decisions (e.g., land use, property value, settlement patterns, job opportunities)."}]},{"leaf":false,"text":"Benchmark 3: Physical Systems: The student understands Earth's physical systems and how physical processes shape Earth's surface.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AB2","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"1. (A) describes seasonal changes and how they affect an individual."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047ACD","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"1. (K) observes and identifies local weather conditions and patterns."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AF0","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"1. (K) describes how weather affects environment (e.g., deciding when crops are planted and harvested, lack of rain causes drought, early freeze kills plants)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B17","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"1. (A) compares various ecosystems in the community (e.g., locations and characteristics of plant and animal life)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B3E","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"1. (K) identifies and describes the physical components of Earth's atmosphere, land, water, biomes (e.g., temperature, precipitation, wind, climate, mountains, plains, islands, oceans, lakes, rivers, aquifers, plants, animals, habitats)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B3F","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"2. (A) explains features and patterns of Earth's surface in terms of physical processes (e.g., weathering, erosion, water cycle, soil formation, mountain building)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B40","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"3. (A) explains the functions and relationships of ecosystems in Kansas and across the United States (e.g., food chains, water, link between flora and fauna and the environment)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047BED","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"1. (K) identifies renewable and nonrenewable resources and their uses (e.g., fossil fuels, minerals, fertile soil, water power, forests, solar and wind power)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C26","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"1. (K) explains the distribution patterns of ecosystems within hemispheres to define climatic regions."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C27","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"2. (K) identifies renewable and nonrenewable resources and their uses (e.g., fossil fuels, minerals, fertile soil, waterpower, forests)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C6E","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"1. (K) explains how earth-sun relationships affect earth's physical processes and create physical patterns (e.g., latitude regions, climate regions, distribution of solar energy, ocean currents)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C6F","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"2. (K) explains patterns in the physical environment in terms of physical processes (e.g., tectonic plates, glaciation, erosion and deposition, hydrologic cycle, ocean and atmospheric circulation)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C70","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"3. (K) describes the characteristics of ecosystems in terms of their biodiversity (e.g., biodiversity: food chains, plant and animal communities; ecosystems: grasslands, temperate forests, tropical rainforests, deserts, tundra, wetlands, and marine environments)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C71","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"4. (K) explains the challenges faced by ecosystems (e.g., effects of shifting cultivation, contamination of coastal waters, rainforest destruction, desertification, deforestation, overpopulation, natural disasters)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D1E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. (A) analyzes the patterns of physical processes and their effect on humans (e.g., weather patterns, earthquakes, drought, desertification)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D1F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. (A) analyzes the distribution of ecosystems by examining relationships between soil, climate, plant, and animal life."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D20","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. (K) describes the ways in which Earth's physical processes are dynamic and interactive (e.g., rising ocean levels, sea floor spreading, wind and water deposition, climatic changes)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D21","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. (A) analyzes an ecosystem to understand and solve problems regarding environmental issues (e.g., carrying capacity, biological magnification, reduction of species diversity, acid rain, ozone depletion, contamination)."}]},{"leaf":false,"text":"Benchmark 4: Human Systems: The student understands how economic, political, cultural, and social processes interact to shape patterns of human populations, interdependence, cooperation, and conflict.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AF1","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"1. (K) identifies the past and present settlement or development patterns of his/her community or local area."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B18","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"1. (A) examines how people in their community interact with people in other communities in Kansas."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B41","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"1. (K) describes the types and characteristics of political units (e.g., city, county, state, country)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B42","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"2. (K) identifies conditions that determine the location of human activities (e.g., resources, population, transportation, and technology)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047BEE","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"1. (A) explains reasons for variation in population distribution (e.g., environment, migration, government policies)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047BEF","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"2. (A) identifies the push-pull factors (causes) of human migration (e.g., push: war, famine, lack of economic opportunity; pull: religious freedom, economic opportunity, joining family or friends)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047BF0","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"3. (K) describes the effects of human migration on place and population (e.g., population shifts, conflict, acculturation; diffusion of ideas, diseases, crops and culture)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047BF1","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"4. (K) describes factors that influence and change the location and distribution of economic activities (e.g., resources, technology, transportation and government)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047BF2","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"5. (A) understands that forces of conflict and cooperation divide or unite people (e.g., land disputes, religious intolerance, taxation)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C28","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"1. (A) examines reasons for variation in population distribution (e.g., environment, migration, government policies, birth and death rates)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C29","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"2. (K) describes the forces and processes of conflict and cooperation that divide or unite people (e.g., uneven distribution of resources, water use in ancient Mesopotamia, building projects in ancient Egypt and Middle/South America, the Greek city-states, empire building, movements for independence or rights)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C72","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"1. (A) describes and analyzes population characteristics through the use of demographic concepts (e.g., population pyramids, birth/death rates, population growth rates, migration patterns)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C73","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"2. K) explains how the spread of cultural elements results in distinctive cultural landscapes (e.g., religion, language, customs, ethnic neighborhoods, foods)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C74","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"3. (K) identifies the geographic factors that influence world trade and interdependence (e.g., location advantage, resource distribution, labor cost, technology, trade networks and organizations)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CBB","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"1. (A) evaluates demographic data to analyze population characteristics in the United States over time (e.g., birth/death rates, population growth rates, migration patterns: rural, urban)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CBC","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"2. (A) analyzes push-pull factors including economic, political, and social factors that contribute to human migration and settlement in United States (e.g., economic: availability of natural resources, job opportunities created by technology; political: Jim Crow laws, freestaters; social factors: religious, ethnic discrimination)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CBD","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"3. (K) compares cultural elements that created the distinctive cultural landscapes during the Civil War (e.g., technology, crops, housing types, agricultural methods, settlement patterns)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CBE","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"4. (K) identifies the geographic factors that influenced United Statesworld interdependence in the 19th century (e.g., location advantage, resource distribution, labor cost, technology, trade networks)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D22","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. (A) identifies trends of population growth and migration in response to environmental, social, economic, political, or technological factors (e.g., stress on infrastructure, impact on environment, cultural diffusion, socio-economic changes and pressures)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D23","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. (A) analyzes how communication and transportation facilitate cultural interchange (e.g., nationalism, ethnic pride, cross-cultural adaptation, popularity of ethnic foods)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D24","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. (A) evaluates market areas to determine reasons for success or failure (e.g., advantages of location, trade partnerships, land value, wars, labor supply and cost, resource availability, transportation access, government structure, political cooperation)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D25","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. (A) analyzes the purpose and characteristics of settlements (e.g., village vs. town vs. city, cities in development vs. developed countries, rise of megalopolis edge cities and metropolitan corridors, regional characteristics of cities, impact of transportation technology, increasing number of ethnic enclaves)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D26","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"5. (K) gives examples of how cultural cooperation and conflict are involved in shaping the distribution of and connections between cultural, political, and economic spaces on Earth (e.g., cultural: Hindu vs. Muslims in India; political: International Court of Justice and Hong Kong; economic: World Trade Organization)."}]},{"leaf":false,"text":"Benchmark 5: Human-Environment Interactions: The student understands the effects of interactions between human and physical systems.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AB3","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"1. (K) identifies ways people can maintain or improve the quality of their environment."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047ACE","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"1. (K) identifies ways in which people depend on the physical environment to meet needs and wants (e.g., water, food, fuel)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047ACF","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"2. (K) describes how the physical environment impacts humans (e.g., choices of clothing, housing, crops, recreation)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AD0","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"3. (A) lists ways people can maintain or help the quality of their environment."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AF2","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"1. (K) describe how physical systems influence people and their activities."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B19","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"1. (A) discusses the consequences of human modifications in their community on the environment over time (e.g., flood control, mining, farming, chemical uses, community development, transportation)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B1A","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"2. (K) identifies ways in which human activities are impacted by the physical environment (e.g., types of housing, agricultural activities, fuel consumption, clothing, recreation, jobs, resource availability)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B43","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"1. (A) examines natural resource challenges and ways people have developed solutions as they use renewable and nonrenewable resources (e.g., lack of water, eroding soil, lack of land, limitations of fossil fuels)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047BF3","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"1. (A) examines varying viewpoints regarding resource use (e.g., American Indian vs. European settler, past vs. present)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047BF4","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"2. (K) identifies the relationship between the acquisition and use of natural resources and advances in technology using historical and contemporary examples (e.g., compass for navigation, water power, steel plow)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C2A","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"1. (A) explains how humans modify the environment and describes some of the possible consequences of those modifications (e.g., Greeks clearing the vegetation of the hillsides, dikes on the Nile and in the Mesopotamia raising the level of the river, terracing in Middle America and Asia)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C2B","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"2. (K) describes the impact of natural hazards on people and their activities (e.g., floods: Egypt-Nile, Mesopotamia-Tigris/Euphrates; volcanic eruptions: Mt. Vesuvius)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C2C","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"3. (A) explains the relationship between the availability and use of natural resources and advances in technology using historical and contemporary examples (e.g., clay tablets, papyrus, paper-printing press, computer)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C2D","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"4. (A) explains the relationship between resources and the exploration, colonization and settlement patterns of different world regions (e.g., mercantilism, imperialism, and colonialism)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C75","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"1. (K) identifies ways in which technologies have modified the physical environment of various world cultures (e.g., dams, levees, aqueducts, irrigation, roads, bridges, plow)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C76","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"2. (K) describes the consequences of having or not having particular resources (e.g., resource movement and consumption, relationship between access to resources and living standards, relationship between competition for resources and world conflicts)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CBF","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"1. (A) examines how human beings removed barriers to settlement by moving needed resources across the United States"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D27","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. (A) examines the impact that technology has on human modification of the physical environment (e.g., over-fishing, logging and mining, construction on floodplains, internal combustion engine, toxic waste)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D28","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. (A) examines alternative strategies to respond to constraints placed on human systems by the physical environment (e.g., irrigation, terracing, sustainable agriculture, water diversion, natural disasterresistant construction)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D29","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. (A) discusses the pros and cons of specific policies and programs for resource use and management (e.g., EPA, building restrictions, mandated recycling, grazing)."}]}]}]},{"leaf":false,"text":"Kansas, United States, and World History","children":[{"leaf":false,"text":"History Standard: The student uses a working knowledge and understanding of significant individuals, groups, ideas, events, eras, and developments in the history of Kansas, the United States, and the world, utilizing essential analytical and research skills.","children":[{"leaf":false,"text":"Benchmark 1: The student understands the significance of important individuals and major developments in history.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AB4","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"1. (K) identifies and explains how tools and technology used in the home/school meet people's needs."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AD1","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"1. (A) tells the story of an important person in his/her life."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AD2","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"2. (K) identifies the office of the president as the leader of the United States and identifies the first president and the current president."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AF3","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"1. (A) compares various forms of transportation in Kansas past and present (e.g., the horse, steamboat, trains, airplanes, cars)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AF4","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"2. (A) compares and contrasts the ways people communicate with each other past and present."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AF5","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"3. (A) identifies important innovations made in the past that influence today (e.g., Wright Brothers – airplane; Henry Ford – automobile; Ancient China – irrigation, paper; Inca – highways to connect cities)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AF6","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"4. (K) recognizes the impact of contributions made by leaders past and present."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B1B","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"1. (A) researches the contributions of historical and current day individuals significant in his/her community."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B44","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"1. (A) researches the contributions made by notable Kansans in history (e.g., Dwight David Eisenhower, Alf Landon, Amelia Earhart, George Washington Carver, Robert Dole, William Allen White, Langston Hughes, Carry A. Nation, Black Bear Bosin, Gordon Parks, Clyde Cessna, Charles Curtis, Walter Chrysler, Wyatt Earp)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B45","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"2. (K) uses traditional stories from regions of the United States to help define the region."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B46","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"3. (K) describes the observations of the explorers who came to what was to become Kansas (e.g., Francisco Coronado, Meriwether Lewis and William Clark, Zebulon Pike, Stephen H. Long)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B47","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"4. (K) describes how communication and transportation systems connect Kansas to other regions, past and present (e.g., trails, Pony Express, telegraph, steamboats, railroad lines, highway systems, air transportation, Internet)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B48","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"5. (A) compares and contrasts the purposes of the Santa Fe and Oregon-California Trails (e.g., commercial vs. migration)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B49","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"6. (K) describes life on the Santa Fe and Oregon-California Trails (e.g., interactions between different cultural groups, hardships such as lack of water, mountains and rivers to cross, weather, need for medical care, size of wagon)."}]},{"leaf":false,"text":"Benchmark 2: The student understands the importance of the experiences of groups of people who have contributed to the richness of our heritage.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AB5","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"1. (K) explains how each individual has a personal history."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AB6","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"2. (A) compares and contrasts his/her own life with life in a city and/or a rural community."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AD3","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"1. (K) - ($) describes the needs of a family (e.g., food, shelter)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AD4","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"2. (K) describes the different foods produced in Kansas over time (e.g., wheat, corn, soybeans, sunflowers, livestock)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AD5","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"3. (A) compares at least two types of shelter used by families today (e.g., apartment, frame house, mobile home, duplex)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AD6","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"4. (A) compares types of shelter used by American Indians in Kansas over time (e.g., grass lodge, tipi, earth lodge, frame house)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AD7","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"5. (K) identifies types of shelter used by early Kansas families (e.g., dugouts, sod houses, log cabins, frame houses)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AD8","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"6. (A) uses a timeline to share the history of a family (e.g., his/her own family, a family from literature)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AF7","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"1. (A) compares and contrasts daily life of an historic Plains Indian family, a pioneer family, and a modern family in Kansas."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AF8","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"2. (A) defines immigration and gives past and present examples from Kansas."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AF9","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"3. (K) defines history as the story of the past."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B1C","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"1. (A) compares life in his/her community with another community. (e.g., population/location, jobs, customs, history, natural resources, ethnic groups, local government)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B1D","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"2. (A) retells the history of the community using local documents or artifacts."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B4A","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"1. (A) compares the various reasons several immigrant groups settled in Kansas (e.g., English, German, German-Russian, French, Swedish, Czechoslovakian, Croatian, Serbian, Mexican, African American, Vietnamese, Cambodian, Laotian)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B4B","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"2. (K) explains the economic and cultural contributions made by immigrant groups in Kansas (e.g., jobs, agriculture, mining, arts, customs, celebrations)."}]},{"leaf":false,"text":"Benchmark 3: The student understands the significance of events, holidays, documents, and symbols that are important to Kansas, United States, and World history.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AB7","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"1. (K) identifies family customs and traditions and explains their importance."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AB8","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"2. (K) understands that Kansas is a state in the United States and the significance of Kansas Day as the celebration of the state's birthday."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AB9","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"3. (A) locates the state of Kansas using a map of the United States."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047ABA","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"4. (K) recognizes important Kansas state symbols (e.g., state bird – meadowlark, state flower – sunflower, state animal-buffalo)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AD9","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"1. (K) recognizes the United States flag, Pledge of Allegiance, and bald eagle as important national symbols."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047ADA","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"2. (K) recognizes the Kansas flag and identifies the symbols on it (e.g., motto, stars, American Indians and buffalo, farmer plowing, pioneers and cabin, steamboat, etc.)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047ADB","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"3. (K) identifies some important United States national holidays (e.g., Independence Day, Columbus Day, Veterans Day, Thanksgiving, Martin Luther King, Jr. Day, Presidents' Day, Memorial Day)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AFA","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"1. (K) recognizes the importance of the Declaration of Independence and the Star Spangled Banner."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AFB","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"2. (A) locates and explains the importance of landmarks and historical sites today (e.g., Plymouth Rock, United States Capitol, Statue of Liberty, Kitty Hawk, Kansas State Capitol, Mt. Rushmore, Mesa Verde, the Alamo, Sutter's Mill)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B1E","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"1. (K) explains customs related to holidays and ceremonies celebrated by specific cultural groups in Kansas (e.g., Christmas, Cinco de Mayo, Hanukkah, Kwanzaa, Lunar New Year, Ramadan, St. Lucia, St. Patrick's Day)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B1F","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"2. (K) locates and explains the importance of landmarks and historical sites within the local community or his/her region of Kansas."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B20","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"3. (A) describes various cultures by studying dance, music, folklore, and arts of ethnic groups within his/her community or region of Kansas."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B4C","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"1. (K) explains the origin of the name \"Kansas.\""},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B4D","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"2. (K) describes the history of the Kansas state song, \"Home on the Range.\""}]},{"leaf":false,"text":"Benchmark 4: The student engages in historical thinking skills.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047ABB","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"1. (K) places events in sequential order."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047ABC","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"2. (A) uses information to find main idea."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047ABD","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"3. (K) scans historic photographs to gain information."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047ABE","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"4. (A) asks questions, shares information, and discusses ideas about the past."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047ADC","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"1. (K) puts events in chronological order."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047ADD","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"2. (A) uses information to provide details to support a main idea in history."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047ADE","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"3. (A) asks questions, shares information and discusses ideas about the past using resources such as maps, photographs, books, and people."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AFC","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"1. (A) creates and uses timelines."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AFD","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"2. (A) locates information using both primary and secondary sources."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AFE","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"3. (A) uses information to understand cause and effect."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047AFF","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"4. (A) compares and contrasts to draw conclusions."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B00","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"5. (A) uses research skills (e.g., discusses ideas; formulates broad and specific questions; finds and selects information with help; records, organizes and shares information)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B21","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"1. (A) creates and uses timelines to illustrate a community's history."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B22","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"2. (A) locates information about communities from a variety of sources."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B23","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"3. (A) uses information to frame important historical questions."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B24","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"4. (A) observes and draws conclusions in his/her own words."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B25","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"5. (A) identifies and compares information from primary and secondary sources."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B26","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"6. (A) uses research skills (e.g., selects relevant information, organizes and shares information in his/her own words, discusses ideas, formulates broad and specific questions at both the knowledge and comprehension level, with help knows there are different formats of information, and records information)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B4E","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"1. (A) creates and uses historical timelines (e.g., time periods, eras, decades, centuries)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B4F","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"2. (A) develops a thesis statement around a historical question."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B50","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"3. (K) understands the difference between inferred information and observed information."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B51","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"4. (A) identifies and compares information from primary and secondary sources (e.g., photographs, diaries/journals, newspapers, historical maps)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047B52","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"5. (A) uses research skills to interpret an historical person or event in history and notes the source(s) of information (e.g., discusses ideas; formulates broad and specific questions; determines a variety of sources; locates, evaluates, organizes, records and shares relevant information in both oral and written form)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C0B","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"1. (A) uses historical timelines to trace the cause and effect relationships between events in different places during the same time period (e.g., Colonial America and England)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C0C","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"2. (A) examines multiple primary sources to understand point of view of an historical figure."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C0D","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"3. (A) locates information using a variety of sources to support a thesis statement."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C0E","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"4. (A) uses information including primary sources to debate a problem or an historical issue."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C0F","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"5. (A) observes and draws conclusions."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C10","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"6. (A) uses research skills to interpret an historical person or event in history and notes the source(s) of information (e.g., discusses ideas; formulates broad and specific questions; determines a variety of sources; locates, evaluates, organizes, records and shares relevant information in both oral and written form)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C44","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"1. (A) examines a topic in World history to analyze changes over time and makes logical inferences concerning cause and effect (e.g., spread of ideas and innovation, rise and fall of empires)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C45","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"2. (A) examines a variety of primary sources in World history and analyzes them in terms of credibility, purpose, and point of view (e.g., census records, diaries, photographs, letters, government documents)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C46","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"3. (A) uses at least three primary sources to interpret a person or event from World history to develop an historical narrative."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C47","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"4. (A) compares contrasting descriptions of the same event in World history to understand how people differ in their interpretations of historical events."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CDC","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"1. (A) examines a topic in United States history to analyze changes over time and makes logical inferences concerning cause and effect."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CDD","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"2. (A) examines a variety of different types of primary sources in United States history and analyzes them in terms of credibility, purpose, and point of view (e.g., census records, diaries, photographs, letters, government documents)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CDE","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"3. (A) uses at least three primary sources to interpret a person or event from United States history to develop a historical narrative."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CDF","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"4. (A) compares contrasting descriptions of the same event in United States history to understand how people differ in their interpretations of historical events."}]},{"leaf":false,"text":"Benchmark 1: The student uses a working knowledge and understanding of individuals, groups, ideas, developments, and turning points in the age of exploration.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047BF8","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"1. (K) explains how various American Indians adapted to their environment in relationship to shelter and food (e.g., Plains, Woodland, Northwest Coast, Southeast and Pueblo cultures in the period from 1700-1820)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047BF9","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"2. (A) shows how traditional arts and customs of various American Indians are impacted by the environment (e.g., Plains, Woodland, Northwest Coast, Southeast and Pueblo cultures in the period from 1700-1820)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047BFA","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"3. (A) compares the motives and technology that encouraged European exploration of the Americas (e.g., motives: trade, expansion, wealth, discovery; technology: improved ship building, sextant, cartography)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047BFB","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"4. (A) examines the interaction between European explorers and American Indians (e.g., trade, cultural exchange, disease)."}]},{"leaf":false,"text":"Benchmark 2: The student uses a working knowledge and understanding of individuals, groups, ideas, developments, and turning points in colonization era of the United States (1607-1763).","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047BFC","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"1. (K) explains why early settlements succeeded or failed (e.g., Pilgrims, Puritans, St. Augustine, Quebec)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047BFD","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"2. (A) maps the patterns of colonial settlement (e.g., British, French, Spain, and Indigenous populations)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047BFE","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"3. (K) describes political and economic structures in the New England, Middle, and Southern Colonies (e.g., political: House of Burgesses, town meetings, colonial forms of representation; economics: agriculture, trade)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047BFF","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"4. (A) compares and contrasts the impact of European settlement from an American Indian and European point of view."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C00","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"5. (A) analyzes the causes and impact of forced servitude in North America (e.g., indentured servant, Middle Passage, and slave life)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C01","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"6. (K) explains the causes and effects of the French and Indian War on the American Revolutionary period."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C02","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"7. (K) explains the impact of religious freedom as colonies were settled by various Christian groups (e.g., Catholics in Maryland, Quakers in Pennsylvania, Puritans in Massachusetts)."}]},{"leaf":false,"text":"Benchmark 3: The student uses a working knowledge and understanding of individuals, groups, ideas, developments, and turning points in the American Revolution and the United States becoming a nation (1763 to 1800).","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C03","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"1. (K) describes the causes of the American Revolution (e.g., Proclamation of 1763, Intolerable Acts, Stamp Act, taxation without representation)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C04","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"2. (K) explains the significance of important groups in the American Revolution (e.g., Loyalists, Patriots, Sons of Liberty)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C05","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"3. (A) examines the significance of important turning points in the American Revolution (e.g., Boston Massacre, Continental Congress, Boston Tea Party, Lexington and Concord, Saratoga, Valley Forge, Yorktown)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C06","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"4. (K) discusses the international support for the American Revolution (e.g., French, Lafayette)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C07","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"5. (K) discusses the strengths and weaknesses of the Articles of Confederation."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C08","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"6. (K) describes how the Constitutional Convention led to the creation of the United States Constitution (e.g., Great Compromise, Three- Fifths Compromise)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C09","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"7. (K) recognizes the importance of the presidency as it was defined by George Washington (e.g., leadership qualities, balance of power, setting precedent, cabinet selection, term limits)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C0A","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"8. (K) explains United States land policy and its impact on American Indians (e.g., sale of western lands, Land Ordinance of 1785, the Northwest Ordinance of 1787)."}]},{"leaf":false,"text":"Benchmark 1: The student uses a working knowledge and understanding of individuals, groups, ideas, eras, developments, and turning points in the history of the world from the emergence of human communities to 500BC.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C31","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"1. (K) explains the importance of the Neolithic Agricultural Revolution in moving people from Nomadic to settled village life (e.g., food production, changing technology, domestication of animals)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C32","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"2. (A) compares the origin and accomplishments of early river valley civilizations (e.g., Tigris and Euphrates (Mesopotamia): city-states, Hammurabi's code; Nile Valley (Egypt): Pharaoh, centralized government; Indus Valley (India): Mohenjo Daro; Huang He (China): Shang Dynasty)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C33","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"3. (K) explains central beliefs of early religions (e.g., polytheism, monotheism, animism)."}]},{"leaf":false,"text":"Benchmark 2: The student uses a working knowledge and understanding of individuals, groups, ideas, eras, developments, and turning points in the history of the world from 500BC to 700AD.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C34","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"1. (K) compares and contrast characteristics of classic Greek government (e.g., city-states, slavery, rule by aristocrats and tyrants, Athens: development of democracy, Sparta: city's needs come first)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C35","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"2. (K) describes the significant contributions of ancient Greece to western culture (e.g., philosophy: Socrates, Plato, Aristotle; literature/drama: Homer, Greek plays, architecture, sculpture)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C36","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"3. (K) explains the cultural interactions in the Hellenistic Age (e.g., Alexander the Great, Persian Empire)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C37","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"4. (K) describes key characteristics of classical Roman government (e.g., Roman Republic: senate, consuls, veto, written law; Roman Empire: emperors, expansion)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C38","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"5. (A) analyzes the reasons for the decline and fall of the Roman Empire."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C39","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"6. (A) examines the central beliefs of Christianity, Hinduism, Buddhism, Judaism, and Islam."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C3A","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"7. (A) traces the development and spread of Christianity."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C3B","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"8. (K) describes key cultural accomplishments of classical India (e.g., Asoka, Sanskrit literature, the Hindu-Arabic numerals, the zero, Buddhism, Hinduism)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C3C","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"9. (K) describes key accomplishments of ancient China (e.g., Great Wall of China, Shi Huangdi, dynastic cycle, Mandate of Heaven, Taoism, Confucianism, civil service, Silk Road)."}]},{"leaf":false,"text":"Benchmark 3: The student uses a working knowledge and understanding of individuals, groups, ideas, eras, developments, and turning points in the history of the world from 700-1400.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C3D","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"1. (K) describes the governmental/political, social, and economic institutions and innovations of the Maya, Aztec, and Inca civilizations."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C3E","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"2. (K) describes the governmental/political, social, and economic institutions and innovations of the Byzantine Empire."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C3F","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"3. (K) describes the political and economic institutions of medieval Europe (e.g., manorialism, feudalism, Magna Carta, Christendom, rise of cities and trade)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C40","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"4. (K) describes Japanese feudalism and compares to European feudalism."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C41","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"5. (A) explains geographic, economic, political reasons for Islam's spread into Europe, Asia, and Africa (e.g., geographic, economic, political reasons)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C42","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"6. (A) discusses how the Crusades allowed interaction between the Islamic world and medieval Europe (e.g., science, education, architecture, mathematics, medicine, the arts, literature)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C43","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"7. (K) explains the impact of Mongol Empires (e.g., trade routes, Silk Road, horse, Ghengis Khan)."}]},{"leaf":false,"text":"Benchmark 1: The student understands individuals, groups, ideas, events, and developments during the period before settlement in pre-territorial Kansas (pre 1854).","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C7E","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"1. (A) compares and contrasts nomadic and sedentary tribes in Kansas (e.g., food, housing, art, customs)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C7F","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"2. (A) describes the social and economic impact of Spanish, French and American explorers and traders on the Indian tribes in Kansas."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C80","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"3. (K) explains how Stephen H. Long's classification of Kansas as the \"Great American Desert\" influenced later United States government policy on American Indian relocation."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C81","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"4. (A) analyzes the impact of the Indian Removal Act of 1830 on the way of life for emigrant Indian tribes relocated to Kansas (e.g., loss of land and customary resources, disease and starvation, assimilation, inter-tribal conflict)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C82","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"5. (K) describes the role of early Kansas forts in carrying out the United States government's policies in regards to relocated Indian tribes and travel on the Santa Fe and Oregon-California trails (e.g., Fort Leavenworth, Fort Scott, Fort Larned, and Fort Riley)."}]},{"leaf":false,"text":"Benchmark 2: The student understands individuals, groups, ideas, events, and developments during Kansas territory and the Civil War (1854-1865).","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C83","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"1. (A) describes the concept of popular sovereignty under the Kansas- Nebraska Act and its impact on developing a state constitution."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C84","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"2. (K) describes how the dispute over slavery shaped life in Kansas Territory (e.g., border ruffians, bushwhackers, jayhawkers, the Underground Railroad, free-staters, abolitionists)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C85","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"3. (A) analyzes the importance of \"Bleeding Kansas\" to the rest of the United States in the years leading up to the Civil War (e.g., national media attention, caning of Senator Charles Sumner, Emigrant Aid Societies, Beecher Bible and Rifle Colony, poems of John Greenleaf Whittier, John Brown)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C86","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"4. (K) describes the role of important individuals during the territorial period (e.g., Charles Robinson, James Lane, John Brown, Clarina Nichols, Samuel Jones, David Atchison, Andrew H. Reeder)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C87","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"5. (A) analyzes the Wyandotte Constitution with respect to the civil rights of women and African Americans."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C88","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"6. (K) describes important events in Kansas during the Civil War (e.g., Quantrill's Raid on Lawrence, the Battle of Mine Creek, recruitment of volunteer regiments)."}]},{"leaf":false,"text":"Benchmark 3: The student understands individuals, groups, ideas, events, and developments during the period of expansion and development in Kansas (1860s - 1870s).","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C89","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"1. (K) describes the reasons for tension between the American Indians and the United States government over land in Kansas (e.g., encroachment on Indian lands, depletion of the buffalo and other natural resources, the Sand Creek massacre, broken promises)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C8A","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"2. (K) describes the United States government's purpose for establishing frontier military forts in Kansas (e.g., protection of people, land, resources)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C8B","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"3. (A) determines the significance of the cattle drives in post-Civil War Kansas and their impact on the American identity (e.g., Chisholm Trail, cowboys, cattle towns)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C8C","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"4. (A) traces the migration patterns of at least one European ethnic group to Kansas (e.g., English, French, Germans, German- Russians, Swedes)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C8D","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"5. (K) describes the reasons for the Exoduster movement from the South to Kansas (e.g., relatively free land, symbol of Kansas as a free state, the rise of Jim Crow laws in the South, promotions of Benjamin \"Pap\" Singleton)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C8E","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"6. (K) explains the impact of government policies and the expansion of the railroad on settlement and town development (e.g., preemption, Homestead Act, Timber Claim Act, railroad lands)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C8F","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"7. (A) uses primary source documents to determine the challenges faced by settlers and their means of adaptations (e.g., drought, depression, grasshoppers, lack of some natural resources, isolation)."}]},{"leaf":false,"text":"Benchmark 4: The student understands individuals, groups, ideas, events, and developments during the period of reform in Kansas (1880s - 1920s).","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C90","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"1. (A) describes the movement for women's suffrage and its effect on Kansas politics (e.g., the fight for universal suffrage, impact of women on local elections)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C91","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"2. (K) describes the development of Populism in Kansas (e.g., disillusionment with big Eastern business, railroads, government corruption, high debts and low prices for farmers)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C92","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"3. (K) explains the accomplishments of the Progressive movement in Kansas (e.g. election and government reforms, labor reforms, public health campaigns, regulation of some businesses)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C93","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"4. (K) analyzes the impact of Kansas reformers on the nation (e.g., Populists: Mary E. Lease, Annie Diggs, William Peffer, \"Sockless\" Jerry Simpson; Progressives: Carry A. Nation, Samuel Crumbine, William Allen White, Socialists: J.A. Wayland, Kate Richards O'Hare, Emanuel and Marcet Haldeman-Julius)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C94","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"5. (K) describes the significance of farm mechanization in Kansas (e.g., increased farm size and production, specialized crops, population redistribution)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C95","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"6. (A) explains the significance of the work of entrepreneurial Kansans in the aviation industry (e.g., Alvin Longren, Clyde Cessna, Walter and Olive Beech, Lloyd Stearman)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C96","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"7. (A) describes the contributions made by Mexican immigrants to agriculture and the railroad industry."}]},{"leaf":false,"text":"Benchmark 5: The student understands individuals, groups, ideas, events, and developments in Kansas during the Great Depression and World War II. (1930s - 1940s).","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C97","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"1. (A) compares agricultural practices before and after the dust storms of the 1930s (e.g., rotation of crops, shelter belts, irrigation, terracing, stubble mulch)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C98","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"2. (A) uses local resources to describe conditions in his/her community during the Great Depression."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C99","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"3. (A) researches the contributions of Kansans during the 1930s & 1940s (e.g., Amelia Earhart, Osa and Martin Johnson, Glenn Cunningham, Walter Chrysler, Langston Hughes, John Steuart Curry, Dwight Eisenhower, Alf Landon, Arthur Capper, Birger Sandzen)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C9A","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"4. (K) summarizes the effects of New Deal programs on Kansas life."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C9B","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"5. (K) explains how World War II acted as a catalyst for change in Kansas (e.g., women entering work force, increased mobility, changing manufacturing practices)."}]},{"leaf":false,"text":"Benchmark 6: The student understands individuals, groups, ideas, events, and developments in contemporary Kansas (since 1950).","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C9C","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"1. (K) analyzes the concept of \"separate but equal is inherently unequal\" in regards to the Supreme Court case Brown vs. Topeka Board of Education and how it continues to impact the nation."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C9D","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"2. (K) describes major flood control projects in the 1950s."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C9E","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"3. (A) describes the role of Kansas culture in the dramas of Pulitzer prize-winning playwright William Inge and the writings, photos, and films of Gordon Parks."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047C9F","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"4. (A) analyzes the effect of rural depopulation and increased urbanization and suburbanization on Kansas."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CA0","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"5. (K) explains the reasons Southeast Asians immigrated to Kansas after 1975 (e.g., church, community, organizations, jobs, the fall of Southeast Asian governments)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CA1","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"6. (K) identifies issues facing Kansas state government in the 2000s (e.g., economic diversity, global economy, water issues, school funding)."}]},{"leaf":false,"text":"Benchmark 7: The student engages in historical thinking skills.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CA2","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"1. (A) analyzes changes over time to make logical inferences concerning cause and effect by examining a topic in Kansas history."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CA3","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"2. (A) examines different types of primary sources in Kansas history and analyzes them in terms of credibility, purpose, and point of view (e.g., census records, diaries, photographs, letters, government documents)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CA4","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"3. (A) uses at least three primary sources to interpret the impact of a person or event from Kansas history to develop an historical narrative."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CA5","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"4. (A) compares contrasting descriptions of the same event in Kansas history to understand how people differ in their interpretations of historical events."}]},{"leaf":false,"text":"Benchmark 1: The student uses a working knowledge and understanding of individuals, group, ideas, developments, and turning points in the early years of the United States.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CC3","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"1. (K) explains the major compromises made to create the Constitution (e.g., Three-Fifth's Compromise, Great Compromise, Bill of Rights)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CC4","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"2. (K) describes how the conflicts between Thomas Jefferson and Alexander Hamilton resulted in the emergence of two political parties (e.g., Alien and Sedition Act, National Bank, view on foreign policy)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CC5","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"3. (A) describes the impact of the War of 1812 (e.g., nationalism, political parties, foreign relations)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CC6","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"4.  (A) explains the impact of constitutional interpretation during the era (e.g., Alien and Sedition Act, Louisiana Purchase, Marshall Court - Marbury vs. Madison, McCullough vs. Maryland (1819))."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CC7","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"5. (A) analyzes how territorial expansion of the United States affected relations with external powers and American Indians (e.g., Louisiana Purchase, concept of Manifest Destiny, previous land policies-Northwest Ordinance, Mexican-American War, Gold Rush)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CC8","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"6. (A) explains how the Industrial Revolution and technological developments impacted different parts of American society (e.g., interchangeable parts, cotton gin, railroads, steamboats, canals)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CC9","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"7. (K) defines and gives examples of issues during Andrew Jackson's presidency (e.g., expansion of suffrage, appeal to the common man, justification of spoils system, opposition to elitism, opposition to Bank of the U.S., Indian Removal of 1830)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CCA","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"8. (K) analyzes the development of nativism as a reaction to waves of Irish and German immigrants."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CCB","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"9. (A) explains the impact on American society of religious, social, and philosophical reform movements of the early 19th century (e.g., abolition, education, mental health, women's rights, temperance)."}]},{"leaf":false,"text":"Benchmark 2: The student uses a working knowledge and understanding of individuals, groups, ideas, developments, and the causes and effects of the Civil War.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CCC","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"1. (K) explains the issues of nationalism and sectionalism (e.g., expansion of slavery, tariffs, westward expansion, internal improvements, nullification)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CCD","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"2. (A) discusses the impact of constitutional interpretation during the era (e.g., Dred Scott vs. Sanford, Plessy vs. Ferguson, Lincoln's suspension of Habeas Corpus)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CCE","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"3. (K) retraces events that led to sectionalism and secession prior to the Civil War (e.g., Missouri Compromise, Compromise of 1850, Kansas-Nebraska Act-Popular Sovereignty, Uncle Tom's Cabin)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CCF","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"4. (A) explains the issues that led to the Civil War (e.g., slavery, economics, and state's rights)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CD0","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"5. (K) describes the turning points of the Civil War (e.g., Antietam, Gettysburg, Emancipation Proclamation, and Sherman's March to the Sea)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CD1","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"6. (A) compares and contrasts various points of views during the Civil War era (e.g., abolitionists vs. slaveholders, Robert E. Lee vs. Ulysses S. Grant, Abraham Lincoln vs. Jefferson Davis, and Harriett Beecher Stowe vs. Mary Chestnut)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CD2","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"7. (A) compares and contrasts different plans for Reconstruction (e.g., plans advocated by President Lincoln, congressional leaders, President Johnson)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CD3","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"8. (K) discusses the impeachment and trial of President Andrew Johnson (e.g., constitutional powers and Edmund G. Ross)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CD4","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"9. (A) analyzes the impact of the end of slavery on African Americans (e.g., Black Codes; sharecropping; Jim Crow; Amendments 13, 14, and 15; Frederick Douglass; Ku Klux Klan; Exodusters)."}]},{"leaf":false,"text":"Benchmark 3: The student uses a working knowledge and understanding of individuals, groups, ideas, events, eras, and developments in the history of Kansas, the United States, and turning points in the era of the Industrial era.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CD5","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"1. (A) interprets the impact of the romance of the west on American culture (e.g., Frederick Jackson Turner, western literature, Buffalo Bill Cody's Wild West Show, Frederick Remington, the cowboy)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CD6","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"2. (K) explains the impact of the railroad on the settlement and development of the West (e.g., transcontinental railroad, cattle towns, Fred Harvey, town speculation, railroad land, immigrant agents)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CD7","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"3. (K) describes federal American Indian policy after the Civil War (e.g., Dawes Act, boarding schools, forced assimilation)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CD8","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"4. (K) explains American Indians' reactions to encroachment on their lands and the government response (e.g., Chief Joseph, Helen Hunt Jackson, Crazy Horse, Sitting Bull, Geronimo, Sand Creek, Washita, Little Big Horn, and Wounded Knee)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CD9","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"5. (K) explains how the rise of big business, heavy industry, and mechanized farming transformed American society."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CDA","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"6. (A) interprets data from primary sources to describe the experiences of immigrants and native-born Americans of the late 19th century."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047CDB","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"7. (A) compares and contrasts the experiences of immigrants in urban versus rural settings."}]}]}]},{"leaf":false,"text":"History (Kansas embedded with United States History Course)","children":[{"leaf":false,"text":"History Standard: The student uses a working knowledge and understanding of significant individuals, groups, ideas, events, eras and developments in the history of Kansas, the United States, and the world, utilizing essential analytical and research skills.","children":[{"leaf":false,"text":"Benchmark 1: The student uses a working knowledge and understanding of individuals, groups, ideas, developments, and turning points in the era of the emergence of the modern United States (1890 - 1930).","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D63","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. (A) analyzes the ways the People's Party Platform of 1892 addressed the social and economic issues facing Kansas and the nation."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D64","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. (A) analyzes the text of William Allen White's essay \"What's the Matter with Kansas\" to understand his opposition to Populism."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D65","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. (A) explains the significance of the Girard newspaper Appeal to Reason to the Socialist movement in the United States."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D66","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. (K) discusses the child labor laws enacted by the Kansas legislature during the Progressive period (e.g., 1905, 1909, 1917)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D67","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"5. (K) understands the role of the Court of Industrial Relations in solving labor disputes in the 1920s."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D68","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"6. (K) explains the influence of Kansas writers and artists on the Harlem Renaissance (e.g., Langston Hughes, Frank Marshall Davis, Aaron Douglas, Coleman Hawkins)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D69","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"7. (K) explains the challenges German Americans faced in Kansas during World War I (e.g., discrimination, movement against German languages)."}]},{"leaf":false,"text":"Benchmark 2: The student uses a working knowledge and understanding of individuals, groups, ideas, developments, and turning points in the era of the Great Depression through World War II in United States history (1930-1945).","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D6A","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. (A) uses primary source materials to explore individual experiences in the Dust Bowl in Kansas (e.g., diaries, oral histories, letters)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D6B","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. (A) researches how the WPA altered the Kansas landscape. (e.g., public art, bridges, parks, swimming pools, libraries)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D6C","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. (A) analyzes Alf Landon's 1936 speech accepting the Republican nomination for President in terms of the debate over the role of government in the United States recovery."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D6D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. (K) understands the role of Kansas aviation companies in World War II."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D6E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"5. (K) understands how conscientious objectors in Kansas participated in alternative service to the country during World War II."}]},{"leaf":false,"text":"Benchmark 3: The student uses a working knowledge and understanding of individuals, groups, ideas, developments, and turning points in the era of the Cold War (1945-1990).","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D6F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. (A) analyzes Brown vs.Board of Education of Topeka as it relates to Kansas segregation laws and why it takes the lead in the Supreme Court case."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D70","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. (K) explains how Kansans have responded to increasing urbanization and industrialization."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D71","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. (A) traces the history of women in political life in Kansas from Susanna Salter to Nancy Landon Kassebaum to understand issues and accomplishments."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D72","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. (A) debates the ways state government has tried to balance the needs of farmers, industries, environmentalists, and consumers in regards to water protection and regulation."}]},{"leaf":false,"text":"Benchmark 4: The student uses a working knowledge and understanding of individuals, groups, ideas, developments, and turning points in contemporary United States history (since 1990).","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D73","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. (A) researches a contemporary issue in Kansas and constructs a well developed argument in support or opposition of position."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D74","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. (A) examines the history of racial and ethnic relations in Kansas and applies this knowledge to current events."}]},{"leaf":false,"text":"Benchmark 5: The student engages in historical thinking skills.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D75","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. (A) analyzes a theme in Kansas history to explain patterns of continuity and change over time."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D76","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. (A) develops historical questions on a specific topic in Kansas history and analyzes the evidence in primary source documents to speculate on the answers."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D77","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. (A) investigates an event in Kansas history using primary and secondary sources and develops a credible interpretation of the event, speculating on its meaning."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D78","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. (A) compares competing historical narratives in Kansas history by contrasting different historians' choice of questions, use of sources, and points of view, in order to demonstrate how these factors contribute to different interpretations."}]}]}]},{"leaf":false,"text":"History (United States History)","children":[{"leaf":false,"text":"History Standard: The student uses a working knowledge and understanding of significant individuals, groups, ideas, events, eras and developments in the history of Kansas, the United States, and the world, utilizing essential analytical and research skills.","children":[{"leaf":false,"text":"Benchmark 1: The student uses a working knowledge and understanding of individuals, groups, ideas, developments, and turning points in the era of the emergence of the modern United States (1890 - 1930).","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D85","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. (A) examines topics in the transformation of American society in the rise of big business, heavy industry, and mechanized farming in the late 19th century (e.g., Social Darwinism, Gospel of Wealth, \"Robber Barons\" or \"Captains of Industry\", Sherman Antitrust Act, muckrakers)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D86","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. (A) explains the rise of the American labor movement (e.g., Samuel Gompers, Haymarket Tragedy, Mother Jones, Industrial Workers of the World, Eugene Debs, strikes)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D87","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. (A) analyzes the key ideas of William Jennings Bryan and other populists (e.g., free coinage of silver, government ownership of railroads, graduated income tax, direct election of senators, election reform)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D88","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. (A) examines the emergence of the United States in international affairs at the turn of the 20th century (e.g., debate over imperialism, Spanish-American War, Philippine Insurrection, Panama Canal, Open Door Policy, Roosevelt Corollary, Dollar Diplomacy)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D89","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"5. (K) explains the spread of Progressive ideas (e.g., political influence on elections, desire to have government regulation of private business and industries, child labor laws, muckrakers, Theodore Roosevelt, Woodrow Wilson)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D8A","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"6. (A) analyzes the reasons for and impact of the United States' entrance into World War I."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D8B","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"7. (A) analyzes how the home front was influenced by United States involvement in World War I (e.g., Food Administration, Espionage Act, Red Scare, influenza, Creel Committee)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D8C","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"8. (K) retraces the progress of the women's suffrage movement from the state to the national arena (e.g., Susan B. Anthony, Elizabeth Cady Stanton, Alice Paul, states granting voting rights in the 19th Amendment)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D8D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"9. (A) analyzes factors that contributed to changes in work, production and the rise of a consumer culture during the 1920's (e.g., leisure time, technology, communication, travel, assembly line, credit buying)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D8E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"10. (A) evaluates various social conflicts in the early 1920's (e.g., rural vs. urban, fundamentalism vs. modernism, prohibition, nativism, flapper vs. traditional woman's role)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D8F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"11. (A) analyzes significant developments in race relations (e.g., rise of Ku Klux Klan, the Great Migration, race riots, NAACP, Tuskegee)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D90","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"12. (A) interprets how the arts, music, and literature reflected social change during the Jazz Age (e.g., Harlem Renaissance, F. Scott Fitzgerald, development of blues and jazz culture)."}]},{"leaf":false,"text":"Benchmark 2: The student uses a working knowledge and understanding of individuals, groups, ideas, developments, and turning points in the era of the Great Depression through World War II in United States history (1930-1945).","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D91","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. (A) analyzes the causes and impact of the Great Depression (e.g., overproduction, consumer debt, banking regulation, unequal distribution of wealth)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D92","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. (A) analyzes the costs and benefits of New Deal programs. (e.g., budget deficits vs. creating employment, expanding government: CCC, WPA, Social Security, TVA, community infrastructure improved, dependence on subsides)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D93","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. (A) analyzes the debate over expansion of federal government programs during the Depression (e.g., Herbert Hoover, Franklin Delano Roosevelt, Alf Landon, Huey Long, Father Charles Coughlin)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D94","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. (A) analyzes the human cost of the Dust Bowl through art and literature (e.g., Dorothea Lange, Woody Guthrie, John Steinbeck)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D95","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"5. (A) analyzes the debate over and reasons for United States entry into World War II (e.g., growth of totalitarianism, America First Committee, neutrality, isolationism, Pearl Harbor)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D96","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"6. (K) discusses how World War II influenced the home front (e.g., women in the work place, rationing, role of the radio in communicating news from the war front, victory gardens, conscientious objectors)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D97","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"7. (K) examines the complexity of race and ethnic relations (e.g., Zoot Suit Riots, Japanese internment camps, American reaction to atrocities of Holocaust and unwillingness to accept Jewish refugees)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D98","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"8. (A) examines the entry of the United States into the nuclear age (e.g., Manhattan Project, Truman's decision to use the atomic bombs, opposition to nuclear weapons)."}]},{"leaf":false,"text":"Benchmark 3: The student uses a working knowledge and understanding of individuals, groups, ideas, developments, and turning points in the era of the Cold War (1945-1990).","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D99","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. (K) explains why the United States emerged as a superpower as the result of World War II."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D9A","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. (A) analyzes the origins of the Cold War (e.g., establishment of the Soviet Bloc, Mao's victory in China, Marshall Plan, Berlin Blockade, Iron Curtain)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D9B","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. (A) evaluates the foreign policies of Truman and Eisenhower during the Cold War (e.g., establishment of the United Nations, containment, NATO, Truman Doctrine, Berlin Blockade, Korean War, Iron Curtain, U-2 incident)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D9C","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. (A) evaluates the foreign policies of Kennedy and Johnson during the Cold War (e.g., Cuban Missile Crisis, Berlin Wall, Vietnam War, Peace Corp)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D9D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"5. (A) analyzes domestic life in the United States during the Cold War era (e.g., McCarthyism, federal aid to education, interstate highway system, space as the New Frontier, Johnson's Great Society)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D9E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"6. (A) analyzes the cause and effect of the counterculture in the United States (e.g., Sputnik, reaction to the Military Industrial Complex, assassinations of Kennedy and King, draft, Vietnam War, Watergate Scandal)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047D9F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"7. (K) examines the struggle for racial and gender equality and for the extension of civil rights (e.g., Brown vs. Board of Education of Topeka, Little Rock Nine, Martin Luther King, Jr., Montgomery Bus Boycott, Voting Rights Act of 1965, Betty Friedan, NOW, ERA, Title IX)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047DA0","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"8. (K) discusses events that contributed to the end of the Cold War (e.g., Détente, Nixon's visit to China, SALT talks, expansion of the military-arms race, relationship between Ronald Reagan and Mikhail Gorbachev)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047DA1","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"9. (A) evaluates the causes and effects of the reform movements of the 1960s and 1970s (e.g., environmentalism – Rachel Carson, EPA; consumer protection – Ralph Nader; changes in the American labor movement – Cesar Chávez)."}]},{"leaf":false,"text":"Benchmark 4: The student uses a working knowledge and understanding of individuals, groups, ideas, developments, and turning points in contemporary United States history (since 1990).","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047DA2","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. (K) examines the relationship of the United States to the rest of the world in the post Cold War era (e.g., domestic and international terrorism, United States as the single superpower, United States involvement in the Middle East conflict, spread and resistance to United States popular culture)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047DA3","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. (A) describes the impact of developments in technology, global communication, and transportation."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047DA4","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. (A) researches major contemporary social issues."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047DA5","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. (A) describes how changes in the national and global economy have influenced the work place."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047DA6","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"5. (A) examines United States immigration policy to understand the affects of legal and illegal immigration (e.g., political, social, economic)."}]},{"leaf":false,"text":"Benchmark 5: The student engages in historical thinking skills.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047DA7","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. (A) analyzes a theme in United States history to explain patterns of continuity and change over time."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047DA8","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. (A) develops historical questions on a specific topic in United States history and analyzes the evidence in primary source documents to speculate on the answers."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047DA9","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. (A) uses primary and secondary sources about an event in U.S. history to develop a credible interpretation of the event, evaluating on its meaning (e.g., uses provided primary and secondary sources to interpret a historical-based conclusion)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047DAA","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. (A) compares competing historical narratives in United States history by contrasting different historians' choice of questions, use of sources, and points of view, in order to demonstrate how these factors contribute to different interpretations."}]}]}]},{"leaf":false,"text":"History (World)","children":[{"leaf":false,"text":"History Standard: The student uses a working knowledge and understanding of significant individuals, groups, ideas, events, eras and developments in the history of Kansas, the United States, and the world, utilizing essential analytical and research skills.","children":[{"leaf":false,"text":"Benchmark 1: The student uses a working knowledge and understanding of individuals, groups, ideas, developments, and turning points of the Global Age of Exploration (1400-1750).","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047DAB","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. (A) analyzes the changes in European thought and culture resulting from the Renaissance (e.g., more secular worldview; Machiavelli, Shakespeare; humanism; innovations in art: Michelangelo, Da Vinci; architecture: St. Peters Dome)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047DAC","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. (A) investigates the changes in European thought and culture resulting from the Reformation (e.g., establishment of Protestant faiths, Counter reformation, Gutenberg Press, Catholic vs. Protestant wars of religion)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047DAD","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. (K) examines the economic and social consequences of European exploration and expansion (e.g., rise of European power, mercantilism, Columbian Exchange, impact on indigenous people in North and South America, trans-Atlantic slave trade)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047DAE","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. (A) compares and contrasts the rise of constitutionalism in Britain with political structures in France. (e.g., changes resulting from the English Civil War and Glorious Revolution: English Bill of Rights, establishment of Parliament, French Absolutism)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047DAF","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"5. (K) explores the growth of Russian Absolutism (e.g., Ivan the Terrible, Peter the Great, Catherine the Great)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047DB0","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"6. (K) explains the significance of the Ottoman, Safavid, and Mogul Empires (e.g., the Fall of Constantinople and the establishment of Ottoman dominance in the Balkans and Southwest Asia; The spread of Shi'ism in Persia, the establishment of Islamic rule in India)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047DB1","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"7. (K) describes why East Asia withdrew into isolationalism during a time of European expansion (e.g., Tokugawa Shogunate, end of Great Ming Naval Expeditions)"}]},{"leaf":false,"text":"Benchmark 2: The student uses a working knowledge and understanding of individuals, groups, ideas, developments, and turning points of the Age of Revolutions (1650-1920).","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047DB2","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. (K) explains essential concepts from the Scientific Revolution (e.g., the Heliocentric Theory; Natural Law; scientific method)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047DB3","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. (K) explains essential concepts from the Enlightenment that represented a turning point in intellectual history (e.g., ideas of Thomas Hobbes, John Locke, Voltaire, Montesquieu, Mary Wollstonecraft, Jean Jacques Rousseau, Enlightened despotism, salons)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047DB4","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. (A) analyzes outcomes of the American and French Revolutions (e.g., the establishment of republican government grounded in Enlightenment thought, the deterioration of the French Republic into the reign of terror; the spread of revolutionary ideas and nationalism with the growth of Napoleonic France)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047DB5","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. (A) explores industrialization and its consequences in Britain (e.g., the rise of laissez-faire economics in Britain, Adam Smith, Chartists, development of the middle class)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047DB6","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"5. (A) compares and contrasts German unification with the Meiji Restoration (e.g., nationalism, militarism, modernization, industrialization)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047DB7","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"6. (K) describes the motives and impact of imperialism (e.g., motives: economic-natural resources and expansion of trade, the competition for colonies in Africa and Asia and the Berlin Conference; humanitarian- missionaries and the ideology of Social Darwinism, political- naval bases and expansion of political control; restriction of human rights in King Leopold's Congo; development of infrastructure; roads, schools, hospitals, railroads; assimilation and loss of indigenous culture)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047DB8","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"7. (A) analyzes the causes and impact of the Russian Revolution (e.g., the idea of communism as an economic alternative to capitalism; Vladimir Lenin, Karl Marx, Communist Manifesto, failure of tsarist regime, economic instability; beginnings of totalitarianism)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047DB9","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"8. (A) examines causes of anti-colonial movements in Latin America, Asia, and Africa (e.g., Haitian Revolution; Bolivar; San Martin; Hidalgo and Morelos; Taiping Rebellion; Boxer Rebellion; Sepoy Rebellion; Zulu Wars)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047DBA","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"9. (K) describes the impact of cross-cultural exchange on artistic developments of the late 19th century (e.g., romanticism; impressionism, impact of Asian culture on western culture)."}]},{"leaf":false,"text":"Benchmark 3: The student uses a working knowledge and understanding of individuals, groups, ideas, developments, and turning points of the Era of World War (1914-1945).","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047DBB","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. (A) analyzes the causes and immediate consequences of WWI (e.g., imperialism rivalries: Triple Entente, Triple Alliance, nationalism, arms race in England, France, and Germany; Treaty of Versailles, reparations, War Guilt Clause)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047DBC","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. (K) describes the emergence of contemporary Middle East (e.g., petroleum society, Zionism, Arab nationalism, Balfour Declaration, dissolution of the Ottoman Empire, Armenian Genocide, Ataturk's modernization of Turkey)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047DBD","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. (A) examines the nature of totalitarianism in fascist Germany and communist Soviet Union (e.g., one party rule; systematic violation of human rights, secret police, state supremacy over individual rights, role of private property, class structure)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047DBE","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. (A) analyzes the causes and immediate consequences of WWII (e.g., German, Italian, and Japanese aggression; failure of the League of Nations; appeasement; development of American, British-Soviet alliance; Holocaust; Nanjing; introduction of nuclear weapons; war crime trials)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047DBF","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"5. (A) analyzes the independence movement in India (e.g., Gandhi, non-violence, Salt March, boycotts, creation of Pakistan)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047DC0","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"6. (K) describes major intellectual, social, and artistic developments (e.g., surrealism, mural art of Mexico, Bauhaus, emergence of film and radio, rise of psychology, antibiotics, cubism)."}]},{"leaf":false,"text":"Benchmark 4: The student uses a working knowledge and understanding of individuals, groups, ideas, developments, and turning points of the World Since 1945.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047DC1","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. (A) analyzes the Cold War as the competition between two competing ideologies or world views and its impact on various regions of the world. (e.g., roots in WWII, Mao's China; the Cold War in Europe; NATO, Warsaw Pact, and the competition for nonaligned nations; collapse of Communism in Europe)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047DC2","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. (A) examines issues of social justice and human rights as expressed in the United Nations Universal Declaration of Human Rights."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047DC3","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. (K) describes the emergence of the Middle East as an influential region in world politics (e.g., creation of the state of Israel, emerging Middle Eastern post WWII nationalism: Suez Crisis, petroleum based interdependence)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047DC4","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. (A) analyzes the impact of international organizations on global interaction (e.g., the United Nations; Organization of American States, NATO, non-governmental organizations such as the International Red Cross, European Union)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047DC5","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"5. (A) examines the trade-offs made by societies between economic growth and environmental protection in a world of limited resources. (e.g., the Green Revolution, population pressure, water, pollution, natural resource degradation)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047DC6","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"6. (K) describes major intellectual, social and artistic developments (e.g., decoding DNA, space technology, consumerism, postmodernism, responses to globalization, feminism, fundamentalism, telecommunications)."}]},{"leaf":false,"text":"Benchmark 5: The student engages in historical thinking skills.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047DC7","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. (A) analyzes a theme in world history to explain patterns of continuity and change over time."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047DC8","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. (A) develops historical questions on a specific topic in world history and analyzes the evidence in primary source documents to speculate on the answers."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047DC9","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. (A) uses primary and secondary sources about an event in world history to develop a credible interpretation of the event, forming conclusions about its meaning (e.g., use provided primary and secondary sources to interpret a historical-based conclusion)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1047DCA","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. (A) compares competing historical narratives in world history by contrasting different historians' choice of questions, use of sources, and points of view, in order to demonstrate how these factors contribute to different interpretations."}]}]}]}]