[{"leaf":false,"text":"Standard 1: Science as Inquiry","children":[{"leaf":false,"text":"Benchmark 1: All students will be involved in activities that develop skills necessary to conduct scientific inquiries.","children":[{"leaf":false,"text":"1. Identify characteristics of objects.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10271C8","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"Example: State characteristics of leaves, shells, water, and air."}]},{"leaf":false,"text":"2. Classify and arrange groups of objects by a variety of characteristics.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10271C9","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"Example: Group seeds by color, texture, size; group objects by whether they float or sink; group rocks by texture, color, and hardness."}]},{"leaf":false,"text":"3. Use appropriate materials and tools to collect information.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10271CA","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"Example: Use magnifiers, balances, scales, thermometers, measuring cups, and spoons when engaged in investigations."}]},{"leaf":false,"text":"4. Ask and answer questions about objects, organisms, and events in their environment.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10271CB","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"Example: Observe and ask questions about a variety of objects and discuss how they are alike and different."}]},{"leaf":false,"text":"5. Describe an observation orally or pictorially.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10271CC","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"Example: Draw pictures of plant growth on a daily basis; note color, number of leaves."}]}]},{"leaf":false,"text":"Benchmark 1: All students will develop the skills necessary to do full inquiry. Full inquiry involves asking a simple question, completing an investigation, answering the question, and sharing the results with others.","children":[{"leaf":false,"text":"1. Ask questions that they can answer by investigating.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10271E4","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"}],"text":"Example: Will the size of the opening on a container change the rate of evaporation of liquids? How much water will a sponge hold?"}]},{"leaf":false,"text":"2. Plan and conduct a simple investigation.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10271E5","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"}],"text":"Example: Design a test of the wet strength of paper towels; experiment with plant growth; experiment to find ways to prevent soil erosion."}]},{"leaf":false,"text":"3. Employ appropriate equipment and tools to gather data.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10271E6","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"}],"text":"Example: Use a balance to find the mass of the wet paper towel; use meter sticks to measure the flight distance of a paper air plane; use the same size containers to compare evaporation rates of different liquids."}]},{"leaf":false,"text":"4. Begin developing the abilities to communicate, critique, analyze their own investigations, and interpret the work of other students.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10271E7","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"}],"text":"Example: Describe investigations with pictures, written language, oral presentations."}]}]},{"leaf":false,"text":"Benchmark 1: The students will demonstrate abilities necessary to do the processes of scientific inquiry.","children":[{"leaf":false,"text":"1. Identify questions that can be answered through scientific investigations.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S102720F","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Example : Explore properties and phenomena of materials, such as a balloon, string, straw, and tape. Students explore properties and phenomena and generate questions to investigate."}]},{"leaf":false,"text":"2. Design and conduct a scientific investigation.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027210","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Example: Students design and conduct an investigation on the question, \"Which paper towel absorbs the most water?\"  Materials include different kinds of paper towels, water, and a measuring cup.  Components of the investigation should include background and hypothesis, identification of independent variable, dependent variable, constants, list of materials, procedures, collection and analysis of data, and conclusions."}]},{"leaf":false,"text":"3. Use appropriate tools, mathematics, technology, and techniques to gather, analyze and interpret data.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027211","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Example: Given an investigative question, students determine what to measure and how to measure.  Students should display their results in a graph or other appropriate graphic format."}]},{"leaf":false,"text":"4. Think critically to identify the relationship between evidence and logical conclusions.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027212","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Example: Students check data to determine: Was the question answered? Was the hypothesis supported/not supported? Did this design work?  How could this experiment be improved? What other questions could be investigated?"}]},{"leaf":false,"text":"5. Apply mathematical reasoning to scientific inquiry.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027213","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Examples: Look for patterns from the mean of multiple trials, such as the rate of dissolving relative to different temperatures. Use observations for inductive and deductive reasoning, such as explaining a person's energy level after a change in eating habits (e.g., use Likert-type scale). State relationships in data, such as variables, which vary directly or inversely."}]},{"leaf":false,"text":"6. Communicate scientific procedures and explanations.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027214","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Example: Present a report of your investigation so that others understand it and can replicate the design."}]}]},{"leaf":false,"text":"Benchmark 2: The students will apply different kinds of investigations to different kinds of questions.","children":[{"leaf":false,"text":"1. Differentiate between a qualitative and a quantitative investigation.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027215","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"<ul><li>Example: While observing a decomposing compost pile, how could you collect quantitative (numerical, measurable) data? How could you collect qualitative (descriptive) data? What is a quantitative question? (e.g., is the temperature constant throughout the compost pile?) What is a qualitative question? (e.g., does the color of the compost pile change over time?)</li></ul><ul><li>Examples: Each student designs a question to investigate. Class analyzes all questions to classify as qualitative or quantitative. After reading a science news article, identify variables and write a qualitative and/or quantitative investigative question related to the topic of the article.</li></ul>"}]},{"leaf":false,"text":"2. Develop questions and adapt the inquiry process to guide an investigation.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027216","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Example: Adapt an existing lab or activity to: write a different question, identify another variable, and/or adapt the procedure to guide a new investigation."}]}]},{"leaf":false,"text":"Benchmark 3: The students will analyze how science advances through new ideas, scientific investigations, skepticism, and examining evidence of varied explanations.","children":[{"leaf":false,"text":"1. After doing an investigation, generate alternative methods of investigation and/or further questions for inquiry.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027217","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Example: Ask \"What would happen if…?\" questions to generate new ideas for investigation."}]},{"leaf":false,"text":"2. Determine evidence which supports or contradicts a scientific breakthrough.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027218","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Example: Examine and analyze a scientific breakthrough [such as a Hubble discovery] using multiple, scientific sources. Explain how a reasonable conclusion is supported."}]},{"leaf":false,"text":"3. Identify faulty reasoning or conclusions that go beyond evidence and/or are not supported by data.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027219","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Example: Analyze evidence and data which support the theory of continental drift."}]}]},{"leaf":false,"text":"Benchmark 1: Students will demonstrate the fundamental abilities necessary to do scientific inquiry.","children":[{"leaf":false,"text":"1. Develop a rich understanding and curiosity of the natural (material) world through experience.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027261","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Example: Students must have a rich set of experiences to draw on in order to ask and evaluate research questions."}]},{"leaf":false,"text":"2. Develop questions and identify concepts that guide scientific investigations.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027262","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Examples: Formulate a testable hypothesis, where appropriate, and demonstrate the logical connections between the scientific concepts guiding a hypothesis and the design of an experiment. Demonstrate a knowledge base, appropriate procedures, and conceptual understanding of scientific investigations."}]},{"leaf":false,"text":"3. Design and conduct scientific investigations.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027263","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Examples: Requires introduction to the major concepts in the area being investigated, proper equipment, safety precautions, assistance with methodological problems, recommendations for use of technologies, clarification of ideas that guide the inquiry, and scientific knowledge obtained from sources other than the actual investigation. May also require student clarification of the question, method (including replication), controls, variables, display of data, revision of methods and replication of explanations, followed by a public presentation of the results with a critical response from peers. Always, students must use evidence, apply logic, and construct an argument for their proposed explanations."}]},{"leaf":false,"text":"4. Use technology and mathematics to improve investigations and communications.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027264","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Examples: A variety of technologies, such as hand tools, measuring instruments, and calculators, should be an integral component of scientific investigations. The use of computers for the collection, organization, analysis, and display of data is also  part of this standard.  Mathematics plays an essential role in all aspects of an inquiry.  Mathematical tools and models guide and improve the posing of questions, gathering data, constructing explanations, and communicating results.  Technology is used to gather and manipulate data.  New techniques and tools provide new evidence to guide inquiry and new methods to gather data, thereby contributing to the advance of science. The accuracy and precision of the data, and therefore the quality of the exploration, depends on the technology used."}]},{"leaf":false,"text":"5. Formulate and revise scientific explanations and models using logic evidence.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027265","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Example: Student inquiries should culminate in formulating an explanation or model. Models can be physical, conceptual, or mathematical. In the process of answering the questions, the students should engage in discussions that result in the revision of their explanations.  Discussions should be based on scientific knowledge, the use of logic, and evidence from their investigations."}]},{"leaf":false,"text":"6. Recognize and analyze alternative explanations and models.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027266","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Example: Emphasize the critical abilities of analyzing an argument by reviewing current scientific understanding, weighing the evidence, and examining the logic so as to decide which explanations and models are best. In other words, although there may be several plausible explanations, students should be able to use scientific criteria to determine the supported explanation(s)."}]},{"leaf":false,"text":"7. Communicate and defend a scientific argument.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027267","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Example: These abilities include writing procedures, expressing concepts, reviewing information, summarizing data, using language appropriately, developing diagrams and charts, explaining statistical analysis, speaking clearly and logically,  onstructing a reasoned argument, and responding appropriately to critical comments."}]}]}]},{"leaf":false,"text":"Standard 2: Physical Science","children":[{"leaf":false,"text":"Benchmark 1: All students will develop skills to describe objects.","children":[{"leaf":false,"text":"1. Observe properties and measure those properties using age appropriate tools and materials.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10271CD","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"Example: Compare size, weight, shape, color, and temperature of objects."}]},{"leaf":false,"text":"2. Describe objects by the materials from which they are made.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10271CE","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"Example: Compare objects made from wood, metal, and cloth."}]},{"leaf":false,"text":"3. Separate or sort a group of objects or materials by properties.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10271CF","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"Example: Compare and sort objects by shape, size, weight, and color."}]},{"leaf":false,"text":"4. Compare solids and liquids.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10271D0","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"Example: Compare the properties of water with the properties of ice."}]},{"leaf":false,"text":"1. Observe properties and measure those properties using appropriate tools.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10271E8","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"}],"text":"Example: Observe and record the size, weight, shape, color, and temperature of objects using balances, thermometers, and other measurement tools."}]},{"leaf":false,"text":"2. Classify objects by the materials from which they are made.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10271E9","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"}],"text":"Example: Group a set of objects by the materials from which they are made."}]},{"leaf":false,"text":"3. Describe and classify objects by more than one property.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10271EA","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"}],"text":"Example: Observe that an object could be hard, round, and rough. Classify objects by two or more properties."}]},{"leaf":false,"text":"4. Observe and record how one object reacts with another object.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10271EB","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"}],"text":"Example: Mix baking soda and vinegar and record observations."}]},{"leaf":false,"text":"5. Recognize and describe the differences between solids, liquids, and gases.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10271EC","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"}],"text":"Example: Observe differences between a stick of butter and the butter melted, a chocolate bar and the chocolate melted, and ice and the ice melted. Observe that a solid has a shape of its own and a liquid takes the shape of its container. Observe differences between an inflated and a deflated balloon."}]}]},{"leaf":false,"text":"Benchmark 2: All students will describe the movement of objects.","children":[{"leaf":false,"text":"1. Move objects by pushing, pulling, throwing, spinning, dropping, and rolling; describe the motion. Observe that a force (a push or a pull), is applied to make objects move.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10271ED","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"}],"text":"Example: Observe differences between a stick of butter and the butter melted, a chocolate bar and the chocolate melted, and ice and the ice melted. Observe that a solid has a shape of its own and a liquid takes the shape of its container. Observe differences between an inflated and a deflated balloon.4"}]},{"leaf":false,"text":"2. Describe locations of objects.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10271EE","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"}],"text":"Example: Describe locations as up, down, in front, or behind."}]}]},{"leaf":false,"text":"Benchmark 3: All students will recognize and demonstrate what makes sounds.","children":[{"leaf":false,"text":"1. Discriminate between sounds made by different objects.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10271EF","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"}],"text":"Example: Listen and compare the sounds made by drums and other musical instruments, such as cans, gourds, plastic spoons, pennies, and plastic disks. Sort a group of objects according to the sounds they make when they are dropped."}]}]},{"leaf":false,"text":"Benchmark 4: All students will experiment with electricity and magnetism.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1014234","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"}],"text":"1. Demonstrate that magnets attract and repel."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1001498","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"}],"text":"2. Design a simple experiment to determine whether various objects will be attracted to magnets."},{"leaf":false,"text":"3. Construct a simple circuit.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10271F0","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"}],"text":"Example: Use a battery, bulb, and wire to light a bulb, make a motor run, produce sound, or make an electromagnet."}]}]},{"leaf":false,"text":"Benchmark 1: The students will observe, compare, and classify properties of matter.","children":[{"leaf":false,"text":"1. Identify and communicate properties of matter, including phases of matter, boiling point, solubility, and density.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S102721A","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Examples: Measure and graph the boiling point temperatures for several different liquids. Graph the cooling curve of a freezing ice cream mixture. Observe substances that dissolve (sugar) and substances that do not dissolve (sand)."}]},{"leaf":false,"text":"2. Using the characteristic properties of each original substance, distinguish components of various types of mixtures.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S102721B","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Examples: Separate alcohol and water using distillation. Separate sand, iron filings, and salt using a magnet and water. Observe properties of kitchen powders (baking soda, salt, sugar, flour). Mix in various combinations, then identify by properties."}]},{"leaf":false,"text":"3. Categorize chemicals to develop an understanding of properties.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S102721C","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Examples: Create operational definitions of metals and nonmetals and classify by observable chemical and physical properties."}]}]},{"leaf":false,"text":"Benchmark 2: The students will observe, measure, infer, and classify changes in properties of matter.","children":[{"leaf":false,"text":"1. Measure and graph the effects of temperature on matter.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S102721D","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Examples: Change water from solid to liquid to gas using heat. Measure and graph temperature changes. Observe changes in volume occupied."}]},{"leaf":false,"text":"2. Understand that total mass is conserved in chemical reactions.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S102721E","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Example: Measure the mass of an Alka Seltzer tablet, water, and a container with a lid. Then drop in tablet, close tightly, and measure the mass after the reaction."}]},{"leaf":false,"text":"3. Understand the relationship of elements to compounds.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S102721F","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Example: Draw a diagram to show how different compounds are composed of elements in various combinations."}]}]},{"leaf":false,"text":"Benchmark 3: The students will investigate motion and forces.","children":[{"leaf":false,"text":"1. Describe motion of an object (position, direction of motion, speed, potential, and kinetic energy).","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027220","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Examples: Follow the path of a toy car down a ramp. The ramp is first covered with tile and then with sandpaper.  Trace the force, direction, and speed of a baseball, from leaving the pitcher's hand and returning back to the pitcher through one of many possible paths."}]},{"leaf":false,"text":"2. Measure motion and represent data in a graph.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027221","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Example: Roll a marble down a ramp. Make adjustments to the board or to the marble's position in order to hit a target located on the floor.  Measure and graph the results."}]},{"leaf":false,"text":"3. Demonstrate an understanding that an object not being subjected to a force will continue to move at a constant speed in a straight line (Law of Inertia).","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027222","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Example: Place a small object on a rolling toy vehicle; stop the vehicle abruptly; observe the motion of the small object.  Relate to personal experience - stopping rapidly in a car."}]},{"leaf":false,"text":"4. Demonstrate and mathematically communicate that unbalanced forces will cause changes in the speed or direction of an object's motion.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027223","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Example: With a ping pong ball and 2 straws, investigate the effects of the force of air through two straws on the ping-pong ball with the straws at the same side of ball, on opposite sides, and at other angles. Illustrate results with vectors (force arrows)."}]},{"leaf":false,"text":"5. Understand that a force (e.g., gravity and friction) is a push or pull.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027224","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Example: Explore the variables of (wheel and ramp) surfaces that would allow a powered car to overcome the forces of gravity and friction to climb an inclined plane."}]},{"leaf":false,"text":"6. Investigate force variables of simple machines.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027225","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Example: Investigate the load (force) that can be moved as the number of pulleys in a system is increased."}]}]},{"leaf":false,"text":"Benchmark 4: The students will understand and demonstrate the transfer of energy.","children":[{"leaf":false,"text":"1. Understand that energy can be transferred from one form to another, including mechanical, heat, light, electrical, chemical, and nuclear energy.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027226","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Examples: Design an energy transfer device. Use various forms of energy. The device should accomplish a simple task such as popping a balloon. Explore sound waves using a spring."}]},{"leaf":false,"text":"2. Sequence the transmission of energy through various real-life systems.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027227","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Example: Draw a chart of energy flow through a telephone from the caller's voice to the listener's ear."}]},{"leaf":false,"text":"3. Observe and communicate how light interacts with matter: transmitted, reflected, refracted, absorbed.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027228","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Example: Classify classroom objects as to how they interact with light: a window transmits; black paper absorbs; a projector lens refracts; a mirror reflects."}]},{"leaf":false,"text":"4. Understand that heat energy can be transferred from hot to cold by radiation, convection, and conduction.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027229","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Example: Add colored warm water to cool water. Observe convection. Measure and graph temperature over time."}]}]}]},{"leaf":false,"text":"Standard 3: Life Science","children":[{"leaf":false,"text":"Benchmark 1: All students will develop an understanding of the characteristics of living things.","children":[{"leaf":false,"text":"1. Discuss that living things need air, water, and food.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10271D1","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"Example: What children need...what plants need...what animals need."}]},{"leaf":false,"text":"2. Observe life cycles of different living things.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10271D2","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"Example: Observe butterflies, mealworms, plants, and humans."}]},{"leaf":false,"text":"3. Observe living things in various environments.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10271D3","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"Example: Observe classroom plants; take nature walks and field trips in their own area; observe terrariums and aquariums."}]},{"leaf":false,"text":"4. Examine the structures of living things.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10271D4","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"Example: Butterflies have wings. Plants have leaves and roots. People have skin and hair."}]}]},{"leaf":false,"text":"Benchmark 1: All students will develop a knowledge of organisms in their environment.","children":[{"leaf":false,"text":"1. Compare and contrast structural characteristics and functions of different organisms.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10271F1","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"}],"text":"Example: Compare the structures for movement of a meal worm to the structures for movement of a guppy. Compare the leaf structures of a sprouted bean seed to the leaf structures of a corn seed."}]},{"leaf":false,"text":"2. Compare basic needs of different organisms in their environment.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10271F2","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"}],"text":"Example: Compare the basic needs of an animal to the basic needs of a plant."}]},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1014F44","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"}],"text":"3. Discuss ways humans and other organisms use their senses in their environments."}]},{"leaf":false,"text":"Benchmark 2: All students will observe and illustrate the life cycles of various organisms.","children":[{"leaf":false,"text":"1. Compare, contrast, and ask questions about life cycles of various organisms.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10271F3","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"}],"text":"Example: Plant a seed; observe and record its growth. Observe and record the changes of an insect as it develops from birth to adult."}]}]},{"leaf":false,"text":"Benchmark 1: The students will model structures of organisms and relate functions to the structures.","children":[{"leaf":false,"text":"1. Relate the structure of cells, organs, tissues, organ systems, and whole organisms to their functions.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S102722A","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Examples: Identify human body organs and characteristics. Then relate their characteristics to function. Map human body systems, research their functions and show how each supports the health of the human body. Relate an organism's structure to how it works."}]},{"leaf":false,"text":"2. Compare organisms composed of single cells with organisms that are multi-cellular.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S102722B","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Example: Create and compare two models: the major parts and their functions of a single-cell organism and the major parts and their functions of a multicellular organism, e.g. amoeba and hydra."}]},{"leaf":false,"text":"3. Conclude that breakdowns in structure or function of an organism may be caused by disease, damage, heredity or aging.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S102722C","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Example: Compare lung capacity of smokers with that of non-smokers and graph the results."}]}]},{"leaf":false,"text":"Benchmark 2: The students will understand the role of reproduction and heredity for all living things.","children":[{"leaf":false,"text":"1. Conclude that reproduction is essential to the continuation of a species.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S102722D","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Examples: Observe and communicate the life cycle of an organism (seed to seed; larva to larva; or adult to adult). Culture more than one generation (life cycle) of an invertebrate organism. Discuss implications of one generation of the species not reproducing."}]},{"leaf":false,"text":"2. Differentiate between asexual and sexual reproduction in plants and animals.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S102722E","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Examples: Compare the regeneration of a planarian to the reproduction of an earthworm.<br />Compare the propagation of new plants from cuttings, (which skips a portion of the life cycle) with the process of producing a new plant from fertilization to an ovum."}]},{"leaf":false,"text":"3. Infer that the characteristics of an organism result from heredity and interactions with the environment.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S102722F","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Example: Choose an organism. Research its characteristics. Infer if these characteristics result from heredity, environment, or both."}]},{"leaf":false,"text":"4. Understand that hereditary information contained in the genes (parts of the chromosomes) of each cell is passed from one generation to the next.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027230","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Examples: In a cooperative setting, have students trace parent characteristics with those of an offspring.<br />Use coin tossing to predict the probability of traits being passed on. Remember that not all traits are single gene traits."}]}]},{"leaf":false,"text":"Benchmark 3: The students will describe the effects of a changing external environment on the regulation/balance of internal conditions and processes of organisms.","children":[{"leaf":false,"text":"1. Understand the effects of a change in environmental conditions on behavior of an organism by carrying out a full investigation.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027231","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Examples: Select a variable to alter the environment (e.g., temperature, light, moisture, gravity) and observe the effects on an organism (e.g., pillbug or earthworm). Students could also think of their own behaviors and determine environmental conditions that affect behavior."}]},{"leaf":false,"text":"2. Identify behaviors of an organism that are responses made to internal or environmental stimuli.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027232","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Example: Observe the response of the body when competing in a running event. In order to maintain body temperature, various systems begin cooling through such processes as sweating and cooling the blood at the surface of the skin."}]},{"leaf":false,"text":"3. Explain that all organisms must be able to maintain and regulate stable internal conditions to survive in a constantly changing external environment.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027233","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Example: Investigate the effects of various stimuli on plants and how they adapt their growth: phototropism, geotropism, and thermotropism are examples."}]}]},{"leaf":false,"text":"Benchmark 4: The students will identify and relate interactions of populations of organisms within an ecosystem.","children":[{"leaf":false,"text":"1. Recognize that all populations living together and the physical factors with which they interact compose an ecosystem.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027234","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Examples: Create a classroom terrarium and identify the interactions between the populations and physical conditions needed for survival. Participate in a field study examining the living and non-living parts of a community."}]},{"leaf":false,"text":"2. Classify organisms in a system by the function they serve (producers, consumers, decomposers).","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027235","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Example: Explore populations at a pond, field, forest floor, and/or rotting log. Have students identify the various food webs and observe that organisms in a system are classified by their function."}]},{"leaf":false,"text":"3. Trace the energy flow from the sun (source) to producers (chemical energy) to other organisms in food webs.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027236","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Example: Role-play the interactions and energy flow of organisms in a food web.  Pass a ball of string among a circle of students who represent parts of a food web (green plants, the sun, insects, etc.). The string connecting students represents the relationships among food web components, resulting in a web-like model."}]},{"leaf":false,"text":"4. Relate the limiting factors of biotic and abiotic resources with a species' population growth, decline, and survival.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027237","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Examples: Change variables such as a wheat crop yield, mice, or a predator, and chart the possible outcomes. For example, how would a low population of mice affect the population of the predator over time? Participate in a simulation such as \"Oh Deer\" from Project Wild."}]}]},{"leaf":false,"text":"Benchmark 5: The students will observe the diversity of living things and relate their adaptations to their survival or extinction.","children":[{"leaf":false,"text":"1. Conclude that millions of species of animals, plants, and microorganisms may look dissimilar on the outside but have similarities in internal structures, developmental characteristices, and chemical processes.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027238","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Examples: Research numerous organisms and create a classification system based on observations of similarities and differences. Compare this system with a dichotomous key used by scientists. Explore various ways animals take in oxygen and give off carbon dioxide."}]},{"leaf":false,"text":"2. Understand that adaptations of organisms -- changes in structure, function, or behavior -- contribute to biological diversity.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027239","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Example: Compare characteristics of birds such as beaks, wings, and feet, with how a bird behaves in its environment. Then students work in cooperative groups to design different parts of an imaginary bird.  Relate characteristics and behaviors of that bird with its structures."}]},{"leaf":false,"text":"3. Associate extinction of a species with environmental changes and insufficient adaptive characteristics.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S102723A","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Example: Students use various objects to model bird beaks, such as spoons, toothpicks, clothespins. Students use \"beaks\" to \"eat\" several types of food, such as cereal, raisins, noodles. When \"food\" sources change, those species that have not adapted die."}]}]},{"leaf":false,"text":"Benchmark 1: Students will demonstrate an understanding of the structure and function of the cell.","children":[{"leaf":false,"text":"1. Cells are composed of a variety of specialized structures that carry out specific functions.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027277","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Example: Every cell is surrounded by a membrane that separates it from the outside environment and controls the flow of materials into and out of the cell. Proteins embedded in the membrane help to carry out specific life processes. In eukaryotes, similar membranes and their associated proteins help to compartmentalize and isolate the various chemical environments of the cell into organelles. Organelles are specialized to carry out specific life functions for the cell such as protein synthesis, protein processing and packaging, energy transformation, communication, etc."}]},{"leaf":false,"text":"2. Most cell functions involve specific chemical reactions.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027278","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Example: Food molecules taken into cells provide the chemicals needed to synthesize other molecules. Enzymes catalyze both breakdown and synthesis in the cell. In eukaryotes these reactions take place in membrane-bound organelles."}]},{"leaf":false,"text":"3. Cells function and replicate as a result of information stored in DNA and RNA molecules.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027279","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Example: Proteins and gene expression regulate cell functions. This regulation allows cells to respond to their environment and to control and coordinate cell division."}]},{"leaf":false,"text":"4. Some plant cells contain chloroplasts, which are the sites of photosynthesis.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S102727A","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Example: The process of photosynthesis provides a vital connection between the sun and the energy needs of living systems. The cell is the basic unit of function for living things."}]},{"leaf":false,"text":"5. Cells can differentiate, thereby enabling complex multicellular organisms to form.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S102727B","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Example: In the development of most multicellular organisms, a fertilized cell forms an embryo that differentiates into an adult. Differentiation is regulated through expression of different genes and leads to the formation of specialized cells, tissues, and organs."}]}]},{"leaf":false,"text":"Benchmark 2: Students will demonstrate an understanding of chromosomes, genes, and the molecular basis of heredity.","children":[{"leaf":false,"text":"1. Heredity information is contained in genes, located in the chromosomes of each cell. Each gene carries a single unit of information. An inherited trait of an individual can be determined by one or by many genes, and a single gene can influence more than one trait.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S102727C","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Examples: Alleles, which are different forms of a gene, may be dominant, recessive, co-dominant, etc.<br />The expression of traits is determined by a complex interaction of genes, developmental history, and the environment."}]},{"leaf":false,"text":"2. Experiments have shown that all known living organisms contain DNA or RNA as their genetic material.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S102727D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Examples: Frederick Griffith & Avery's work with bacteria demonstrated that DNA changed properties of cells.<br />Beadle & Tatum's work provided a mechanism for gene action and a link to modern molecular genetics.<br />Hershey and Chase's work demonstrated that viral DNA contained the genetic code for new virus production in bacterial cells."}]},{"leaf":false,"text":"3. DNA (or RNA) provides the instructions that specify the characteristics of organisms.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S102727E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Examples: Nucleotides (adenine, thymine, guanine, cytosine and uracil) make up DNA and RNA molecules.<br />Sequences of nucleotides that either determine or contribute to a genetic trait are called genes.<br />DNA is replicated by using a template process that usually results in identical copies.<br />DNA is packaged in chromosomes during cell replication."}]},{"leaf":false,"text":"4. Organisms usually have a characteristic number of chromosomes; one pair of these may determine the sex of individuals.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S102727F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Example: Most cells in humans contain 23 pairs of chromosomes; the 23rd pair contains the XX for female or XY for male."}]},{"leaf":false,"text":"5. Gametes carry the genetic information to the next generation.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027280","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Gametes contain only one representative from each chromosome pair. Gametes unite to form a new individual in most organisms. Many possible combinations of genes explain features of heredity such as how traits can be hidden for several generations."}]},{"leaf":false,"text":"6. Mutations occur in DNA at very low rates.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027281","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Examples: Some changes make no difference to the organism or to future generations. Phenotypic changes can be harmful; some mutations enable organisms to survive changes in their environment.<br />Only mutations in the germ cells are passed on to offspring and therefore can bring about beneficial or harmful changes in future generations."}]}]},{"leaf":false,"text":"Benchmark 3: Students will understand the major concepts of the theory of biological evolution.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1008E07","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. That the theory of evolution is both the history of descent, with modification of different lineages of organisms from common ancestors, and the ongoing adaptation of organisms to environmental challenges and changes (modified from Futuyma, et al., 1999)."},{"leaf":false,"text":"2. That biologists use evolution theory to explain the earth's present-day biodiversity — the number, variety and variability of organisms.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027282","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Example: Patterns of diversification and extinction of organisms are documented in the fossil record. The fossil record provides evidence of simple, bacteria-like life as far back as 3.8+ billion years ago.<br />Natural selection, and other processes, can cause populations to change from one generation to the next.<br />A single population can separate into two or more independent populations. Over time, these populations can also become very different from each other. If the isolation continues, the genetic separation may become irreversible. This process is called speciation. Populations, and entire lineages, can go extinct. One effect of extinction is to increase the apparent differences between populations. As intermediate populations go extinct, the surviving lineages can become more distinct from one another."}]},{"leaf":false,"text":"3. That biologists recognize that the primary mechanisms of evolution are natural selection and genetic drift.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027283","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Example: Natural selection includes the following concepts: 1) heritable variation exists in every species; 2) some heritable traits are more advantageous to reproduction and/or survival than are others; 3) there is a finite supply of resources required for life; not all progeny survive; 4) individuals with advantageous traits generally survive to reproduce; 5) the advantageous heritable traits increase in the population through time."}]},{"leaf":false,"text":"4. The sources and value of variation.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027284","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Examples: Variation of organisms within and among species increases the likelihood that some members will survive under changed environmental conditions.<br />New heritable traits primarily result from new combinations of genes and secondarily from mutations or changes in the reproductive cells; changes in other cells of a sexual organism are not passed to the next generation."}]},{"leaf":false,"text":"5. That evolution is a broad, unifying theoretical framework in biology.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027285","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Examples: Evolution provides the context in which to ask research questions and yields valuable insights, especially in agriculture and medicine.<br />The common ancestry of living things allows them to be classified into a hierarchy of groups; these classifications or family trees follow rules of nomenclature; scientific names have unique definitions and value.<br />Natural selection and its evolutionary consequences provide a scientific explanation for the fossil record that correlates with geochemical (e.g., radioisotope) dating results. The distribution of fossil and modern organisms is related to geological and ecological changes (i.e. plate tectonics, migration)."}]}]},{"leaf":false,"text":"Benchmark 4: Students will understand the interdependence of organisms and their interaction with the physical environment.","children":[{"leaf":false,"text":"1. Atoms and molecules on the earth cycle among the living and nonliving components of the biosphere.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027286","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Example: The chemical elements, essential elements of life, circulate in the biosphere in characteristic paths known as biogeochemical cycles (e.g., nitrogen, carbon, phosphorus, etc)."}]},{"leaf":false,"text":"2. Energy flows through ecosystems.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027287","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Examples: Organisms, ecosystems, and the biosphere possess thermodynamic characteristics that exhibit a high state of internal order. Radiant energy that enters the earth's surface is balanced by the energy that leaves the earth's surface.<br />Transfer of energy through a series of organisms in an ecosystem is called the food chain; at each transfer as much as 90% of the potential energy is lost as heat."}]},{"leaf":false,"text":"3. Organisms cooperate and compete in ecosystems.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027288","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Example: The interrelationships and interdependence of organisms may generate stable ecosystems."}]},{"leaf":false,"text":"4. Living organisms have the capacity to produce populations of infinite size, but environments and resources are finite. This fundamental tension has profound effects on the interactions among organisms.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027289","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Example: The presence and success of an organism, or a group of organisms, depends upon a large number of environmental factors."}]},{"leaf":false,"text":"5. Human beings live within and impact ecosystems.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S102728A","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Example: Humans modify ecosystems as a result of population growth, technology, and consumption. Human modifications of habitats through direct harvesting, pollution, atmospheric changes, and other factors affect ecosystem stability."}]}]},{"leaf":false,"text":"Benchmark 5: Students will develop an understanding of matter, energy, and organization in living systems.","children":[{"leaf":false,"text":"1. Living systems require a continuous input of energy to maintain their chemical and physical organization.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S102728B","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Example: All matter tends toward more disorganized states.  With death and the cessation of energy intake, living systems rapidly disintegrate."}]},{"leaf":false,"text":"2. The sun is the primary source of energy for life through the process of photosynthesis.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S102728C","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Example: Plants capture energy by absorbing light and using it to form simple sugars. The energy in these sugar molecules can be used to assemble larger molecules with biological activity, including proteins, DNA, carbohydrates, and fats. These molecules serve as sources of energy for life processes."}]},{"leaf":false,"text":"3. Food molecules contain energy. This energy is made available by cellular respiration.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S102728D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Examples: Energy is released when the bonds of food molecules are broken and new compounds with lower energy bonds are formed. Cells usually use this energy to regenerate ATP, the molecule involved in cell metabolism."}]},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100FC4D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. The structure and function of an organism serve to acquire, transform, transport, release, and eliminate the matter and energy used to sustain the organism."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101BEFD","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"5. The distribution and abundance of organisms and populations in ecosystems are limited by the availability of matter and energy, and the ability of the ecosystem to recycle materials."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100E7E4","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"6. As matter and energy flow through different levels of organization of living systems -- cells, organs, organisms, communities --  and between living systems and the physical environment, chemical elements are recombined in different ways. Each recombination results in the storage of some energy and a dissipation of some energy into the environment as heat. Matter is recycled, energy is not."}]},{"leaf":false,"text":"Benchmark 6: Students will understand the behavior of animals.","children":[{"leaf":false,"text":"1. Animals have behavioral responses to internal changes and to external stimuli.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S102728E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Examples: Responses to external stimuli can result from interactions with the organism's own species and others, as well as environmental changes.<br />These responses can be innate and/or learned.<br />Animals often live in unpredictable environments, and so their behavior must be flexible enough to deal with uncertainty and change."}]},{"leaf":false,"text":"2. Most multicellular animals have nervous systems that underlie behavior.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S102728F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Example: Nervous systems are formed from specialized cells that conduct signals rapidly through the long cell extensions that make up nerves. The nerve cells communicate with each other by secreting specific excitatory and inhibitory molecules. In sense organs, specialized cells detect light, sound, and specific chemicals and enable animals to monitor what is going on in the world around them."}]},{"leaf":false,"text":"3. Like other aspects of an organism's biology, behaviors have evolved through natural selection.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027290","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Example: Behaviors are often adaptive when viewed in terms of survival and reproductive success. Behavioral biology has implications for humans, as it provides links to psychology, sociology, and anthropology."}]}]},{"leaf":false,"text":"Benchmark 7: Students will demonstrate an understanding of structure, function, and diversity of organisms.","children":[{"leaf":false,"text":"1. The basic biology, diversity, ecology, and medical effects of microbiological agents, including prions, viruses, bacteria, and protists.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027291","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Examples: Viruses are particles that cause infections. They are composed of genomes encased in a protein shell. They can only reproduce in a host organism. Because of these properties vaccines are effective for viral infection but antibiotics are not. Bacteria are a very diverse group of organisms that account for much of this planet's biomass and cycling of materials. They are prokaryotes. Medically, several infectious diseases (e.g. strep throat, staph infections, cholera, syphilis, food poisoning, etc.) are caused by bacteria. Protists are unicellular eukaryotes whose ancestors gave rise to other major kingdoms. Some are disease agents (e.g. malaria, amoebic dysentery) and may require an animal vector. Understanding of these basic groups underlies effective sanitation and hygiene."}]},{"leaf":false,"text":"2. The basic biology, diversity, ecology, and medical effects of fungi.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027292","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Example: Fungi are vital decomposers and have special symbiotic relationships with plants. Fungi are also important commercially and as the original source of antibiotics. Fungi can also cause disease (e.g. ringworm, athlete's foot, etc.)."}]},{"leaf":false,"text":"3. The basic biology, diversity, ecology, and human relationships of plants.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027293","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Examples: Plant structures vary, and this variation is important in understanding the function of plants in farming, pharmaceutical products, etc.<br />Photosynthesis is the basis for nearly all food chains and our food production.<br />Understanding the biology of plants underlies a scientific understanding of ecology."}]},{"leaf":false,"text":"4. The basic biology, diversity, anatomy, ecology and medical effects of major animal groups.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027294","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Example: Animals vary; this variation is important in understanding the function of animals in farming, medical research, etc.<br />Understanding the biology of animals underlies a scientific understanding of ecology."}]},{"leaf":false,"text":"5. That humans can be thought of as complex, soft machines that require many systems to operate properly.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027295","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Examples: Organ systems have specific structures and functions; they interact with each other.<br />Infections, developmental problems, trauma, and aging result in specific diseases and disorders."}]},{"leaf":false,"text":"6. The structures and processes of development and reproduction.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027296","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Examples: Reproduction is essential to all ongoing life and is accomplished with wide variation in life cycles and anatomy.<br />Understanding of basic mechanisms of reproduction and development, as well as changes of aging, is critical to leading a healthy life, parenting, and making societal decisions.<br />Environmental factors (e.g. radiation, chemicals) can cause inherited gene mutations that directly alter development or cellular repair mechanisms, leading to the development of various cancers. Changes to non-reproductive cell lines are not passed to the next generation."}]}]}]},{"leaf":false,"text":"Standard 4: Earth and Space Science","children":[{"leaf":false,"text":"Benchmark 1: All students will describe properties of earth materials.","children":[{"leaf":false,"text":"1. Observe, compare and sort earth materials.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10271D5","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"Example: Describe and compare soils by color and texture; sort pebbles and rocks by size, shape, and color."}]},{"leaf":false,"text":"2. Describe where earth materials are found.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10271D6","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"Example: Observe earth materials around the playground, on a field trip, or in their own yard."}]}]},{"leaf":false,"text":"Benchmark 2: All students will observe and compare objects in the sky.","children":[{"leaf":false,"text":"1. Distinguish between human-made and natural objects in the sky.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10271D7","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"Example: Compare birds to airplanes."}]},{"leaf":false,"text":"2. Recognize sun, moon, and stars.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10271D8","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"Example: Observe day and night sky regularly."}]},{"leaf":false,"text":"3. Describe that the sun provides light and warmth.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10271D9","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"Example: Feel heat from the sun on the face and skin. Observe shadows."}]},{"leaf":false,"text":"1. Observe the moon and stars.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10271F9","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"}],"text":"Example: Sketch the position of the moon in relation to a tree, rooftop, or building."}]},{"leaf":false,"text":"2. Observe and compare the length of shadows.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10271FA","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"}],"text":"Examples: Students can observe the movement of an object's shadow during the course of a day; construct simple sundials."}]},{"leaf":false,"text":"3. Discuss that the sun provides light and heat to maintain the temperature of the earth.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10271FB","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"}],"text":"Example: Discuss why it seems cooler when the sun goes behind a cloud."}]}]},{"leaf":false,"text":"Benchmark 3: All students will describe changes in weather.","children":[{"leaf":false,"text":"1. Observe changes in the weather from day to day.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10271DA","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"Example: Draw pictures."}]},{"leaf":false,"text":"2. Record weather changes daily.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10271DB","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"Example: Use weather charts, calendars, and logs to record daily weather."}]},{"leaf":false,"text":"3. Discuss weather safety procedures.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10271DC","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"Examples: Practice tornado drill procedures; talk about the dangers of lightning and flooding."}]}]},{"leaf":false,"text":"Benchmark 1: All students will develop an understanding of the properties of earth materials.","children":[{"leaf":false,"text":"1. Observe and classify a variety of earth materials in their environment.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10271F4","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"}],"text":"Examples: Observe and classify rocks, soil, sand, and water."}]},{"leaf":false,"text":"2. Collect, observe, and become aware of properties of various earth materials.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10271F5","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"}],"text":"Example: Students could bring in samples of earth materials from their surroundings to observe color, texture, and other physical properties."}]},{"leaf":false,"text":"3. Experiment with a variety of soils.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10271F6","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"}],"text":"Example: Plant seeds in a variety of soils to compare and collect data on the effect of different soils on plant growth. Experiment with soil samples and how they react to water, wind, compaction, etc."}]},{"leaf":false,"text":"4. Describe properties of many different kinds of rocks.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10271F7","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"}],"text":"Example: Bring rocks from the playground, immerse in water, and observe color, texture, and reaction to liquids."}]},{"leaf":false,"text":"5. Observe fossils and discuss how fossils provide evidence of plants and animals that lived long ago. A fossil is part of a once-living organism or a trace of an organism preserved in rock.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10271F8","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"}],"text":"Example: Observe a variety of fossils."}]}]},{"leaf":false,"text":"Benchmark 3: All students will develop skills necessary to  describe changes in the earth and weather.","children":[{"leaf":false,"text":"1. Describe changes in the surface of the earth.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10271FC","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"}],"text":"Example: Students will observe erosion and changes in plant growth at a study site."}]},{"leaf":false,"text":"2. Observe, describe, and record daily and seasonal weather changes.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10271FD","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"}],"text":"Example: Record weather observations."}]}]},{"leaf":false,"text":"Benchmark 1: The students will understand that the structure of the earth system is constantly changing due to the earth's physical and chemical processes.","children":[{"leaf":false,"text":"1. Predict patterns from data collected.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S102723B","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Example: Map the movement of weather systems and predict the local weather conditions."}]},{"leaf":false,"text":"2. Identify properties of the solid earth, the oceans and fresh water, and the atmosphere.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S102723C","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Examples: Create a concept map of earth materials using links to show connections, such as water causing erosion of solid, wind evaporating water, etc. Compare the densities of salt and fresh water. Classify rocks, minerals, and soil by properties. Compare heating and cooling over land and water."}]},{"leaf":false,"text":"3. Model earth's cycles.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S102723D","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Examples: Create rock cycle and water cycle dioramas. Illustrate global ocean and wind currents. Flow-chart a carbon atom through the carbon cycle."}]},{"leaf":false,"text":"4. Model earth's plate movements that result in major geologic events and landform development.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S102723E","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Example: Plot the location of the earth's plate boundaries and compare with recent volcano and earthquake activity in the Ring of Fire. Refer to US Geologic Survey data available on the Internet."}]},{"leaf":false,"text":"5. Understand water's major role in changing the solid surface of the earth, such as the effect of oceans on climates and water as an erosion force.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S102723F","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Examples: Map major climate zones and relate to ocean currents. Model top soil erosion. Measure sediment load in a nearby stream."}]}]},{"leaf":false,"text":"Benchmark 2: The students will understand that past and present earth processes are similar.","children":[{"leaf":false,"text":"1. Understand the dynamics of earth's constructive and destructive forces over time.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027240","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Examples: Construct models of rock types using food. Peanut brittle without the peanuts can illustrate a molten material crystallizing to form a solid substance similar to an igneous rock.<br />Use an acid (vinegar or dilute HCl) to show the chemical similarity of limestone rock and fossilized shells.<br />Students take a piece of sandstone and apply destructive forces to change it into sand. Observe the effects of weathering on various rock types."}]},{"leaf":false,"text":"2. Model geologic time to scale.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027241","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Example: \"Toilet Paper Earth History:\": Plot the major events (last ice age, beginning of Paleozoic Era, etc.) of earth history on a roll of toilet paper. Each sheet of toilet paper = 100 million years."}]},{"leaf":false,"text":"3. Relate geologic evidence to a record of earth's history.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027242","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Examples: Locate the same rock layer in two local road cuts; give fossil evidence and other kinds of evidence that the layer is the same in both exposures. Compare the types of organisms shown in the fossils found in a Kansas shale (mudstone) and a Kansas limestone and infer the ocean depositional environment from which the rock layer was formed."}]},{"leaf":false,"text":"4. Compare the current arrangement of the continents with the arrangement of continents throughout the earth's history.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027243","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Examples: Cut out continents from a world map and slide them together to see how they fit. Plot each continental plate's latitude and longitude through earth's history."}]}]},{"leaf":false,"text":"Benchmark 3: The students will identify and classify planets and other solar system components.","children":[{"leaf":false,"text":"1. Compare and contrast the characteristics of the planets.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027244","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Example: Search reliable Internet sources for current information. Create a graphic organizer to visualize comparisons of planets."}]},{"leaf":false,"text":"2. Develop understanding of spatial relationships via models of the earth/moon/planets/sun system to scale.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027245","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Examples: Model the solar system to scale in a long hallway or school yard using rocks for rocky planets and balloons for gaseous planets. Designate a large object as the sun. Model the earth/moon/sun system to scale with the question: If the earth were the size of a tennis ball, how big would the moon be? How big would the sun be? How far apart would they be?"}]},{"leaf":false,"text":"3. Research smaller components of the solar system such as asteroids and comets.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027246","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Example: Identify and classify characteristics of asteroids and comets."}]},{"leaf":false,"text":"4. Identify the sun as a star and compare its characteristics to those of other stars.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027247","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Examples: Classify bright stars visible from earth by color, temperature, age apparent brightness, and distance from earth. Sequence the life cycle of a star."}]},{"leaf":false,"text":"5. Trace cultural as well as scientific influences on the study of astronomy.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027248","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Example: Research ancient observations and explanations of the heavens and compare with today's knowledge."}]}]},{"leaf":false,"text":"Benchmark 4: The students will model motions and identify forces that explain earth phenomena.","children":[{"leaf":false,"text":"1. Demonstrate object/space/time relationships that explain phenomena such as the day, the month, the year, and the seasons.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027249","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Example: Use an earth/moon/sun model to demonstrate a day, a month, a year, and the seasons."}]},{"leaf":false,"text":"2. Model earth/moon positions that create phases of the moon and eclipses.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S102724A","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Example: Use students to demonstrate the relative positions of the sun, earth and moon to create eclipses, phases of the moon, and tides using a circle of students representing the fluid water."}]},{"leaf":false,"text":"3. Apply principles of force and motion to understand the solar system.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S102724B","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Examples: Use string and ball model to illustrate gravity and movement creating an orbit around a hand."}]},{"leaf":false,"text":"4. Understand the effect of the angle of incidence of solar energy striking the earth's surface on the amount of heat energy absorbed at the earth's surface.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S102724C","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Examples: Place a piece of graph paper on the surface of a globe at the equator. Hold a flashlight 10 cm. from the paper parallel to the globe. Mark the lighted area of the paper. Then, place the graph paper at a high latitude. Again hold the flashlight parallel to the paper 10 cm from the paper. Compare the areas lit at the equator and at the high latitude, with the same amount of light energy. Where does each lighted square of paper receive the most energy?"}]}]},{"leaf":false,"text":"Benchmark 1: Students will develop an understanding of the sources of energy that power the dynamic earth system.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1016A22","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. Essentially all energy on earth originates with the sun, is generated by radioactive decay in the earth's interior, or is left over from the earth's formation."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1024DEB","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. Convection circulation in the mantle is driven by the outward transfer of the earth's internal heat."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1003F4D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. Movable continental and oceanic plates make up the earth's surface; the hot, convecting mantle is the energy source for plate movement."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1014214","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. Energy from the sun heats the oceans and the atmosphere, and affects oceanic and atmospheric circulation."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1014BDB","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"5. Energy flow determines global climate and, in turn, is influenced by geographic features, cloud cover, and the earth's rotation."}]},{"leaf":false,"text":"Benchmark 2: Students will develop an understanding of the actions and the interactions of the earth's subsystems: the geosphere, hydrosphere, atmosphere and biosphere.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10248E4","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. The systems at the earth's surface are powered principally by the sun and contain an essentially fixed amount of each stable chemical atom or element."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10110D0","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. The processes of the carbon, rock, and water cycle."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101F120","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. Water, glaciers, winds, waves, and gravity as weathering and erosion agents."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101C37B","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. Earth's motions and seasons."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1002AC7","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"5. The composition and structure of earth's atmosphere."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101EEF9","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"6. Severe storms and safety precautions."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1007D05","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"7. Basic weather forecasting, weather maps, fronts, and pressure systems."}]},{"leaf":false,"text":"Benchmark 3: Students will develop an understanding of the origin and evolution of the dynamic earth system.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10170EE","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. The geologic time scale and how it relates to the history of the earth."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S102200E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. Rock sequences, fossils, and radioactive decay and how they are used to estimate the time rocks were formed."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1022A83","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. Earth changes as short term (during a human's lifetime), such as earthquakes and volcanic eruptions, and as long term (over a geological time scale), such as mountain building and plate movements."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100F654","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. The dramatic changes in the earth's atmosphere (i.e., introduction of O<sub>2</sub>) which were affected by the emergence of life on earth."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10081B4","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"5. The rock cycle describes the formation of rocks."}]},{"leaf":false,"text":"Benchmark 4: Students will develop an understanding of the organization of the universe, and its development.","children":[{"leaf":false,"text":"1. Organization of the universe.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027297","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Example: The sun is an ordinary star. It appears that many stars have planets orbiting them. Our galaxy (The Milky Way) contains about 100 billion stars. Galaxies are a level of organization of the universe. There are at least 100 billion galaxies in the observable universe. Galaxies are organized into large superclusters with large voids between them."}]},{"leaf":false,"text":"2. Expansion of the universe from a hot dense early state.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027298","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Example: By studying the light emitted from distant galaxies, it has been found that galaxies are moving apart from one another. Cosmological understanding including the Big Bang Theory is based on this expansion."}]},{"leaf":false,"text":"3. Organization and development of stars, solar systems, and planets.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027299","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Example: Nebula from which stars and planets form, are mostly hydrogen and helium. Heavier elements were, and continue to be, made by the nuclear fusion reactions in stars. The sun is a second generation star, which along with it's planets was formed billions of years after the Big Bang."}]},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1002E1D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. General methods of the exploration of our solar system and space as well as the importance of such exploration."}]}]},{"leaf":false,"text":"Standard 5: Science and Technology","children":[{"leaf":false,"text":"Benchmark 1: All students will use technology to learn about the world around them.","children":[{"leaf":false,"text":"1. Explore the way things work.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10271DD","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"Example: Observe the inner workings of non-working toys, clocks, telephones, toasters, music boxes."}]},{"leaf":false,"text":"2. Experience science through technology.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10271DE","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"Example: Use science software programs, balances, thermometers, hand lenses, and bug viewers."}]}]},{"leaf":false,"text":"Benchmark 1: All students will work with a technology design.","children":[{"leaf":false,"text":"1. Identify a simple design problem; design a plan, implement the plan, evaluate the results, and communicate the results.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10271FE","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"}],"text":"Examples: Challenge the students to develop a better bubble-making solution using detergent, glycerin, and water; try different kinds of tools for making the biggest bubbles or the longest lasting bubbles."}]}]},{"leaf":false,"text":"Benchmark 2: All students will apply their understanding about science and technology.","children":[{"leaf":false,"text":"1. Discuss that science is a way of investigating questions about their world.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10271FF","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"}],"text":"Examples: Why was a zipper designed? What problem did the zipper solve? How has the zipper improved our lives? How is velcro like a zipper? What problem does velcro solve? How has velcro improved our lives?"}]},{"leaf":false,"text":"2. Invent a product to solve problems.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027200","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"}],"text":"Examples: Invent a new use for old products: potato masher; strainer; carrot peeler; or 2 liter pop bottle. Use a juice can, 2 liter pop bottle or one-half gallon milk jug to invent something useful. Invent something to solve a problem."}]},{"leaf":false,"text":"3. Work together to solve problems.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027201","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"}],"text":"Examples: Solve a problem by working together, sharing ideas, and testing the solutions."}]},{"leaf":false,"text":"4. Develop an awareness that women and men of all ages, backgrounds, and ethnic groups engage in a variety of scientific and technological work.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027202","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"}],"text":"Example: Interview parents and other community and school workers."}]},{"leaf":false,"text":"5. Investigate how scientists use tools to observe.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027203","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"}],"text":"Examples: Engage in research on the Internet; interview the weatherman; conduct research in the library; call or visit a laboratory."}]}]},{"leaf":false,"text":"Benchmark 3: All students will distinguish between natural and human-made objects.","children":[{"leaf":false,"text":"1. Compare, contrast, and sort human-made versus natural objects.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027204","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"}],"text":"Example: Compare and contrast silk flowers to real flowers."}]},{"leaf":false,"text":"2. Use appropriate tools when observing natural and human-made objects.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027205","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"}],"text":"Example: Use a magnifier when observing objects."}]},{"leaf":false,"text":"3. Ask questions about natural or human-made objects and discuss the reasoning behind their examples.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027206","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"}],"text":"Example: The teacher will ask, \"Is this a human-made object? Why do you think so?\" When observing a natural or human-made object, the child will be asked the reasoning behind his/her answer."}]}]},{"leaf":false,"text":"Benchmark 1: The students will demonstrate abilities of technological design.","children":[{"leaf":false,"text":"1. Identify appropriate problems for technological design.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S102724D","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Examples: Design a measurement instrument (e.g., weather instruments) for a science question that students are investigating. Select and research a current technology, then project how it might change in the next twenty years."}]},{"leaf":false,"text":"2. Design a solution or product, implement the proposed design, evaluate the product.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S102724E","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Example: Design, create and evaluate a product that meets a need or solves a problem in a student's life."}]},{"leaf":false,"text":"3. Communicate the process of technological design.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S102724F","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Example: Keep a log of designing (and building) a technology, then use the log to explain the process."}]}]},{"leaf":false,"text":"Benchmark 2: The students will develop understandings of the similarities, differences, and relationships in science and technology.","children":[{"leaf":false,"text":"1. Compare the work of scientists with that of applied scientists and technologists.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027250","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Example: A scientist studies air pressure. A technologist designs an airplane wing.  Complete a Venn diagram to compare the processes of scientists and technologists."}]},{"leaf":false,"text":"2. Evaluate limitations and trade-offs of technological solutions.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027251","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Example: Select a technology to evaluate using a graphic organizer. List uses, limitations, possible consequences."}]},{"leaf":false,"text":"3. Identify contributions to science and technology by many people and many cultures.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027252","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Example: Using a map of the world, mark the locations for people and events that have contributed to science."}]}]},{"leaf":false,"text":"Benchmark 1: Students will develop understandings about science and technology.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S100A66D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. Creativity, imagination, and a broad knowledge base are all required in the work of science and engineering."},{"leaf":false,"text":"2. Science and technology are pursued for different purposes.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S102729A","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Examples: Scientific inquiry is driven by the desire to understand the natural world. Applied science technology is driven by the need to meet human needs and solve human problems."}]},{"leaf":"true","id":"http://asn.jesandco.org/resources/S102541F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. Scientists in different disciplines ask different questions, use different methods of investigation, and accept different types of evidence to support their explanations."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1026A37","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. Science advances new technologies. New technologies open new areas for scientific inquiry."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101ADF2","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"5. Technological knowledge is often not made public because of the financial and military potential of the idea or invention. Scientific knowledge is made public through presentations at professional meetings and publications in scientific journals."}]}]},{"leaf":false,"text":"Standard 6: Science in Personal and Environmental Perspectives","children":[{"leaf":false,"text":"Benchmark 1: All students will demonstrate responsibility for their own health.","children":[{"leaf":false,"text":"1. Engage in personal care.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10271DF","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"Examples: Practice washing hands and brushing teeth. Discuss appropriate types of  clothing to wear. Discuss personal hygiene."}]},{"leaf":false,"text":"2. Discuss healthy foods.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10271E0","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"Example: Cut out pictures of foods and sort into healthy and not healthy groups."}]},{"leaf":false,"text":"3. Discuss that safety and security are basic human needs.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10271E1","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"Examples: Discuss the need to obey traffic signals, the use of crosswalks, and the  danger of talking to strangers."}]}]},{"leaf":false,"text":"Benchmark 1: All students will develop an understanding of personal health.","children":[{"leaf":false,"text":"1. Discuss that safety involves freedom from danger, risk, or injury.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027207","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"}],"text":"Examples: Classroom discussions could include bike safety, water safety, weather safety, sun protection."}]},{"leaf":false,"text":"2. Assume some responsibility for their own health.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027208","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"}],"text":"Examples: Practice good dental hygiene and cleanliness. Discuss healthy exercise and sleep habits."}]},{"leaf":false,"text":"3. Discuss that various foods contribute to health.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027209","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"}],"text":"Examples: Read and compare nutrition information found on labels; discuss healthy foods; make a healthy snack."}]}]},{"leaf":false,"text":"Benchmark 2: All students will demonstrate an awareness of changes in the environment.","children":[{"leaf":false,"text":"1. Define pollution.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S102720A","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"}],"text":"Example: Take a pollution walk, gathering examples of litter and trash."}]},{"leaf":false,"text":"2. Develop personal actions to solve pollution problems in and around the neighborhood.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S102720B","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"}],"text":"Example: After the pollution walk, children could work in groups to solve pollution problems they observed."}]},{"leaf":false,"text":"3. Practice reducing, reusing, and recycling.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S102720C","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"}],"text":"Examples: Present the problem that paper is being wasted in the classroom. Students could meet and form a plan to resolve this problem."}]}]},{"leaf":false,"text":"Benchmark 1: The students will make decisions based on scientific understanding of personal health.","children":[{"leaf":false,"text":"1. Identify individual nutrition, exercise, and rest needs based on science.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027253","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Example: Design, implement, and self-evaluate a personal nutrition and exercise program."}]},{"leaf":false,"text":"2. Use a systemic approach to thinking critically about personal health risks and benefits.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027254","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Examples: Compare and contrast immediate benefits of eating junk food to long term benefits of a lifetime of healthy eating. Evaluate the risks and benefits of foods, medicines, and personal products. Evaluate and compare the nutritional and toxic properties of various natural and synthetic foods."}]}]},{"leaf":false,"text":"Benchmark 2: The students will understand the impact of human activity on resources and environment.","children":[{"leaf":false,"text":"1. Investigate the effects of human activities on the environment.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027255","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Examples: Count the number of cars that pass the school during a period of time. Investigate the effects of traffic volume on environmental quality (e.g., water and air quality, plant health). Investigate the effects of repeatedly walking off the sidewalks. Discuss the implications for the environment. Participate in an environmental Internet study."}]},{"leaf":false,"text":"2. Base decisions on perceptions of benefits and risks.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027256","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Example: Evaluate the benefits of burning fossil fuels to meet energy needs against the risks of global warming."}]}]},{"leaf":false,"text":"Benchmark 3: The students will understand that hazards are dynamic examples of earth processes which cause us to evaluate risks.","children":[{"leaf":false,"text":"1. Evaluate risks and define appropriate actions associated with natural hazards.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027257","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Example: Find news articles that show inadvisable risks taken in a natural hazard situation."}]},{"leaf":false,"text":"2. Recognize patterns of internal and external earth processes that may result in natural hazards.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027258","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Example: Build wood block models of plate boundary interaction: subduction, translation, and spreading."}]},{"leaf":false,"text":"3. Communicate human activities that can cause/contribute to natural hazards.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027259","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Example: How can channeling a stream promote flooding downstream? Borrow a County Conservation Commission's stream trailer to investigate the dynamics of a stream and the effects of human interaction with the stream."}]}]},{"leaf":false,"text":"Benchmark 1: Students will develop an understanding of the overall functioning of human systems and their interaction with the environment in order to understand specific mechanisms and processes related to health issues.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1013ABE","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. Hazards and the potential for accidents exist for all human beings."},{"leaf":false,"text":"2. The severity of disease symptoms is dependent on many factors, such as human resistance and the virulence of the disease-producing organism.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S102729B","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Examples: Many diseases can be prevented, controlled, or cured. Some diseases, such as cancer, result from specific body dysfunctions and are not communicable."}]},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100A4A6","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. Informed personal choices concerning fitness and health involve an understanding of chemistry and biology."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1003E04","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. Selection of foods and eating patterns determine nutritional balance."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1015D51","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"5. Sexuality is basic to healthy human development."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100D4E0","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"6. Intelligent use of chemical products relates directly to an understanding of chemistry."}]},{"leaf":false,"text":"Benchmark 2: Students will demonstrate an understanding of population growth.","children":[{"leaf":false,"text":"1. Rate of change in populations is determined by the combined effects of birth and death, and emigration and immigration.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S102729C","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Examples: Populations can increase through exponential growth. Population growth changes resource use and environmental conditions."}]},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100EED6","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. A variety of factors influence birth rates and fertility rates."},{"leaf":false,"text":"3. Populations can reach limits to growth.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S102729D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Examples: Carrying capacity is the maximum number of organisms that can be sustained in a given environment. Natural resources limit the capacity of ecosystems to sustain populations."}]}]},{"leaf":false,"text":"Benchmark 3: Students will understand that human populations use natural resources and influence environmental quality.","children":[{"leaf":false,"text":"1. Natural resources from the lithosphere and ecosystems have been and will continue to be used to sustain human populations.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S102729E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Examples: These processes of ecosystems include maintenance of the atmosphere, generation of soils, control of the hydrologic cycle, and recycling of nutrients.<br />Humans are altering many of these processes, and the changes may be detrimental to ecosystem function."}]},{"leaf":false,"text":"2. The earth does not have infinite resources.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S102729F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Example: Increasing human consumption places stress on most renewable resources and depletes non-renewable resources."}]},{"leaf":false,"text":"3. Materials from human activities affect both physical and chemical cycles of the earth.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10272A0","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Example: Natural systems can reuse waste, but this capacity is limited."}]},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100034F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. Humans use many natural systems as resources."}]},{"leaf":false,"text":"Benchmark 4: Students will understand the effect of natural and human-influenced hazards.","children":[{"leaf":false,"text":"1. Natural processes of earth may be hazardous for humans.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10272A1","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Examples: Humans live at the interface between two dynamically changing systems, the atmosphere and the earth's crust. The vulnerability of societies to disruption by natural processes has increased. Natural hazards include volcanic eruptions, earthquakes, and severe weather. Examples of slow, progressive changes are stream channel position, sedimentation, continual erosion, wasting of soil, and landscapes."}]},{"leaf":false,"text":"2. There is a need to assess potential risk and danger from natural and human-induced hazards.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10272A2","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Examples: Human-initiated changes in the environment bring benefits as well as risks to society.<br />Various changes have costs and benefits. Environmental ethics have a role in the decision-making process."}]}]},{"leaf":false,"text":"Benchmark 5: Students will develop an understanding of the relationship between science, technology, and society.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10015A8","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. Science and technology are essential components of modern society. Science and technology indicate what can happen, not what should happen. The latter involves human decisions about the use of knowledge."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1013849","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. Understanding basic concepts and principles of science and technology should precede active debate about the economics, policies, and ethics of various challenges related to science and technology."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1023C20","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. Progress in science and technology can be affected by social issues and challenges."}]}]},{"leaf":false,"text":"Standard 7: History and Nature of Science","children":[{"leaf":false,"text":"Benchmark 1: All students will know they practice science.","children":[{"leaf":false,"text":"1. Be involved in explorations that make them wonder and know that they are practicing science.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10271E2","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"Examples: Observe what happens when you place a banana or an orange (with and without the skin), or a crayon in water. Observe what happens when you hold an M & M, a chocolate chip, or a raisin in your hand. Note the  changes. Observe what happens when you rub your hands together very fast."}]},{"leaf":false,"text":"2. Use technology to learn about people in science.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10271E3","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"Examples: Read short stories, and view films or videos. Invite parents who are involved in science as guest speakers."}]}]},{"leaf":false,"text":"Benchmark 1: All students will develop an awareness that people practice science.","children":[{"leaf":false,"text":"1. Recognize that students participate in science inquiry by asking questions.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S102720D","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"}],"text":"Examples: Design an investigation to determine how plants are affected by various amounts of light; to determine the \"best\" paper towel (define best); to determine which liquid causes substances such as a jawbreaker, chocolate candy, and Jell-O to dissolve quickest."}]},{"leaf":false,"text":"2. Observe, using various media, historical samples of people in science who have made contributions.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S102720E","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"}],"text":"Examples: Read short stories; view films or videos; discuss contributions made by people in science."}]}]},{"leaf":false,"text":"Benchmark 1: The students will develop scientific habits of mind.","children":[{"leaf":false,"text":"1. Practice intellectual honesty.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S102725A","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Examples: Analyze news articles to evaluate if the articles apply statistics/data to bring clarity, or if the articles use data to mislead. Analyze data and recognize that an hypothesis not supported by data should not be perceived as a right or wrong answer."}]},{"leaf":false,"text":"2. Demonstrate skepticism appropriately.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S102725B","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Example: Students will attempt to replicate an investigation to support or refute a conclusion."}]},{"leaf":false,"text":"3. Display open-mindedness to new ideas.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S102725C","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Example: Share interpretations that differ from currently held explanations on topics such as global warming and dietary claims. Evaluate the validity of results and accuracy of stated conclusions."}]},{"leaf":false,"text":"4. Base decisions on evidence.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S102725D","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Example: Review results of individual, group, or peer investigations to assess the accuracy of conclusions based upon data collection and analysis and use of evidence to reach a conclusion."}]}]},{"leaf":false,"text":"Benchmark 2: The students will research contributions to science throughout history.","children":[{"leaf":false,"text":"1. Recognize that new knowledge leads to new questions and new discoveries.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S102725E","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Examples: Discuss discoveries that replaced previously held knowledge, such as safety of freon or saccharine use, knowledge concerning the transmission of AIDS, cloning, Pluto's status as a planet."}]},{"leaf":false,"text":"2. Replicate historic experiments to understand principles of science.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S102725F","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Example: Rediscover principles of electromagnetism by replicating Oersted's compass needle experiment. (Compass needle deflects perpendicular to current carrying wire.)"}]},{"leaf":false,"text":"3. Relates contributions of men and women to the fields of science.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027260","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"Example: Research the contributions of men and women of science, create a timeline to demonstrate the ongoing contributions of dedicated scientists from across ethnic, religious, and gender lines."}]}]},{"leaf":false,"text":"Benchmark 1: Students will develop an understanding that science is a human endeavor.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1025739","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. Demonstrate an understanding of science as both vocation and avocation."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101993D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. Explain how science uses peer review, replication of methods, and norms of honesty."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10099DE","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. Recognize the universality of basic science concepts and the influence of personal and cultural beliefs that embed science in society."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1001BBD","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. Recognize that society helps create the ways of thinking (mindsets) required for scientific advances, both toward training scientists and educating a populace to utilize benefits of science (e.g., standards of hygiene, attitudes toward forces of nature, etc.)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100B7DF","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"5. Recognize society's role in supporting topics of research and determining institutions where research is conducted."}]},{"leaf":false,"text":"Benchmark 2: Students will develop an understanding of the nature of scientific knowledge.","children":[{"leaf":false,"text":"1. Demonstrate an understanding of the nature of scientific knowledge.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10272A3","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Examples: Scientific knowledge is generally empirically based, logical, skeptical, and consistent with observable reality.<br />Scientific knowledge is subject to experimental or observational confirmation.<br />Scientific knowledge is built on past understanding and can be refined and augmented."}]}]},{"leaf":false,"text":"Benchmark 3: Students will understand science from historical perspectives.","children":[{"leaf":false,"text":"1. Demonstrate an understanding of the history of science.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10272A4","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Examples: Modern science has been a successful enterprise that contributes to dramatic improvements in the human condition.<br />Science progresses by incremental advances of scientists or teams of scientists.<br />Some advances that are fundamental and long-lasting include: Copernican revolution, Newtonian physics, relativity, geological time scale, plate tectonics, atomic theory, nuclear physics, biological evolution, germ theory, industrial revolution, molecular biology, quantum theory, medical and health technology."}]}]}]},{"leaf":false,"text":"Standard 2A: Chemistry","children":[{"leaf":false,"text":"Benchmark 1: The student will understand the structure of the atom.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1023CF4","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. Atoms are the fundamental organizational unit of matter."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100245E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. Atoms have smaller components that have measurable mass and charge."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1008E89","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. The nucleus of an atom is composed of protons and neutrons, which determine the mass of the atom."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100EEB5","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. The dense nucleus of an atom is in the center of an electron cloud, and the electron cloud determines the size of the atom."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101968A","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"5. Isotopes are atoms with the same number of protons but different numbers of neutrons."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10158C8","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"6. Radioactive isotopes spontaneously decompose and are a source of radioactivity."}]},{"leaf":false,"text":"Benchmark 2: The students will understand the states and properties of matter.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S101232B","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. Elements are substances that contain one kind of atom."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1008EBB","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. Elements are arranged according to increasing atomic number on the periodic table."},{"leaf":false,"text":"3. The periodic table organizes elements according to similar physical and chemical properties by groups, periods, and categories.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027268","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Examples: Elements in the same group share similar chemistry. Periods indicate an energy level of the outermost electrons. Categories are regions such as metals, non-metals, and transition elements."}]},{"leaf":false,"text":"4. There are discrete energy levels for electrons in an atom.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027269","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Example : Electrons changing from one energy level to another may result in the emission or absorption of various forms of electromagnetic radiation, including the range of colors which form visible light. Indeed, when there is color, there are electrons changing energy levels."}]},{"leaf":"true","id":"http://asn.jesandco.org/resources/S102438D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"5. Valence electrons (those farthest from the nucleus or highest energy electrons) determine the chemistry of the atom."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100D59F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"6. Chemical bonds result when electrons are transferred or shared between atoms."},{"leaf":false,"text":"7. Compounds result from chemical bonds between ions or atoms.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S102726A","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Examples: Ionic compounds result from an attraction between ions of opposite  charge (ionic bond). Molecular compounds result from atoms sharing  electrons (covalent bond)."}]},{"leaf":false,"text":"8. The nature of interactions among ions or between molecular compounds determines their physical properties.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S102726B","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Examples: Molecules may exist as gases, liquids or solids. The hydrogen bond is an intermolecular attraction responsible for the properties of water and many biological molecules. Ionic compounds are generally solids."}]},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1024E80","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"9. Kinetic models are used to explain the physical properties of gases."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100BBD2","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"10. Carbon atoms can bond to each other in chains, rings, and branching networks to form a variety of molecular structures including relatively large molecules essential to life."}]},{"leaf":false,"text":"Benchmark 3: The students will gain a basic concept of chemical reactions.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1006F70","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. Understand that two or more of the following may often identify chemical reactions: physical property change, effervescence, mass change, precipitation, light emission, and heat exchange."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10227E6","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. Explore chemical reactions that absorb energy from or release energy to the surroundings."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101772C","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. Distinguish different types of chemical reactions such as synthesis, decomposition, combustion, displacement, acid/base, and oxidation/reduction."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100B561","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. Demonstrate the Law of Conservation of Mass through stoichiometric relationships."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101942F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"5. Appreciate the significance of chemical reactions in nature and those used every day in society."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101EA2B","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"6. Recognize entropy (degree of disorder) as a driving force behind chemical reactions."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1002210","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"7. Assess the interrelationships between the rate of chemical reactions and variables such as temperature, concentration, catalysts, and reaction type."}]}]},{"leaf":false,"text":"Standard 2B: Physics","children":[{"leaf":false,"text":"Benchmark 1: The students will understand the relationship between motions and forces.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1020F70","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. The motion of an object can be described in terms of its displacement (position), velocity, and acceleration."},{"leaf":false,"text":"2. Objects change their motion only when a net force is applied.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S102726F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Examples: When no net force acts, the object either doesn't move or moves with constant speed in a straight line. When a net force acts upon an object, the object will change its motion. The magnitude of the change in motion is given by the relationship ΣF=ma, regardless of the type of force."}]},{"leaf":false,"text":"3. Whenever a system applies force to an object, that object applies a related force to the system that is equal in magnitude and opposite in direction.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027270","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Example: The change in an object's motion (acceleration) is in the direction of the net applied force."}]},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101B46D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. Gravitation is a relatively weak, attractive force that acts upon and between any two masses."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1011B1D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"5. Electric force is the attraction or repulsion that exists between two charged particles. Its magnitude is vastly greater than that due to gravity."},{"leaf":false,"text":"6. Electricity and magnetism are two aspects of a single electromagnetic force.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027271","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Example: Moving electrical charges produce magnetic forces, and moving magnets produce electrical forces."}]}]},{"leaf":false,"text":"Benchmark 2: The students will understand the conservation of mass and energy, and that the overall disorder of the universe increases with time.","children":[{"leaf":false,"text":"1. The energy of the universe is constant.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027272","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Examples: Physicists view matter as equivalent to energy. Matter and energy cannot be created or destroyed, but they can be interchanged."}]},{"leaf":false,"text":"2. Energy may be classified as kinetic, potential, or energy within a field.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027273","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Examples: Kinetic energy deals with the motion of objects. Potential energy results from objects' relative configuration. Electromagnetic radiation is an example of energy contained within a field. These energies are interchangeable : kinetic to potential, potential to kinetic, potential to field, etc."}]},{"leaf":false,"text":"3. Heat is the transfer of energy from objects at higher temperature to objects at lower temperature.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027274","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Examples: The internal energy of substances consists in part of movement of atoms, molecules, and ions. Temperature is a measure of the average magnitude of this movement. Heat is an exchange of internal energy between systems."}]},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1023C74","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. The universe tends to become less organized and more disordered with every chemical and physical change."}]},{"leaf":false,"text":"Benchmark 3: The students will understand the basic interactions of matter and energy.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S101D060","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. Waves can transfer energy when they interact with matter."},{"leaf":false,"text":"2. Electromagnetic waves result when a charged object is accelerated.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027275","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Example: Electromagnetic waves include radio waves, microwaves, infrared radiation, visible light, ultraviolet radiation, x-rays, and gamma rays."}]},{"leaf":false,"text":"3. Each kind of atom or molecule can gain or lose energy in unique, discrete amounts.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1027276","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"Examples: Atoms and molecules can absorb and emit light only at wavelengths corresponding to specific amounts of energy. These wavelengths can be used to identify the substance and form the basis for several forms of spectroscopy."}]},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1004889","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. Electrons flow easily in conductors (such as metals). Semiconducting materials have intermediate behavior. At low temperatures, some materials become superconductors and offer little or no resistance to the flow of electrons."}]}]}]