[{"leaf":false,"text":"CONTENT STANDARD 1. CONCEPTS AND PROCESSES<br />In the context of unifying concepts and processes, students develop an understanding of scientific content through inquiry. Science is a dynamic process; concepts and content are best learned through inquiry and investigation. Concepts in LIFE SYSTEMS, EARTH and SPACE SYSTEMS, and PHYSICAL SYSTEMS are taught within the context of the following Unifying Concepts and Processes of Science:<ul> <li>Systems, classification, order and organization</li> <li>Evidence, models, and explanations</li> <li>Cycles and change over time</li> <li>Measurement</li> <li>Form and function</li></ul>","children":[{"leaf":false,"text":"LIFE SYSTEMS","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113902F","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"},{"prefLabel":"4"}],"asn_statementNotation":"SC4.1.1","text":"Characteristics of Organisms: Students describe observable characteristics of living things, including structures that serve specific functions and everyday behaviors."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1139030","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"},{"prefLabel":"4"}],"asn_statementNotation":"SC4.1.2","text":"Life Cycles of Organisms: Students sequence life cycles of living things, and recognize that plants and animals resemble their parents."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1139031","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"},{"prefLabel":"4"}],"asn_statementNotation":"SC4.1.3","text":"Organisms and Their Environments: Students show connections between living things, their basic needs, and the environments."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1139039","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"asn_statementNotation":"SC8.1.1","text":"Levels of Organization in Living Systems: Students model the cell as the basic unit of a living system. They realize that all functions that sustain life act within a single cell and cells differentiate into specialized cells, tissues, organs, and organ systems."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113903A","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"asn_statementNotation":"SC8.1.2","text":"Reproduction and Heredity: Students describe reproduction as a characteristic of all living systems, which is essential to the continuation of species, and identify and interpret traits, patterns of inheritance, and the interaction between genetics and environment."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113903B","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"asn_statementNotation":"SC8.1.3","text":"Evolution as a Theory: Students explain evolution as a theory and apply the theory to the diversity of species, which results from natural selection and the acquisition of unique characteristics through biological adaptation."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113903C","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"asn_statementNotation":"SC8.1.4","text":"Diversity of Organisms: Students investigate the interconnectedness of organisms, identifying similarity and diversity of organisms through a classification system of hierarchical relationships and structural homologies."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113903D","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"asn_statementNotation":"SC8.1.5","text":"Behavior and Adaptation: Students recognize behavior as a response of an organism to an internal or environmental stimulus and connect the characteristics and behaviors of an organism to biological adaptation."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113903E","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"asn_statementNotation":"SC8.1.6","text":"Interrelationships of Populations and Ecosystems: Students illustrate populations of organisms and their interconnection within an ecosystem, identifying relationships among producers, consumers, and decomposers."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1139047","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC11.1.1","text":"The Cell: Explain the processes of life, which necessitates an understanding of relationships between structure and function of the cell and cellular differentiation. Identify activities taking place in an organism related to metabolic activities in cells, including growth, regulation, transport, and homeostasis. Differentiate between asexual and sexual reproduction."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1139048","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC11.1.2","text":"Molecular Basis of Heredity: Demonstrate an understanding that organisms ensure species continuity by passing genetic information from parent to offspring. Utilize genetic information to make predictions about possible offspring. Apply concepts of molecular biology (DNA and genes) to recent discoveries."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1139049","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC11.1.3","text":"Biological Evolution: Explain how species evolve over time. Understand that evolution is the consequence of various interactions, including the genetic variability of offspring due to mutation and recombination of genes, and the ensuing selection by the environment of those offspring better able to survive and leave additional offspring. Discuss natural selection and that its evolutionary consequences provide a scientific explanation for the great diversity of organisms as evidenced by the fossil record. Examine how different species are related by descent from common ancestors. Explain how organisms are classified based on similarities that reflect their evolutionary relationships, with species being the most fundamental unit of classification."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113904A","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC11.1.4","text":"Interdependence of Organisms: Investigate the interrelationships and interdependence of organisms, including the ecosystem concept, energy flow, competition for resources, and human effects on the environment."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113904B","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC11.1.5","text":"Matter, Energy, and Organization in Living Systems: Describe the need of living systems for a continuous input of energy to maintain chemical and physical stability. Explain the unidirectional flow of energy and organic matter through a series of trophic levels in living systems. Investigate the distribution and abundance of organisms in ecosystems, which are limited by the availability of matter and energy and the ability of the living system to recycle materials."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113904C","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC11.1.6","text":"Behavior and Adaptation: Examine behavior as the sum of responses of an organism to stimuli in its environment, which evolves through adaptation, increasing the potential for species survival. Identify adaptations as characteristics and behaviors of an organism that enhance the chance for survival and reproductive success in a particular environment."}]},{"leaf":false,"text":"EARTH AND SPACE SYSTEMS","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1139032","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"},{"prefLabel":"4"}],"asn_statementNotation":"SC4.1.4","text":"Properties of Earth Materials: Students investigate water, air, rocks, and soils to compare basic properties of earth materials."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1139033","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"},{"prefLabel":"4"}],"asn_statementNotation":"SC4.1.5","text":"Objects in the Sky: Students describe observable objects in the sky and their patterns of movement."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1139034","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"},{"prefLabel":"4"}],"asn_statementNotation":"SC4.1.6","text":"Changes in Earth and Sky: Students describe observable changes in earth and sky, including rapid and gradual changes to the earth's surface, and daily and seasonal changes in the weather."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113903F","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"asn_statementNotation":"SC8.1.7","text":"The Earth in the Solar System: Students describe Earth as the third planet in the Solar System and understand the effects of the sun as a major source of energy, gravitational forces, and motions of objects in the Solar System."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1139040","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"asn_statementNotation":"SC8.1.8","text":"The Structure of the Earth System: Students examine the structure of the Earth, identifying layers of the Earth, considering plate movement and its effect, and recognizing landforms resulting from constructive and destructive forces."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1139041","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"asn_statementNotation":"SC8.1.9","text":"The Earth's History: Students systematize the Earth's history in terms of geologic evidence, comparing past and present Earth processes and identifying catastrophic events and fossil evidence."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113904D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC11.1.7","text":"Geochemical Cycles: Describe the Earth as a closed system and demonstrate a conceptual understanding of the following systems:<ul> <li>Geosphere</li> <li>Hydrosphere</li> <li>Atmosphere</li> <li>Biosphere</li></ul> Explain the role of energy in each of these systems, such as weather patterns, global climate, weathering, and plate tectonics."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113904E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC11.1.8","text":"Origin and Evolution of the Earth System: Investigate geologic time through comparing rock sequences, the fossil record, and decay rates of radioactive isotopes."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113904F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC11.1.9","text":"Origin and Evolution of the Universe: Examine evidence for the Big Bang Theory and recognize the immense time scale involved in comparison to human-perceived time. Describe the process of star and planet formation, planetary and stellar evolution, including the fusion process, element formation, and dispersion."}]},{"leaf":false,"text":"PHYSICAL SYSTEMS","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1139035","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"},{"prefLabel":"4"}],"asn_statementNotation":"SC4.1.7","text":"Properties of Objects: Students classify objects by properties that can be observed, measured, and recorded, including color, shape, size, weight, volume, texture, and temperature."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1139036","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"},{"prefLabel":"4"}],"asn_statementNotation":"SC4.1.8","text":"Changes in States of Matter: Students demonstrate that the processes of heating and cooling can change matter from one state to another."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1139037","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"},{"prefLabel":"4"}],"asn_statementNotation":"SC4.1.9","text":"Physical Phenomena: Students investigate physical phenomena commonly encountered in daily life, including light, heat, electricity, sound, and magnetism."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1139038","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"},{"prefLabel":"4"}],"asn_statementNotation":"SC4.1.10","text":"Position and Motion of Objects: Students demonstrate that pushing and pulling can change the position and motion of objects."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1139042","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"asn_statementNotation":"SC8.1.10","text":"The Structure and Properties of Matter: Students identify characteristic properties of matter such as density, solubility, and boiling point and understand that elements are the basic components of matter."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1139043","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"asn_statementNotation":"SC8.1.11","text":"Physical and Chemical Changes in Matter: Students evaluate chemical and physical changes, recognizing that chemical change forms compounds with different properties and that physical change alters the appearance but not the composition of a substance."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1139044","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"asn_statementNotation":"SC8.1.12","text":"Forms and Uses of Energy: Students investigate energy as a property of substances in a variety of forms with a range of uses."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1139045","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"asn_statementNotation":"SC8.1.13","text":"The Conservation of Matter and Energy: Students identify supporting evidence to explain conservation of matter and energy, indicating that matter or energy cannot be created or destroyed but is transferred from one object to another."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1139046","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"asn_statementNotation":"SC8.1.14","text":"Effects of Motions and Forces: Students describe motion of an object by position, direction, and speed, and identify the effects of force and inertia on an object."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1139050","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC11.1.10","text":"Structure and Properties of Matter: Describe the atomic structure of matter, including subatomic particles, their properties, and interactions. Recognize that elements are organized into groups in the periodic table based on their outermost electrons and these groups have similar properties. Explain chemical bonding in terms of the transfer or sharing of electrons between atoms. Describe physical states of matter and phase changes. Differentiate between chemical and physical properties, and chemical and physical changes."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1139051","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC11.1.11","text":"Chemical Reactions: Recognize that chemical reactions take place all around us. Realize that chemical reactions may release or consume energy, occur at different rates. Identify the factors that affect reaction rates. and result in the formation of different substances."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1139052","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC11.1.12","text":"Conservation of Energy and Increase in Disorder: Demonstrate and understanding of the laws of conservation of mass and energy within the context of physical and chemical changes. Realize the tendency for systems to increase in disorder."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1139053","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC11.1.13","text":"Energy and Matter: Demonstrate an understanding of types of energy, energy transfer and transformations, and the relationship between mass and energy."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1139054","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC11.1.14","text":"Force and Motion: Develop a conceptual understanding of Newton's Laws of Motion, gravity, electricity, and magnetism."}]}]},{"leaf":false,"text":"CONTENT STANDARD 2. SCIENCE AS INQUIRY<br />Students demonstrate knowledge, skills, and habits of mind necessary to safely perform scientific inquiry. Inquiry is the foundation for the development of content, teaching students the use of processes of science that enable them to construct and develop their own knowledge. Inquiry requires appropriate field, classroom, and laboratory experiences with suitable facilities and equipment.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S113901B","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"},{"prefLabel":"4"}],"asn_statementNotation":"SC4.2.1","text":"Students research answers to science questions and present findings through appropriate means."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113901C","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"},{"prefLabel":"4"}],"asn_statementNotation":"SC4.2.2","text":"Students use the inquiry process to conduct simple scientific investigations.<ul> <li>Collect and organize data.</li> <li>Use data to construct simple graphs, charts, diagrams, and/or models.</li> <li>Draw conclusions and accurately communicate results, making connections to daily life.</li> <li>Pose or identify questions and make predictions.</li> <li>Conduct investigations to answer questions and check predictions.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113901D","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"},{"prefLabel":"4"}],"asn_statementNotation":"SC4.2.3","text":"Students identify and use appropriate scientific equipment."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113901E","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"},{"prefLabel":"4"}],"asn_statementNotation":"SC4.2.4","text":"Students properly use safety equipment and recognize hazards and safety symbols while practicing standard safety procedures."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113901F","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"asn_statementNotation":"SC8.2.1","text":"Students research scientific information and present findings through appropriate means."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1139020","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"asn_statementNotation":"SC8.2.2","text":"Students use inquiry to conduct scientific investigations.<ul> <li>Ask questions that lead to conducting an investigation.</li> <li>Collect, organize, and analyze and appropriately represent data.</li> <li>Draw conclusions based on evidence and make connections to applied scientific concepts.</li> <li>Clearly and accurately communicate the result of the investigations.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1139021","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"asn_statementNotation":"SC8.2.3","text":"Students clearly and accurately communicate the result of their own work, as well as information obtained from other sources."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1139022","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"asn_statementNotation":"SC8.2.4","text":"Students recognize the relationship between science and technology in meeting human needs."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1139023","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"asn_statementNotation":"SC8.2.5","text":"Students properly use appropriate scientific and safety equipment, recognize hazards and safety symbols, and observe standard safety procedures."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1139024","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC11.2.1","text":"Students use research scientific information and present findings through appropriate means."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1139025","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC11.2.2","text":"Students use inquiry to conduct scientific investigations.<ul> <li>Pose problems and identify questions and concepts to design and conduct an investigation.</li> <li>Collect, organize, analyze and appropriately represent data.</li> <li>Give priority to evidence in drawing conclusions and making connections to scientific concepts.</li> <li>Clearly and accurately communicate the result of the investigation.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1139026","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC11.2.3","text":"Students clearly and accurately communicate the result of their own work as well as information from other sources."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1139027","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC11.2.4","text":"Students investigate the relationships between science and technology and the role of technological design in meeting human needs."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1139028","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC11.2.5","text":"Students properly use appropriate scientific and safety equipment, recognize hazards and safety symbols, and observe standard safety procedures."}]},{"leaf":false,"text":"CONTENT STANDARD 3. HISTORY AND NATURE OF SCIENCE IN PERSONAL AND SOCIAL DECISIONS<br />Students recognize the nature of science, its history, and its connections to personal, social, economic, and political decisions. Historically, scientific events have had significant impacts on our cultural heritage.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1139029","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"},{"prefLabel":"4"}],"asn_statementNotation":"SC4.3.1","text":"Students recognize the nature and history of science.<ul> <li>Discuss how scientific ideas change over time.</li> <li>Describe contributions of scientists.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113902A","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"},{"prefLabel":"4"}],"asn_statementNotation":"SC4.3.2","text":"Students recognize how scientific information is used to make decisions.<ul> <li>Identify and describe local science issues, such as environmental hazards or resource management.</li> <li>Suggest feasible solutions and personal action plans to address an identified issue.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113902B","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"asn_statementNotation":"SC8.3.1","text":"Students explore the nature and history of science.<ul> <li>Students explore how scientific knowledge changes and grows over time, and impacts personal and social decisions.</li> <li>Students explore the historical use of scientific information to make personal and social decisions.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113902C","dcterms_educationLevel":[{"prefLabel":"5"},{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"asn_statementNotation":"SC8.3.2","text":"Students explore how scientific information is used to make decisions.<ul> <li>The role of science in solving personal, local, and national problems.</li> <li>Interdisciplinary connections of the sciences and connections to other subject areas and careers in science or technical fields.</li> <li>Origins and conservation of natural resources, including Wyoming examples.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113902D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC11.3.1","text":"Students examine the nature and history of science.<ul> <li>As scientific knowledge evolves, it impacts personal, social, economic, and political decisions.</li> <li>The historical misuse of scientific information to make personal, social, economic, and political decisions.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S113902E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC11.3.2","text":"Students examine how scientific information is used to make decisions.<ul> <li>Interdisciplinary connections of the sciences and connections to other subject areas and career opportunities.</li> <li>The role of science in solving personal, local, national, and global problems.</li> <li>The origins, limitations, and conservation of natural resources, including Wyoming examples.</li></ul>"}]}]