[{"leaf":false,"text":"EALR 1 -- Systems: The student knows and applies scientific concepts and principles to understand the properties, structures and changes in physical, earth/space, and living systems.","children":[{"leaf":false,"text":"Component 1.1 Properties: Understand how properties are used to identify, describe, and categorize substances, materials, and objects and; how characteristics are used to categorize living things.","children":[{"leaf":false,"text":"Physical Systems","children":[{"leaf":false,"text":"1.1.1 Properties of Substances<br /> Understand simple properties of common, natural and manufactured materials and objects.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028CD2","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"(K) Identify and describe a property of an object."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028CD3","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"(K) Sort common materials and objects using a simple property (e.g., texture, color, size, shape)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028CD4","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"(2) Sort common objects by multple simple properties (e.g., textures and color, size and shape)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028CD5","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"(2) Identify and describe the differences between common natural and manufactured materials and objects using properties."}]},{"leaf":false,"text":"1.1.2 Motion of Objects<br /> Understand the position and motion of common objects.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028CD6","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"(1) Know that things may move in many different ways (i.e., back and forth, fast and slow, round and round, straight)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028CD7","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"(1) Describe that the way to change how something is moving is to give it a push or a pull."}]},{"leaf":false,"text":"1.1.1 Properties of Substances <br /> Understand how to use properties to sort natural and manufactured materials and objects. W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D4E","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"(4) Identify, describe, and sort objects and materials using observed physical properties such as hardness, shape, state of matter, smell, temperature, texture, weight, and magnetic properties."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D4F","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"(4) Sort and classify natural and manufactured materials and objects according to various physical properties (e.g., length, weight, hardness, temperature, color, shape, texture, and smell)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D50","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"(4) Identify and describe the state of water as solid, liquid, or gas in different situations."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D51","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"(4) Identify which states of matter (solid, liquid, or gas) can change shape and which can expand to fill a container."}]},{"leaf":false,"text":"1.1.2 Motion of Objects <br /> Understand the relative position and motion of objects. W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D53","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"(3) Measure and describe the position of one object relative to another object (or surroundings) using positional language (such as in front of, behind, to the left, to the right, above, and below) and a distance scale (such as centimeters)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D54","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"(5) Describe the motion of an object in terms of distance, time, and direction as the object travels in a straight line."}]},{"leaf":false,"text":"1.1.3 Wave Behavior <br /> Understand the behavior of sound in terms of vibrations and pitch and the behavior of light in terms of bouncing off, passing through, and changes in direction. W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D56","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"(3) Understand that when an object vibrates the object may produce sound that people can hear."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D57","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"(3) Explain the relationship between the pitch of a sound and the vibrations of the object causing the sound."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D58","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"(3) Describe experiences with sound (i.e., vibrations, echoes, and pitch)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D59","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"}],"text":"(3,4) Experience, measure, and describe the motion of light as light bounces off and/or passes through an object."}]},{"leaf":false,"text":"1.1.4 Forms of Energy <br /> Understand that energy comes in many forms. W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D5B","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"(4) Describe the forms of energy present in a system (i.e., energy of motion [kinetic], heat energy, sound energy, light energy, electrical energy, chemical energy, and food energy)."}]},{"leaf":false,"text":"1.1.1 Properties of Substances<br /> Understand how to use physical and chemical properties to sort and identify substances.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DFC","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"(6) Identify, catagorize, describe, and sort substances using physical and/or chemical properties (i.e., boiling point, density, freezing point, mass, acidity (pH), solubility, magnetism)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DFD","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"(8) Identify an unknown substance using the properties of a known substance."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DFE","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"(8) Recognize that the mass of an object is the same when measured anywhere in the universe at any normal speed."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DFF","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"(8) Describe why substances with the same volume or same mass may have different densities."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E00","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"(8) Describe the volumetric properties of solids, liquids, and gases (e.g., a gas has the same volume as its container)."}]},{"leaf":false,"text":"1.1.2 Motion of Objects<br /> Understand the positions, relative speeds, and changes in speed of objects.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E02","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(7) Describe and measure the relative position or change in position of one or two objects."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E03","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(7) Describe an object's motion as speeding up, slowing down, or moving with constant speed using models, numbers, words, diagrams, and graphs."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E04","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"(7) Measure and describe the speed of an object relative to the speed of another object."}]},{"leaf":false,"text":"1.1.3 Wave Behavior<br /> Understand sound waves, water waves, and light waves, using wave properties including amplitude, wavelength, and speed.  Understand wave behaviors including reflection, refraction, transmission, and absorption.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E06","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"(6) Describe how sound waves and/or water waves affect the motion of the particles in the substance through which the wave is traveling (e.g., air molecules vibrate back and forth as sound waves move through air."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E07","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"(6) Describe the behavior of sound and water waves as the waves are reflected and/or absorbed by a substance."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E08","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"(8) Describe how the observed properties of light, sound, and water are related to amplitude, frequency, wavelength, and speed of waves (e.g., color and brightness of light, pitch and volume of sound, height of water waves, light waves are faster than sound waves)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E09","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"(8) Describe the behavior of light waves when light interacts with transparent, translucent, and opaque substances (e.g., blue objects appear blue in color because the object reflects mostly blue light and absorbs the other colors of light, transparent objects transmit most light through them, lenses retract light)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E0A","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"(8) Describe the changes in speed and direction as a wave goes from one substance into another."}]},{"leaf":false,"text":"1.1.4 Forms of Energy<br /> Understand that energy is a property of matter, objects, and systems and comes in many forms (i.e., heat[thermal] energy, sound energy, light energy, electrical energy, kinetic energy, potential energy, and chemical energy.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E0C","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"(6) Describe the forms of energy present in matter, objects, and systems (i.e, heat[thermal]energy, sound energy, light energy, electrical energy, kinetic energy, potential energy, and chemical energy."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E0D","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"(6) Describe the form of energy stored in a part of a system (i.e., energy can be stored in many forms, \"stored energy\" is not a form of energy."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E0E","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"(8) Compare the potential and kinetic energy within a system at various locations or times (i.e., kinetic energy is an object's energy of motion, potential energy is an object's energy of position)."}]},{"leaf":false,"text":"1.1.1 Properties of Substances<br /> Understand the atomic nature of matter, how it relates to physical and chemical properties, and serves as the basis for the structure and use of the Periodic Table.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028EBC","dcterms_educationLevel":[{"prefLabel":"10"}],"text":"(10) Identify an unknown substance using the substance's physical and chemical properties."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028EBD","dcterms_educationLevel":[{"prefLabel":"10"}],"text":"(10) Explain and predict the behavior of a substance based upon the substance's atomic structure, physical properties, and chemical properties."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028EBE","dcterms_educationLevel":[{"prefLabel":"10"}],"text":"(10) Describe the properties of electrons, protons, and neutrons (i.e., electrons have negative charge and very little mass, protons have positive charge and much mass, neutrons have neutral charge and the same mass as protons)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028EBF","dcterms_educationLevel":[{"prefLabel":"10"}],"text":"(10) Explain how changing the number of electrons, neutrons, and protons of an atom affects that atom including atomic name, number, and placement on the periodic table."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028EC0","dcterms_educationLevel":[{"prefLabel":"10"}],"text":"(10) Explain the similar properties of elements in a vertical column (groups or families) of the periodic table."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028EC1","dcterms_educationLevel":[{"prefLabel":"10"}],"text":"(10) Predict the properties of an element based on the element's location (groups or families) on the periodic table."}]},{"leaf":false,"text":"1.1.2 Motion of Objects<br /> Apply an understanding of direction, speed , and acceleration when describing the linear motion of objects.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028EC3","dcterms_educationLevel":[{"prefLabel":"9"}],"text":"(9) Describe the linear motion (speed, direction, and acceleration) of an object over a given time interval relative to Earth or some other object (e.g., as a car accelerates onto a freeway the car speeds up from 30Km/hr to 90Km/hr in 10 sec)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028EC4","dcterms_educationLevel":[{"prefLabel":"9"}],"text":"(9) Determine and explain the average speed of an object over a given time interval when the object is moving in a straight line."}]},{"leaf":false,"text":"1.1.3 Wave Behavior<br /> Analyze sounds waves, water waves, and light waves, using wave properties including frequency and energy.  Understand wave interference.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028EC6","dcterms_educationLevel":[{"prefLabel":"10"}],"text":"(10) Describe the relationship between the wave properties of amplitude and frequency and the energy of a wave (e.g., loud vs. soft sound, high vs. low pitch sound, bright vs. dim light, blue light vs. red light)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028EC7","dcterms_educationLevel":[{"prefLabel":"10"}],"text":"(10) Explain the relationship between a wave's speed and the properties of the substance through which the wave travels (e.g., all sound regardless of loudness and pitch travels at the same speed in the same air, a wave changes speed only when traveling from one substance to another)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028EC8","dcterms_educationLevel":[{"prefLabel":"10"}],"text":"(10) Predict and explain what happens to the pitch of sound and color of light as the wave frequency increases or decreases."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028EC9","dcterms_educationLevel":[{"prefLabel":"10"}],"text":"(10) Compare the properties of light waves, sound waves, and water waves."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028ECA","dcterms_educationLevel":[{"prefLabel":"10"}],"text":"(10) Describe the effects of wave interference (constructive and destructive)."}]},{"leaf":false,"text":"1.1.4 Forms of Energy<br /> Analyze the forms of energy in a system, subsystems, or parts of a system.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028ECC","dcterms_educationLevel":[{"prefLabel":"10"}],"text":"(10) Explain the forms of energy present in a system (i.e., thermal energy, sound energy, light energy, electrical energy, kinetic energy, potential energy, chemical energy, and nuclear energy)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028ECD","dcterms_educationLevel":[{"prefLabel":"10"}],"text":"(10) Compare the potential and/or kinetic energy of parts of systems at various locations or times (i.e., kinetic energy is an object's energy of motion, potential energy is an object's energy of position)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028ECE","dcterms_educationLevel":[{"prefLabel":"10"}],"text":"(10) Measure and describe the thermal energy of a system, subsystem, and/or parts of a system in terms of molecular motion (temperature) and energy from a phase change (e.g., observe, measure, and record temperature changes over time while heating ice to boiling water)."}]}]},{"leaf":false,"text":"Earth and Space Systems","children":[{"leaf":false,"text":"1.1.5 Nature and Properties of Earth Materials <br /> Understand physical properties of Earth materials including rocks, soil, water, and air.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028CDA","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"(K) Sort rocks based on size and shape, and other physical properties (e.g., color, texture)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028CDB","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"(2) Illustrate and tell about the properties of water as a solid and liquid."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028CDC","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"(2) Explain how some Earth materials are used by living things (e.g., water and soil for growing plants)."}]},{"leaf":false,"text":"1.1.5 Nature and Properties of Earth Materials<br /> Understand physical properties of Earth materials including rocks, soil, water, and air.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D5C","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"(3) Describe and sort rocks based on physical properties (e.g., color, shape, size, texture)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D5D","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"(3) Describe and sort soils based on physical properties (e.g., color, particle size, ability to retain or drain water, texture, smell, support plant growth, source of nutrients (not food) for plants)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D5E","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"(4) Describe the states of water on Earth (i.e., clouds, fog, dew, rain, hail, snow, ice) as solid, liquid, or gas."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D5F","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"(4) Describe the common conditions or properties of air (i.e., moving, blowing, wind, still, warm, cold, moist, takes up space, has weight)."}]},{"leaf":false,"text":"1.1.5 Understand how to classify rocks, soils, air, and water into groups based on their chemical and physical properties.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E10","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(7) Describe properties of minerals and rocks that give evidence of how they were formed (e.g., crystal size and arrangement, texture, luster, cleavage, hardness, layering, reaction to acid)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E11","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(7) Describe properties of soils that give evidence of how the soils were formed (e.g., chemical composition such as acidic, types of particles, particle size, organic materials, layering)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E12","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(7) Describe how Earth's water (i.e., oceans, fresh water, glaciers, ground water) can have different properties (e.g., salinity, density)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E13","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(7) Describe how the atmosphere has different properties at different elevations."}]},{"leaf":false,"text":"1.1.5 Nature and Properties of Earth Materials<br /> Understand and analyze how the chemical composition of Earth materials (rocks, soil, water, and air) is related to their physical properties.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028ED0","dcterms_educationLevel":[{"prefLabel":"9"}],"text":"(9) Correlate the chemical composition of Earth materials (i.e., rocks, soils, water, and gases of the atmosphere) with their physical properties (e.g., limestone reaction to acid, the conductivity of copper, ice floats on water)."}]}]},{"leaf":false,"text":"Living Systems","children":[{"leaf":false,"text":"1.1.6 Characteristics of Living Matter<br /> Understand characteristics of living organisms","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028CDF","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"(K) Identify observable characteristics of living organisms (e.g., spiders have eight legs, birds have feathers, plants have roots, stems, leaves, seeds, flowers)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028CE0","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"(2) Observe and describe characteristics of living organisms (e.g., spiders have eight legs, birds have feathers, plants have roots, stems, leaves, seeds, flowers)."}]},{"leaf":false,"text":"1.1.6 Characteristics of Living Matter <br /> Understand how to distinguish living from non-living and how to use characteristics to sort common organisms into plant and animal groups. W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D61","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"(4) Describe the characteristics of organisms."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D62","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"(4) Describe and sort organisms using multiple characteristics (e.g., anatomy like fins for swimming or leaves for gathering light, behavior patterns like burrowing or migration, how plants and animals get food differently)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D63","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"(4) Classify and sort common organisms into plant and animal groups."}]},{"leaf":false,"text":"1.1.6 Characterictics of Living Matter<br /> Understand how to classify organisms by their external and internal structures.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E15","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"(6) Describe how organisms can be classified using similarities and differences in physical and functional characteristics (both internal and external)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E16","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"(8) Explain an inference about whether organisms have a biological relationship or common ancestry based on given characteristics."}]},{"leaf":false,"text":"1.1.6 Characteristics of Living Matter<br /> Analyze structural, cellular, biochemical, and genetic characteristics in order to determine the relationships among organisms.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028ED2","dcterms_educationLevel":[{"prefLabel":"10"}],"text":"(10) Analyze the relationship among organisms based on their shared physical, biochemical, genetic, cellular characteristics, and functional processes."}]}]}]},{"leaf":false,"text":"Component 1.2 Structures: Understand how components, structures, organizations, and interconnections describe systems.","children":[{"leaf":false,"text":"Systems Structure","children":[{"leaf":false,"text":"1.2.1 Structure of Physical Earth/Space and Living Systems<br /> Understand that things are made of parts that go together. W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028CE4","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"(K) Identify the parts of objects, organisms, and materials (e.g., toys with moving parts, plants, animals, soils)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028CE5","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"(1) Describe how the parts of objects, organisms, and materials go together."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028CE6","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"(2) Construct simple devices to do common tasks using common materials and explain how the parts depend on each other (e.g., cardboard, wood, clay, rubber bands)."}]},{"leaf":false,"text":"1.2.1 Structure of Physical Earth/Space and Living Systems <br /> Analyze how the parts of a system go together, and how these parts depend on each other. W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D65","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"(3) Identify the parts of a system (e.g., a device, natural or living thing) and how the parts go together."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D66","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"(3) Describe the function of a part of a system (e.g., a device, natural or living thing)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D67","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"(4) Describe a simple system that can perform a task and illustrate how the parts depend on each using common classroom materials."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D68","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"(4) Explain how one part of a system depends upon other parts of the same system."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D69","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"(5) Predict and explain how a system would work if one of its parts was missing or broken."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D6A","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"(5) Describe what goes into (input) and out of (output) a system (e.g., what keeps a system running)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D6B","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"(5) Describe the effect on a system when an input in the system is changed."}]},{"leaf":false,"text":"1.2.1 Structure of Physical Earth/Space and Living Systems<br />  Analyze how the parts of a system interconnect and influence each other.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E19","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"(6) Explain how the parts of a system interconnect and influence each other."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E1A","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(7) Describe the flow of matter and energy through a system (i.e., energy and matter inputs, outputs, transfers, transformations)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E1B","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"(8) Describe the interactions and influences between two or more simple systems."}]},{"leaf":false,"text":"1.2.1 Structure of Physical Earth/Space and Living Systems<br /> Analyze how systems function; including the inputs, outputs, transfers, transformations, and feedback of a system and its subsystems.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028ED4","dcterms_educationLevel":[{"prefLabel":"9"}],"text":"(9) Describe the function of a system's parts or subsystems."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028ED5","dcterms_educationLevel":[{"prefLabel":"9"}],"text":"(9) Explain inputs, outputs, transfers, transformations, and feedback of matter, energy, and information in a system."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028ED6","dcterms_educationLevel":[{"prefLabel":"10"}],"text":"(10) Explain the interconnection between a system's parts or subsystems."}]}]},{"leaf":false,"text":"Physical Systems","children":[{"leaf":false,"text":"1.2.3 Structure of Matter<br /> Know that common materials are made of smaller parts","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028CE9","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"(1) Sort objects based on component parts. (e.g., toys with wheels)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028CEA","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"(2) Understand that people use magnifiers to observe things they cannot see with their eyes."}]},{"leaf":false,"text":"1.2.2 Energy Transfer and Transformation <br /> Understand that energy can be transferred from one object to another and can be transformed from one form of energy to another. W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D6D","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"(4) Identify where or when a part of a simple system has the greatest or least energy (e.g., a toy car has the greatest energy when released from the top of a ramp.)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D6E","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"(4) Describe transfers of energy (e.g., heat energy is transferred from hot water to a cup)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D6F","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"(4) Identify sources of energy in systems (e.g., battery for a flashlight, spring for toy)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D70","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"(4) Describe transformations of energy (e.g., energy of motion of hands clapping changing into sound energy)."}]},{"leaf":false,"text":"1.2.3 Structures of Matter <br /> Know that substances are made of small particles. W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D72","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"(4) Identify small parts of substances as still being that substance (e.g., a drop of water is still water; a speck of sugar is still sugar)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D73","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"(4) Observe that some particles can only be seen with magnification."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D74","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"(4) Describe objects that are made of only one kind of material and objects made of several kinds of material."}]},{"leaf":false,"text":"1.2.2 Energy Transfer and Transformation<br /> Understand how various factors affect energy transfers and that energy can be transformed from one form of energy to another. W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E1D","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"(6) Describe and determine the factors that affect heat energy transfer (e.g., properties of substances/materials [conductors, insulators], distance, direction, position)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E1E","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"(6) Describe how an increase in one type of energy of an object or system results in a decrease in other types of energy within that object or system (e.g., a falling object's potential energy decreases while its kinetic energy increases)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E1F","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"(6) Describe how waves transfer energy (e.g., sunlight transfers energy from sun to Earth through radiation, air transfers an object's vibrations from one place to another as sound."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E20","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"(8) Explain the transfer and transformations of energy within a system (e.g., conduction and convection of heat[thermal] energy)."}]},{"leaf":false,"text":"1.2.3 Structure of Matter<br /> Understand that all matter is made of particles called atoms and that atoms may combine to form molecules and that atoms and molecules can form mixtures.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E22","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"(6) Know that matter is made of particles called atoms and molecules."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E23","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"(6) Know that elements are made of one kind of atom."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E24","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"(8) Describe how atoms may be combined in various ways and numbers to form molecules."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E25","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"(8) Describe the different atoms and molecules in mixtures (e.g., dissolving carbon dioxide in water produces a type of mixture (solution) CO2 and H20 molecules)."}]},{"leaf":false,"text":"1.2.2 Energy Transfer and Transformation<br /> Analyze energy transfers and transformations within a system including energy conservation.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028ED8","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(9) Describe and determine the energy inputted to an object as work (i.e., work on an object is the product of the force acting on the object and the distance the object moves as the force acts)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028ED9","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(9) Describe how a machine transfers work and transforms force and distance through a force-distance trade-off (e.g., a small force acting over a long distance can be transformed to a large force acting over a short distance)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028EDA","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(9) Examine and explain how energy is transferred within and among systems."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028EDB","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(10) Analyze conditions likely to result in transfers or transformations energy from one part of a system to another (e.g., a temperature difference may result in the flow of thermal energy from a hot area to a cold area)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028EDC","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(10) Describe what happens in terms of energy conservation to a system's total energy as energy is transferred or transformed (e.g., energy is never \"lost\", the sum of kinetic and potential energy remains somewhat constant)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028EDD","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(10) Explain the relationship between the motion of particles in a substance and the transfer of thermal energy or transformation of energy (e.g., conduction of thermal energy as molecules collide, convection of thermal energy as groups of molecules move from one place to another, and radiation as waves transform into thermal energy)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028EDE","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(10) Explain how or whether a phase change, or a chemical reaction, or a nuclear reaction absorbs or releases energy in a system (e.g., water vapor forming rain or snow releases energy, water molecules speeding up as they absorb energy until the molecules gain enough energy to become water vapor)."}]},{"leaf":false,"text":"1.2.3 Structure of Matter<br /> Understand the structure of atoms, how atoms bond to form molecules, and that molecules form solutions.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028EE0","dcterms_educationLevel":[{"prefLabel":"10"}],"text":"(10) Describe molecules forming a solution (e.g., salt added to water dissolves, forming a salt water solution, until saturation when no more salt will dissolve)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028EE1","dcterms_educationLevel":[{"prefLabel":"10"}],"text":"(10) Describe how to separate mixtures and/or solutions of several different kinds of substances (e.g., sand, sugar, iron filings)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028EE2","dcterms_educationLevel":[{"prefLabel":"10"}],"text":"(10) Describe the structure of atoms in terms of protons and neutrons forming the nucleus which is surrounded by electrons (e.g., a helium storm usually has a nucleus formed by 2 protons and 2 neutrons which is surrounded by 2 electrons)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028EE3","dcterms_educationLevel":[{"prefLabel":"10"}],"text":"(10) Describe how atoms bond to form molecules in terms of transferring and/or sharing electrons (e.g., sodium atoms transfer an electron to chlorine atoms to form salt)."}]}]},{"leaf":false,"text":"Earth and Space Systems","children":[{"leaf":false,"text":"1.2.5 Components of the Solar System and Beyond (Universe)<br /> Know daily changes of the position of the Sun.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028CED","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"(1) Observe changes in the Sun's position in the sky during the day."}]},{"leaf":false,"text":"1.2.4 Components and Patterns of Earth Systems <br /> Understand that Earth's system includes a mostly solid interior, landforms, bodies of water, and an atmosphere. W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D76","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"(3) Identify land masses, bodies of water, and landforms on a globe or a map (e.g., continents, oceans, rivers, mountains)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D77","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"(5) Describe how one part of Earth's system depends on or connects to another part of Earth's system (e.g., Puget Sound water affects the air over Seattle)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D78","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"(5) Identify and describe various landmasses, bodies of water, and landforms (e.g., illustrate continents, oceans, seas, rivers, mountains, plains from a globe and a map)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D79","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"(5) Consruct a model that demonstrates understanding of Earth's structure as a system made of parts (e.g., solid surface, water, atmosphere)."}]},{"leaf":false,"text":"1.2.5 Components of the Solar System and Beyond (Universe)<br /> Know how the Sun, Moon, and stars appear from Earth.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D7B","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"(4) Describe the daily motion of the Sun, Moon and stars as seen from Earth's surface (e.g., the Sun, the Moon and the stars all rise in the east and set in the west)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D7C","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"(4) Describe how the moon looks a little different every day as seen from Earth (e.g., the lighted portion of the moon changes shape every day)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D7D","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"(4) Describe how the patterns of stars in the sky stay the same as seen from Earth (e.g., constellations like the Orion always have the same pattern)."}]},{"leaf":false,"text":"1.2.4 Components and Patterns of Earth Systems<br /> Understand the components and interconnections of Earth's systems.w","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E27","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(7) Describe the components of the Earth's systems (i.e., the core, the mantle, oceanic and crustal plates, landforms, the hydrosphere and atmospheric crust, atmosphere, and hydrosphere)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E28","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(7) Describe the interactions among the components of Earth's systems (i.e., the core, the mantle, oceanic and crustal plates, landforms, atmosphere crust, atmosphere, and hydrosphere)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E29","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(7) Describe magma (i.e., magma comes from Earth's mantle and cools to form rocks)."}]},{"leaf":false,"text":"1.2.5 Components of the Solar System and Beyond (Universe)<br /> Understand the structure of the solar system.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E2B","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"(6) Describe how the Earth orbits the sun and the moon orbits the earth."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E2C","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"(6) Describe the sun (i.e., a medium size star, the largest body in our solar system, major source of energy for phenomena on Earth's surface}."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E2D","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"(6) Describe how planets, asteroids, comets orbit the sun."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E2E","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"(6) Describe meteors (e.g., planetary and comet debris that collides with Earth)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E2F","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"(8) Compare the relationships among the components of the solar system (e.g., composition, size, atmosphere, gravity, distance from the sun, number of moons)."}]},{"leaf":false,"text":"1.2.4 Components and Patterns of Earth Systems<br /> Analyze the patterns and arrangements of Earth systems and subsystems including the core, the mantle, tectonic plates, the hydrosphere, and layers of the atmosphere.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028EE5","dcterms_educationLevel":[{"prefLabel":"9"}],"text":"(9) Identify and describe sources of Earth's internal and external thermal energy."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028EE6","dcterms_educationLevel":[{"prefLabel":"9"}],"text":"(9) Explain how plate tectonics is caused by Earth's internal energy (e.g., radioactivity in the core causes convection in the mantle that moves tectonic plates)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028EE7","dcterms_educationLevel":[{"prefLabel":"9"}],"text":"(9) Correlate Earth's surface features to observeable weather patterns (e.g., rain shadow, deserts, rain forest)."}]},{"leaf":false,"text":"1.2.5 Components of the Solar System and Beyond (Universe)<br /> Understand that the solar system is in a galaxy in a universe composed of an immense number of stars and other celestial bodies.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028EE9","dcterms_educationLevel":[{"prefLabel":"10"}],"text":"(10) Describe how the solar system is part of the Milky Way Galaxy."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028EEA","dcterms_educationLevel":[{"prefLabel":"10"}],"text":"(10) Compare how stars and other celestial bodies (at least 100 billion) are similar and different from each other (i.e., size, composition, distance from the Earth, temperature, age, source of light, and movement in space)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028EEB","dcterms_educationLevel":[{"prefLabel":"10"}],"text":"(10) Describe how other galaxies and other celestial bodies appear from Earth."}]}]},{"leaf":false,"text":"Living Systems","children":[{"leaf":false,"text":"1.2.6 Structure and Organization of Living Systems<br /> Know that living things are made of small parts.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028CF0","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"(K) Observe how living things look different under a magnifier."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028CF1","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"(2) Observe and identify the parts of an object seen under a magnifier."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028CF2","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"(2) Illustrate or draw the small parts that make up the whole living thing."}]},{"leaf":false,"text":"1.2.7 Molecular Basis of Heredity<br /> Understand that plants and animals have life cycles.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028CF4","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"(2) Observe and describe the life cycle of a plant or animal (e.g., describe the life cycle of a butterfly- egg, caterpillar or larva, cocoon, and butterfly or adult)"}]},{"leaf":false,"text":"1.2.8 Human Biology<br /> Know the external parts of the body","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028CF6","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"(1) Identify the external parts of the body (e.g., head, hands, fingers, eyes, ears)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028CF7","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"(1) Draw and name the external parts of the body."}]},{"leaf":false,"text":"1.2.6 Structure and Organization of Living Systems <br /> Understand that organisms can be a single cell or many cells that form parts with different functions. W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D7F","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"(3) Observe with a microscope that living things are made mostly of cells (i.e., plants, animals, and single celled organism)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D80","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"(3) Describe how plant and animal cells are similar and different."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D81","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"(3) Describe the life function of a part of a living thing (e.g., wings of a bird)."}]},{"leaf":false,"text":"1.2.7  Molecular Basis of Heredity <br /> Understand the life cycles of plants and animals, and the differences between inherited and acquired characteristics. W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D83","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"(3) Observe and describe the life cycles of a plant or animal."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D84","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"(3) Describe that the young of plants and animals grow to resemble their parents as they mature into adults."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D85","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"(3) Describe inherited characteristics (e.g. leaf shape, eye color) and learned characteristics (e.g., language, social customs)."}]},{"leaf":false,"text":"1.2.8 Human Biology <br /> Understand the organization and function of human body structures and organs and how those structures and organs interconnect. W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D87","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"(4) Recognize, explain and give examples of human systems that are composed of organs (e.g., ear for hearing, mouth for speech)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D88","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"(4) Describe the functions of major organs (e.g., the skin protects the human body from harmful substances, unhealthy organisms, and from drying out; the brain gets signals from the parts of the human body, controls the life functions, and sends signals out to the body parts)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D89","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"(4) Describe the interdependence of organ systems in the human body (e.g., what would happen if one part of the human body system was missing)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D8A","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"(4) Describe how the systems allow the human body to take in and use nutrients (air, food, water) for living, growth, and repair (e.g., breath in air uses the oxygen in order to live)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D8B","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"(4) Identify or describe how the human body systems compare to the systems of other living organisms (e.g. Human ear compared to an elephant for hearing sound)."}]},{"leaf":false,"text":"1.2.6 Structure and Organization of Living Systems<br /> Understand that specialized cells within multi-cellular organisms form different kinds of tissues, organs, and organ systems to carry out life functions.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E31","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"(6) Describe and identify how plant and animal cells are similar and different in structure and function."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E32","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"(6) Describe basic cell functions (i.e., extracting energy from food, using energy, and getting rid of waste)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E33","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"(8) Describe the life function of specialized cells or tissues (e.g., blood cells are different from bone cells, leaf tissues capture the energy from sunlight)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E34","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"(8) Describe the life function of organs or organ systems (e.g., the stomach breaks down food and the intestines absorb food in the digestive system)."}]},{"leaf":false,"text":"1.2.7 Molecular Basis of Heredity<br /> Understand that organisms pass on genetic information in their life cycle and that an organism's characteristics are determined by both genetic and environmental influences.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E36","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"(6) Explain that organisms require a set of instructions for specifying their traits. (i.e., heredity is the passage of these instructions from one generation to another)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E37","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"(6) Describe that genes inherited from parents are combined in their offspring to produce a new combination of characteristics."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E38","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"(8) Explain how physical characteristics of living things can be affected by genetic information and/or by interactions with the environment (e.g., nutrition, disease, sanitation)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E39","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"(8) Describe and compare sexual (two parents) and asexual (one parent) life cycles of plants and animals."}]},{"leaf":false,"text":"1.2.8 Human Biology<br /> Understand human life functions and the interconnecting organ systems necessary to maintain human life.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E3B","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"(6) Describe the components and functions of the organ systems (i.e., circulatory, digestive, reproductive, excretory, nervous-sensory [brain, nerves, spinal cord, hearing, vision], respiratory, and muscular-skeletal systems)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E3C","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"(8) Describe relationships among the organ systems of the human body (e.g., the role of the senses and the nervous system for human survival, the relationships between the digestive and excretory systems)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E3D","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"(8) Compare human body systems to another organism's body system (e.g., human lungs to plant leaves)."}]},{"leaf":false,"text":"1.2.6 Structure and Organization of Living Systems<br /> Understand cellular structures, their functions, and how specific genes regulate these functions.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028EED","dcterms_educationLevel":[{"prefLabel":"10"}],"text":"(10) Describe cellular structures that allow cells to extract and use energy from food, eliminate wastes, and respond to the environment (e.g., every cell is covered by a membrane that controls what goes into and out of cell)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028EEE","dcterms_educationLevel":[{"prefLabel":"10"}],"text":"(10) Describe how DNA molecules are long chains linking four kinds of smaller molecules, whose sequence encodes genetic information."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028EEF","dcterms_educationLevel":[{"prefLabel":"10"}],"text":"(10) Describe how genes (DNA segments) provide instructions for assembling protein molecules in cells."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028EF0","dcterms_educationLevel":[{"prefLabel":"10"}],"text":"(10) Describe how proteins control life functions (e.g., the proteins myosin and actin interact to cause muscular contraction; the protein hemoglobin carries oxygen in some organisms)."}]},{"leaf":false,"text":"1.2.7 Molecular Basis of Heredity<br /> Understand how genetic information (DNA) in the cell is encoded at the molecular level and provides genetic continuity between generations.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028EF2","dcterms_educationLevel":[{"prefLabel":"10"}],"text":"(10) Describe the role of chromosomes in reproduction (i.e., parents pass on chromosomes, which contain genes, to their offspring)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028EF3","dcterms_educationLevel":[{"prefLabel":"10"}],"text":"(10) Describe the possible results from mutation in DNA (e.g., only mutations in sex cells can be passed to offspring, mutations in other cells can only be passed to descendant cells)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028EF4","dcterms_educationLevel":[{"prefLabel":"10"}],"text":"(10) Describe how organisms pass on genetic information via asexual life cycles (i.e., the replication of genes in asexual reproduction results in the same gene combinations in the offspring as those of the parents)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028EF5","dcterms_educationLevel":[{"prefLabel":"10"}],"text":"(10) Describe how organisms pass on genetic information via sexual life cycles (i.e., the sorting and the recombination of genes in sexual reproduction results in a great variety of gene combinations and resultant variations in the offspring of any two parents)."}]},{"leaf":false,"text":"1.2.8 Human Biology<br /> Analyze how the human organ systems regulate growth, development, and life functions.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028EF7","dcterms_educationLevel":[{"prefLabel":"10"}],"text":"(10) name the structural and functional characteristics of human organ systems including the endocrine, immune, nervous, reproductive, and skin systems."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028EF8","dcterms_educationLevel":[{"prefLabel":"10"}],"text":"(10) Describe how the human body maintains a relatively constant internal conditions (e.g., temperature, acidity, and blood sugar)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028EF9","dcterms_educationLevel":[{"prefLabel":"10"}],"text":"(10) Explain how human organ systems help maintain human health."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028EFA","dcterms_educationLevel":[{"prefLabel":"10"}],"text":"(10) Describe the role of human organ systems during human growth and development."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028EFB","dcterms_educationLevel":[{"prefLabel":"10"}],"text":"(10) Compare the structure and function of a human body system or subsystem to a non-living system (e.g., human joints to hinges, enzyme and substrate to interlocking puzzle pieces)."}]}]}]},{"leaf":false,"text":"Component 1.3 Changes: Understand how interactions within and among systems cause changes in matter and energy.","children":[{"leaf":false,"text":"Physical Systems","children":[{"leaf":false,"text":"1.3.1 Nature of Force<br /> Know that a push or a pull is a force on an object but some forces can act without touching an object","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028CFB","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"(1) Observe a push or a pull on an object is a force on that object."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028CFC","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"(1) Observe that a magnet can push or pull some objects without touching the object."}]},{"leaf":false,"text":"1.3.2 Forces to Explain Motion<br /> Know that pushes and pulls can change the motion of common objects. W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028CFE","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"(1) Observe that objects fall toward the ground because of the pull of the Earth's gravity."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028CFF","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"(1) Observe that magnets can make some objects move without touching the object."}]},{"leaf":false,"text":"1.3.3 Conservation of Matter and Energy<br /> Know that water can exist in different states: solid and liquid.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D01","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"(2) Observe water changing from solid to liquid."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D02","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"(2) Describe the physical properties of water in solid and liquid states (e.g., hard, cold, wet)."}]},{"leaf":false,"text":"1.3.1 Nature of Force <br /> Understand forces in terms of strength and direction. W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D8D","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"(3) Describe a force that is acting on an object in terms of strength and direction (e.g., electrical force, gravitional force, magnetic force, a push, or a pull)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D8E","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"(3) Measure the force acting on an object with a spring scale calibrated in Newtons."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D8F","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"(5) Compare the strength of one force to the strength of another force (e.g., measure a 5-Newton pull from a spring scale is like the weight of a 1 pound object)."}]},{"leaf":false,"text":"1.3.2 Forces to Explain Motion <br /> Understand that forces can change the motion of common objects. W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D91","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"(3) Investigate and report how the position and motion of objects can be changed by a force."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D92","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"(5) Investigate and report how a larger force acting on an object causes a greater change in motion of that object, 2nd Law of Motion (e.g., a 2 Newton pull causes a toy car to speed up more than a 1 Newton Force"}]},{"leaf":false,"text":"1.3.3 Conservation of Matter and Energy<br /> Understand that a substance remains the same substance when changing state.  Understand that two or more substances can react to become new substances. W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D94","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"(4) Observse and describe water changing state from ice to liquid water to water vapor and back (e.g., with freezing, melting, evaporation, and condensation water remains water)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D96","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"(5) Observe and describe how a substance is the same substance before and after heating or cooling (e.g., solid candle wax can be heated to become liquid candle wax then cooled back to the same solid candle wax)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D97","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"(5) Describe how two different substances can form a simple chemical reaction to produce new substances (e.g., baking soda can vinegar react to form a gas)."}]},{"leaf":false,"text":"1.3.1 Nature of Force<br /> Understand factors that affect the strength and direction of forces.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E3F","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(7) Observe and describe factors that affect the strength of forces (e.g., an object with a greater mass has a greater gravitational force (weight), certain types of magnets have greater magnetic forces, a larger muscle can pull with a greater force)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E40","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(7) Describe how forces acting on an object may balance each other (e.g., the downward force of gravity on an object sitting on a table is balanced by an upward force from the table)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E41","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(7) Measure and describe how a simple machine can change the strength and/or direction of a force (i.e., levers and pulleys)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E42","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(7) Describe pressure as a force (e.g., pressure increases result in greater forces acting on objects going deeper in a body of water)."}]},{"leaf":false,"text":"1.3.2 Forces to Explain Motion<br /> Understand how balanced and unbalanced forces can change the motion of objects.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E44","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(7) Describe how an unbalanced force changes the speed and/or direction of motion of different objects moving along a straight line, 2nd Law of Motion (e.g., a larger unbalanced force is needed to equally change the motion of more massive objects)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E45","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(7) Describe how frictional forces act to stop the motion of objects."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E46","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(7) Investigate and describe the balanced and unbalanced forces acting on an object (e.g., a model car speeding up on a table has both an unbalanced force pulling it forward and a gravitational force pulling it down balanced by the table pushing upward)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E47","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(7) Investigate and describe pressure differences that result in unbalanced forces moving objects (e.g., pressure differences cause forces that move air masses, blood moving through the heart, cause volcanic eruptions)."}]},{"leaf":false,"text":"1.3.3 Conservation of Matter and Energy<br /> Understand that matter is conserved during physical and chemical changes.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E49","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(7) Observe and describe evidence of physical and chemical changes of matter (e.g., change of state, size, shape, temperature, color, gas production, solid formation, light)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E4A","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(7) Observe and describe that substances undergoing physical changes produce matter with the same chemical properties as the original substance and the same total mass (e.g., tearing paper, freezing water, breaking wood, sugar dissolving in water)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E4B","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(7) Observe and describe that substances may react chemically to form new substances with different chemical properties and the same total mass (e.g., baking soda and vinegar, light stick mass before, during, and afyer reaction)."}]},{"leaf":false,"text":"1.3.1 Nature of Force<br /> Analyze the forces acting on objects.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028EFD","dcterms_educationLevel":[{"prefLabel":"9"}],"text":"(9) Describe how machines transform forces (e.g., a long lever allows a small downward input force to be transformed into a large upward output force)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028EFE","dcterms_educationLevel":[{"prefLabel":"9"}],"text":"(9) Describe the strength (in Newtons) and direction of forces acting on an object."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028EFF","dcterms_educationLevel":[{"prefLabel":"9"}],"text":"(9) Measure and describe the sum of all the forces acting on an object."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F00","dcterms_educationLevel":[{"prefLabel":"9"}],"text":"(9) Describe how forces between objects occur, both when the objects are touching and when the objects are apart."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F01","dcterms_educationLevel":[{"prefLabel":"9"}],"text":"(9) Explain that the strength of a gravitational force between two objects depends on the mass of the objects and the distance between the objects."}]},{"leaf":false,"text":"1.3.2 Forces to Explain Motion<br /> Analyze the effects of balanced and unbalanced forces on the motion of an object.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F03","dcterms_educationLevel":[{"prefLabel":"9"}],"text":"(9) Describe the balanced forces acting on an object moving at a constant speed along a straight line, 1st Law of Motion (e.g., a car traveling at a constant speed of 60 mph on the straight freeway has a force pushing it forward balanced by frictional forces acting in the opposite direction)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F04","dcterms_educationLevel":[{"prefLabel":"9"}],"text":"(9) Explain how unbalanced forces change the speed and/or direction of motion of difference objects moving along a straight line, 2nd Law of Motion (e.g., an 2-kg object needs twice the unbalanced force to speed up the same amount as a 1-kg object)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F05","dcterms_educationLevel":[{"prefLabel":"9"}],"text":"(9) Investigate and describe that forces always come in pairs, 3rd Law of Motion (e.g., pull a spring scale against another spring scale, as water blasts out of a bottle rocket two forces act as a force on the water and an equal force on the rocket)."}]},{"leaf":false,"text":"1.3.3 Conservation of Matter and Energy<br /> Analyze the factors that affect physical, chemical, and nuclear changes and understand that matter and energy are conserved.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F07","dcterms_educationLevel":[{"prefLabel":"9"}],"text":"(9) Investigate and analyze the effect of different factors upon the rate of a physical and chemical change (e.g., temperature, surface area, pressure, catalysts)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F08","dcterms_educationLevel":[{"prefLabel":"9"}],"text":"(9) Explain how chemical changes produce substances with different chemical properties and the same total mass."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F09","dcterms_educationLevel":[{"prefLabel":"9"}],"text":"(9) Describe the products of radioactive decay in terms of the conservation of matter and energy (e.g., a radioactive nucleus decays into a new nucleua and emits particles and rays)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F0A","dcterms_educationLevel":[{"prefLabel":"9"}],"text":"(9) Know that the rate of radioactive decay of a substance is constant, not affected by any factors (e.g., the half-life of a radioactive substance is constant over a long time and a wide range of conditions found on Earth)."}]}]},{"leaf":false,"text":"Earth and Space Systems","children":[{"leaf":false,"text":"1.3.4 Processes and Interactions in the Earth System<br /> Knows that rocks break down to form pebbles and sand.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D05","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"(2) Describe how rocks can break down into smaller pieces (e.g., pebbles and sand) by the action of water."}]},{"leaf":false,"text":"1.3.5 History and Evolution of the Earth<br /> Know that fossils provide evidence of plants, animals that existed long ago.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D07","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"(2) Identify a fossil in a rock."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D08","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"(2) Compare fossils (that represent the remains of prehistoric plants and animals) with similar living organisms (e.g., a fossil leaf with a leaf, a fossil shell with a shell)."}]},{"leaf":false,"text":"1.3.6 Hydrosphere and Atmosphere<br /> Know common weather indicators and understand that weather conditions change from season to season.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D0A","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"(1) Observe, measure, and record weather conditions, noting changes and patterns from day to day and over the seasons (e.g., temperature, wind, rain, snow)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D0B","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"(1) Name common weather conditions (e.g., rain, snow, wind)."}]},{"leaf":false,"text":"1.3.4 Processes and Interactions in the Earth System<br /> Know processes that change the surface of the Earth. W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D99","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"(5) Describe how weathering and erosion change the surface of the Earth."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D9A","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"(5) Describe how earthquakes, landslides, and volcanic eruptions change Earth's surface."}]},{"leaf":false,"text":"1.3.5 History and Evolution of the Earth<br /> Understand that fossils provide evidence of plants, animals, and environments that existed long ago. W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D9C","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"(5) Observe and describe a fossil in a rock."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D9D","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"(5) Know that fossils provide evidence about plants and animals that lived long ago and the nature of the environment at that time."}]},{"leaf":false,"text":"1.3.6 Hydrosphere and Atmosphere<br /> Understand weather indicators and understand how water cycles through the atmosphere.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D9F","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"(3) Observe, measure, and describe weather indicators (i.e., temperature, wind direction and speed, precipitation), noting changes and patterns of change from day-to-day and over the year."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DA0","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"(3) Describe the weather patterns of each season."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DA1","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"(5) Describe the effects of water cycling through the land, oceans, and atmosphere (e.g., clouds, rain, snow, hail, rivers)."}]},{"leaf":false,"text":"1.3.7 Interactions in the Solar System and Beyond (Universe)<br /> Know how the appearance of the Sun, Moon, and stars changes as seen from Earth.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DA3","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"(4) Describe how the Sun rises and sets at different places and times every day in a yearly pattern."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DA4","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"(4) Describe how the appearance of the Moon changes in a predictable pattern (e.g., new Moon to full Moon every 28 days)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DA5","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"(4) Describe how stars patterns are different at different times of the year as seen from Earth (e.g., constellations like the Orion cannot always be seen during the course of a year)."}]},{"leaf":false,"text":"1.3.4 Processes and Interactions in the Earth System<br /> Understand the processes that continually change the surface of the Earth.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E4D","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(7) Describe the processes by which soils are formed (e.g., erosion and deposition in river systems)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E4E","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(7) Describe how heat (thermal) energy flow and movement (convection currents) beneath Earth's crust cause earthquakes and volcanoes."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E4F","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(7) Describe how constructive processes change landforms (e.g., crustal deformation, volcanic eruption, deposition of sediment)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E50","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(7) Describe how destructive processes change landforms (e.g., rivers erode landforms)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E51","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(7) Describe the processes involved in the rock cycle that (e.g., magma cools into igneous rocks, rocks are eroded and deposited as sediments, sediments solidify into sedimentary rocks, rocks can be changed by heat and pressure to form metamorphic rocks)."}]},{"leaf":false,"text":"1.3.5 History and Evolution of the Earth<br /> Understand how fossils and other evidence are used to document life and environmental changes over time. W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E53","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(7) Describe how fossils are formed."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E54","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(7) Describe different kinds of evidence that are used to document past conditions on Earth (e.g., glacial markings, ash layers, tree rings, rock layers)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E55","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(7) Describe how fossils and other artifacts provide evidence of how life has changed over time (e.g., extinction of species)."}]},{"leaf":false,"text":"1.3.6 Hydrosphere and Atmosphere<br /> Analyze the relationship between weather and climate, and how ocean currents and global atmospheric circulation affect weather and climate.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E57","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(7) Compare weather and climate."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E58","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(7) Explain the effect of the water cycle on weather (e.g., cloud formation, storms)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E59","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(7) Explain how ocean currents influence the atmosphere in terms of weather and climate."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E5A","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(7) Explain the causes of atmospheric circulation and oceanic currents (e.g., prevailing winds are the result of hot tropical regions, cold Polar Regions, and Earth's spin)."}]},{"leaf":false,"text":"1.3.7 Interactions in the Solar System and Beyond (Universe)<br /> Understand the effects of the regular and predictable motions of planets and moons in the solar system.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E5C","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"(6) Describe the causes of seasonal changes on Earth and other planets (i.e. Earth's tilt causes different parts of Earth to point toward the Sun at different tmes of the year)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E5D","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"(6) Describe the effects of the position of the Sun and Moon on Earth phenomena (i.e., moon phases, solar and lunar eclipses, shadows on Earth."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E5E","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"(8) Describe how the spin of Earth and other planets accounts for the length of a day on those planets."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E5F","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"(8) Describe how the orbit around the Sun of Earth and other planets accounts for the length of the length of a year on those planets."}]},{"leaf":false,"text":"1.3.4 Processes and Interactions in the Earth System<br /> Analyze processes that have caused changes to the features of Earth's surface including plate tectonics.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F0C","dcterms_educationLevel":[{"prefLabel":"9"}],"text":"(9) Describe the processes that cause the movement of material in Earth's systems (e.g., pressure differences that cause convection resulting in winds, mantle movement, and ocean currents; erosion and deposition)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F0D","dcterms_educationLevel":[{"prefLabel":"9"}],"text":"(9) Describe the effects of glaciation and floods on the Pacific Northwest."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F0E","dcterms_educationLevel":[{"prefLabel":"9"}],"text":"(9) Describe the causes and effects of volcanoes, hot spots, and earthquakes in Washington State and elsewhere (e.g., subduction of the Juan de Fuca plate causes earthqquakes that may cause seismic sea waves, earthquakes along the Seattle fault cause P, S, and surface seismic waves)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F0F","dcterms_educationLevel":[{"prefLabel":"9"}],"text":"(9) Explain how substances change as they move through Earth's systems (e.g., carbon cycle, nitrogen cycle, burning of wood and fossil fuels)."}]},{"leaf":false,"text":"1.3.5 History and Evolution of the Earth<br /> Analyze a variety of evidence, including rock formations, fossils, and radioactive decay to contruct a sequence of geologic events.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F11","dcterms_educationLevel":[{"prefLabel":"9"}],"text":"(9) Explain how decay rates of radioactive isotopes in rock layers are used to establish the age of fossil remains or the time of geologic events."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F12","dcterms_educationLevel":[{"prefLabel":"9"}],"text":"(9) Describe how rock formations can be used to determine the nature of past geologic events."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F13","dcterms_educationLevel":[{"prefLabel":"9"}],"text":"(9) Correlate evidence of geologic events to the relative and absolute dates of rock layers to construct a sequence of the history of Earth."}]},{"leaf":false,"text":"1.3.6 Hydrosphere and Atmosphere<br /> Analyze the factors that influence weather and climate.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F15","dcterms_educationLevel":[{"prefLabel":"9"}],"text":"(9) Explain how energy transfers and tranformations among the atmosphere, hydrosphere, and landforms affect climate and weather patterns."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F16","dcterms_educationLevel":[{"prefLabel":"9"}],"text":"(9) Explain how greenhouse gases in the atmosphere affect climate (e.g., global warming)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F17","dcterms_educationLevel":[{"prefLabel":"9"}],"text":"(9) Describe how catastrophic events (e.g., volcanic eruptions, forest fires, asteroid impacts) can cause climate and weather changes."}]},{"leaf":false,"text":"1.3.7 Interactions n the Solar System and Beyond (Universe)<br /> Understand how stars, solar systems, galaxies, and the universe were formed and how these systems continue to evolve.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F19","dcterms_educationLevel":[{"prefLabel":"10"}],"text":"(10) Explain phenomena caused by the regular and predictable motions of planets and moons in the solar system."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F1A","dcterms_educationLevel":[{"prefLabel":"10"}],"text":"(10) Describe how the Solar System formed."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F1B","dcterms_educationLevel":[{"prefLabel":"10"}],"text":"(10) Describe that the Solar System is part of the Milky Way Galaxy and how the Milky Way and other galaxies appear from Earth."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F1C","dcterms_educationLevel":[{"prefLabel":"10"}],"text":"(10) Describe the formation and life cycle of stars."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F1D","dcterms_educationLevel":[{"prefLabel":"10"}],"text":"(10) Describe the properties of different stars (e.g., size, temperature, age, formation, energy production)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F1E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(10) Describe how the Big Bang theory explains the observed properties of the universe (e.g., expansion, evolution, structures, element generation by fusion)."}]}]},{"leaf":false,"text":"Living Systems","children":[{"leaf":false,"text":"1.3.8 Life Processes and the Flow of Matter and Energy<br /> Know that most living things need food, water, and air.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D0E","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"(1) Observe that most living things need water, food, and air."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D0F","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"(1) Observe that plants need light."}]},{"leaf":false,"text":"1.3.9 Biological Evolution<br /> Know that fossils show how organisms looked long ago.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D11","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"(2) Observe fossils similar to living organisms (leaves, shells)."}]},{"leaf":false,"text":"1.3.8 Life Processes and the Flow of Matter and Energy<br /> Understand that living things need constant energy and matter.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DA7","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"(3) Identify sources of energy and matter used by plants to grow and sustain life (e.g., air, water, light, food, nutrients)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DA8","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"(4) Identify sources of energy and matter used by animals to grow and sustain life (e.g., air, water, light, food, nutrients)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DA9","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"(5) Explain how plants and animals obtain food (e.g., plants make food from air, water and sunlight, nutrients; animals obtain food from other living things)."}]},{"leaf":false,"text":"1.3.10 Interdependence of Life<br /> Understand that an organism's ability to survive is influenced by the organism's behavior and the ecosystem in which it lives.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DAF","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"(3) Describe the characteristics of organisms that allow them to survive in an ecosystem."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DB0","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"(3) Describe the role of an organism in a food chain of an ecosystem (i.e., predator, prey, consumer, producer, decomposer, scavenger)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DB1","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"(5) Describe how an organism's ability to survive is affected by a change in an ecosystem (e.g., the loss of one organism in a food chain affects all other organisms in that food chain)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DB2","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"(5) Describe the path of substances (i.e., air, water, nutrients) through a food chain."}]},{"leaf":false,"text":"1.3.9 Biological Evolution<br /> Understand that plant and animal species change over time.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DAB","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"(5) Know that some kinds of plants and animals survive well, some survive less well, and some cannot survive at all in particular environments."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DAC","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"(5) Know that individual plants and animals of the same kind differ in their characteristics and sometimes the difference gives individuals an advantage in surviving and reproducing."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DAD","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"(5) Know that fossils can be compared to one another and to living organisms according to their similarities and differences.  Some organisms that lived long ago are similar to existing organisms, but some are quite different."}]},{"leaf":false,"text":"1.3.8 Life Processes and the Flow of Matter and Energy<br /> Understand how individual organisms, including cells, obtain matter and energy for life processes. W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E61","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(7) Describe the different sources of matter and energy required for life processes in plants and animals (e.g., seeds have energy for germination but plants need light for energy)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E62","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(7) Describe how organisms acquire materials needed for life processes."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E63","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(7) Describe how systems interact to distribute materials and eliminate wastes produced by life processes."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E64","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(7) Describe that both plants and animals extract energy from food, but plants produce their own food from light, air, water, and nutrients; while animals consume energy-rich foods."}]},{"leaf":false,"text":"1.3.9 Biological Evolution<br /> Understand how the theory of biological evolution accounts for species diversity, adaptation, natural selection, extinction, and change in species over time. W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E66","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(7) Describe how fossils show that extinction is common and that most organisms that lived long ago have become extinct."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E67","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(7) Describe how individual organisms with certain traits are more likely than others to survive and have offspring (i.e., natural selection, adaptation)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E68","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(7) Describe how biological evolution accounts for the diversity of species developed through gradual processes over many generations."}]},{"leaf":false,"text":"1.3.10 Interdependence of Life<br /> Understand how organisms in ecosystems interact with and respond to their environment and other organisms.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E6A","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(7) Describe how energy flows through a food chain or web."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E6B","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(7) Describe how substances such as air, water, and nutrients are continually cycled in ecosystems."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E6C","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(7) Explain the role of an organism in an ecosystem (e.g., predator, prey, consumer, producer, decomposer, scavenger, carnivore, herbivore, omnivore)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E6D","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(7) Describe how a population of an organism responds to a change in its environment."}]},{"leaf":false,"text":"1.3.8 Life Processes and the Flow of Matter and Energy<br /> Understand how organisms, including cells, use matter and energy to sustain life and that these processes are complex, integrated, and regulated.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F20","dcterms_educationLevel":[{"prefLabel":"9"}],"text":"(9) Describe how organisms sustain life by obtaining, transporting, transforming, releasing, and eliminating matter and energy."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F21","dcterms_educationLevel":[{"prefLabel":"9"}],"text":"(9) Describe how energy is transferred and transformed from the Sun to energy-rich molecules during photosynthesis."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F22","dcterms_educationLevel":[{"prefLabel":"9"}],"text":"(9) Describe how individual cells break down energy-rich molecules to provide energy for cell functions."}]},{"leaf":false,"text":"1.3.10 Interdependence of Life<br /> Analyze the living and non-living factors that affect organisms in ecosystems.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F28","dcterms_educationLevel":[{"prefLabel":"9"}],"text":"(9) Describe how matter and energy are transferred and cycled through ecosystems (i.e., matter and energy move from plants to herbivores/omnivores to carnivores and decomposers)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F29","dcterms_educationLevel":[{"prefLabel":"9"}],"text":"(9) Compare different ecosystems in terms of the cycling of matter and flow of energy."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F2A","dcterms_educationLevel":[{"prefLabel":"9"}],"text":"(9) Describe how population changes cause changes in the cycles in the cycle of matter and the flow of energy in ecosystems."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F2B","dcterms_educationLevel":[{"prefLabel":"9"}],"text":"(9) Describe the living and non-living factors that limit the size and affect the health of a population in an ecosystem."}]},{"leaf":false,"text":"1.3.9 Biological Evolution<br /> Analyze the scientific evidence used to develop the theory of biological evolution and the concepts of natural selection, speciation, adaptation, and biological diversity.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F24","dcterms_educationLevel":[{"prefLabel":"10"}],"text":"(10) Describe the factors that drive natural selection (i.e., overproduction of offspring, genetic variability of offspring, finite supply of resources, competition for resources, and differential survival)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F25","dcterms_educationLevel":[{"prefLabel":"10"}],"text":"(10) Describe how natural selection and adaptation leads to organisms well suited for survival in particular environments."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F26","dcterms_educationLevel":[{"prefLabel":"10"}],"text":"(10) Describe the degree of evolutionary relationship between organisms based on biochemical, genetic, anatomical, fossil record similarities and differences."}]}]}]}]},{"leaf":false,"text":"EALR 2--INQUIRY: The student knows and applies the skills, and processes, and nature of scientific inquiry","children":[{"leaf":false,"text":"Component 2.1 Investigating Systems: Develop the knowledge and skills necessary to do scientific inquiry.","children":[{"leaf":false,"text":"Investigating Systems","children":[{"leaf":false,"text":"2.1.1 Questioning<br /> Understand how to ask a question about objects, organisms and events in the environment.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D1A","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"(K, 1, 2) Ask questions about objects, organisms and events based on observations of the natural world."}]},{"leaf":false,"text":"2.1.2 Planning and Conducting Safe Investigations <br /> Understand how to plan and conduct simple investigations following all safety rules","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D1C","dcterms_educationLevel":[{"prefLabel":"1"},{"prefLabel":"2"}],"text":"(1, 2) Make observations about characteristics or properties."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D1D","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"(2) Make predictions of the results of an investigation."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D1E","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"(2) Plan and conduct an observational investigation that collects information about characteristics or properties."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D1F","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"(2) Collect data using simple equipment and tools that extend the senses (e.g., magnifiers, rulers, balances, scales, and thermometers)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D20","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"(K, 1, 2) Follow all safety rules during investigations."}]},{"leaf":false,"text":"2.1.3 Explaining <br /> Understand how to construct a reasonable explanation using evidence.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D22","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"(2) Categorize and order observational data from multiple trials."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D23","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"(2) Explain an event or phenomena using observations as evidence (e.g., shape, texture, size, weight, color, motion and/or other physical properties)."}]},{"leaf":false,"text":"2.1.4 Modeling <br /> Understand that models represent real objects, events, or processes.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D25","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"(2) Describe how a model (e.g., diagram or map and/or physical model) of something is similar to the real thing such as an object, event, or process, and how it is different (e.g., size, shape, color)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D27","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"(2) Create a simple model (e.g., diagram or map and/or physical model) of a common object, event, or process."}]},{"leaf":false,"text":"2.1.5 Communicating<br /> Understand how to report investigations and explanations of objects, events, systems, and processes.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D29","dcterms_educationLevel":[{"prefLabel":"1"},{"prefLabel":"2"}],"text":"(1, 2) Describe and or draw the materials used in the investigation (e.g., numbers, shapes, colors)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D28","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"(K, 1, 2) Report observations of simple investigations using drawings and simple sentences."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D2A","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"(K, 1, 2) Report safety procedures used during the investigation."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D2B","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"(2) Report the process used and results of the investigation (e.g., verbal, visual, written, and/or mathematical formats)."}]},{"leaf":false,"text":"2.1.1 Questioning<br /> Understand how to ask a question about objects, organisms and events in the environment.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DB4","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"(3,4,5) Recognize the question being answered in an investigation."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DB5","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"(3,4,5) Ask questions about objects, organisms and events based on observations of the natural world."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DB6","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"(5) Develop a new question that can be investigated with the same materials and/or data as a given investigation."}]},{"leaf":false,"text":"2.1.2 Planning and Conducting Safe Investigations<br /> Understand how to plan and conduct simple investigations following all safety rules.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DB8","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"(3,4,5) Make predictions of the results of an investigation."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DB9","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"(5) Generate a logical plan for, and conduct, a simple controlled investigation with the following attributes: <ul><li>prediction</li> <li>appropriate materials, tools and available computer technology</li> <li>variables kept the same (controlled)</li> <li>one changed variable (manipulated)</li> <li>measured (responding) variable</li> <li>gather, record, and organize data using appropriate units, charts, and/or graphs</li> <li>multiple trials</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DBA","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"(5) Generate a logical plan for a simple field investigation with the following attributes: <ul><li>identify multiple variables</li> <li>select observable or measurable variables related to the investigative question</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DBB","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"(3,4,5) Identify and use simple equipment and tools (such as magnifiers, rulers, balances, scales, and thermometers) to gether data and extend the senses."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DBC","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"(3,4,5) Follow all safety rules during investigations."}]},{"leaf":false,"text":"2.1.3 Explaining<br /> Understand how to construct a reasonable explanation using evidence.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DBE","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"(3,4,5) Generate a scientific conclusion including supporting data from an investigation (e.g., Grass grows taller with more light.  With only 2 hours of light each day, grass grew 2 centimeters in two weeks but with 6 hours of light, grass grew 8 centimeters)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DBF","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"(3,4,5) Describe a reason for a given conclusion using evidence from an investigation."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DC0","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"(4,5) Generate a scientific explanation of an observed phenomena using given data."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DC1","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"(5) Predict what logically might occur if an investigation lasted longer or was changed."}]},{"leaf":false,"text":"2.1.4 Modeling<br /> Understand how to use simple models to represent objects, events, systems and processes.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DC3","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"(3,4,5) List similarities and differences between a model and what the model represents (e.g., hinge and an elbow; a spinning globe and Earth's rotations; steam from a tea kettle and clouds or fog)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DC4","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"(3,4,5) Create a simple model to represent common objects, events, systems, or processes (e.g., diagram or map and/or physical model)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DC5","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"(3,4,5) Investigate phenomena using a simple physical or computer model or simulation."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DC6","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"(5) Describe reasons for using a model to investigate phenomena (e.g., processes that happen very slowly or quickly; things that are too small or too large for direct observation; phenomenon that cannot be controlled, or are potentially dangerous)."}]},{"leaf":false,"text":"2.1.5 Communicating<br /> Understand how to report investigations and explanations of objects, events, systems, and processes.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DC7","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"(3,4,5) Report observations or data of simple investigations without making inferences."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DC8","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"(3,4,5) Summarize an investigation by describing: <ul><li>reasons for selecting the investigative plan</li> <li>materials used in the investigation</li> <li>observations, data, results</li> <li>explanations and conclusions in written, mathematical, oral, and information technology presentation formats</li> <li>safety procedures used</li></ul>"}]},{"leaf":false,"text":"2.1.1 Questioning<br /> Understand how to generate a question that can be answered through scientific investigation","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E6F","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"(6,7,8) Generate multiple questions based on observations."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E70","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"(6,7,8) Generate a question that can be investigated scientifically."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E71","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"(6,7,8) Generate a new question that can be investigated with the same materials and/or data as a given investigation."}]},{"leaf":false,"text":"2.1.2 Planning and Conducting Safe Investigations<br /> Understand  how to plan and conduct scientific investigations.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E73","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"(6,7,8) Make predictions (hypothesize) and give reasons."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E74","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"(6,7,8) Generate a logical plan for, and conduct, a scientific controlled investigation with the following attributes: <ul><li>prediction (hypothesis)</li> <li>appropriate materials, tools, and available computer technology</li> <li>controlled variables (kept the same)</li> <li>one manipulated (changed) variable</li> <li>responding (dependent) variable</li> <li>gather, record, and organize data using appropriate units, charts, and/or graphs</li> <li>multiple trials</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E75","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"(6,7,8) Generate a logical plan for a simple field investigation with the following attributes: <ul><li>identify multiple variables</li> <li>select observable or measurable variables related to the investigative question</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E76","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"(6,7,8) Identify and explain safety requirements that would be needed in the investigation."}]},{"leaf":false,"text":"2.1.3 Explaining<br /> Apply understanding of how to construct a scientific explanation using evidence and inferential logic. W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E78","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"(6,7,8) Generate a scientific conclusion including supporting data from an investigation using inferential logic (e.g., Chewing gum loses more mass than bubble gum after being chewed for 5 minutes.  Chewing gum lost 2.00 grams while bubble gum only lost 1.47 grams)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E79","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"(6,7,8) Describe a reason for a given conclusion using evidence from an investigation."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E7A","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"(6,7,8) Generate a scientific explanation of an observed phenomena using given data."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E7B","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"(6) Predict what logically might occur if an investigation lasted longer or changed."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E7C","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"}],"text":"(7,8) Describe the difference between evidence (data) and conclusions."}]},{"leaf":false,"text":"2.1.4 Modeling<br /> Analyze how models are used to investigate objects, events, systems, and processes.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E7E","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"(6) Compare models or computer simulations of phenomena to the actual phenomena."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E7F","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"(6) Explain how models or computer simulations are used to investigate and predict the behavior of objects, events, systems, or processes."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E80","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"(6,7,8) Create a model or computer simulation to investigate and predict the behavior of objects, events, systems, or processes (e.g., phases of the moon using a solar system model)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E81","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"(7) Explain the advantages and limitations of investigating with a model."}]},{"leaf":false,"text":"2.1.5 Communicating<br /> Apply understanding of how to report investigations and explanations of objects, events, systems, and processes.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E83","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"(6,7,8) Report observations of scientific investigations without making inferences."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E84","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"(6,7,8) Summarize an investigation by describing: <ul><li>reasons for selecting the investigative plan</li> <li>materials used in the investigation</li> <li>observations, data, results</li> <li>explanations and conclusions in written, mathematical, oral, and information techonology presentation formats</li> <li>ramifications of investigations</li> <li>safety procedures used</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E85","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"(6,7,8) Describe the difference between an objective summary of data and an inference made from data."}]},{"leaf":false,"text":"2.1.1 Questioning<br /> Understand how to generate and evaluate questions that can be answered through scientific investigations.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F2D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(9,10) Generate a new question that can be investigated with the same materials and/or data as a given investigation."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F2E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(9,10) Generate questions and critique whether questions can be answered through scientific investigations."}]},{"leaf":false,"text":"2.1.2 Planning and Conducting Safe Investigations<br /> Understand how to plan and conduct systematic and complex scientific investigations.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F30","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(9,10) Make a hypothesis about the results of an investigation that includes a prediction with a cause-effect reason"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F31","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(9,10) Generate a logical plan for, and conduct, a systematic and complex scientific controlled investigation with the following attributes: <ul><li>hypothesis (prediction with cause-effect reason)</li> <li>appropriate materials, tools, and available computer technology</li> <li>controlled variables</li> <li>one manipulated variable</li> <li>responding (dependent) variable</li> <li>gather, record, and organize data using appropriate units, charts and/or graphs</li> <li>multiple trials</li> <li>experimental control condition when appropriate</li> <li>additional validity measures</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F32","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(9,10) Generate a logical plan for a simple field investigation with the following attributes: <ul><li>Identify muiltiple variables</li> <li>Select observable or measurable variables related  to the investigative question</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F33","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(9,10) Identify and explain safety requirements that would be needed in an investigation."}]},{"leaf":false,"text":"2.1.3 Explaining<br /> Apply understanding of how to construct and revise a scientific explanation using evidence and inferential logic.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F35","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(9,10) Generate a scientific conclusion including supporting data from an investigation using inferential logic (e.g., The fertilizer did help the plants grow faster, but had little effect on the number of seeds that germinated.  With the fertilizer, the plants matured 35 days sooner than plants without the fertilizer.  Almost all the 30 seeds used did germinate 13 seeds in the fertilized soil and 14 seeds in the soil without fertilizer)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F36","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(9,10) Describe a reason for a given conclusion using evidence from an investigation."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F37","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(9,10) Generate a scientific explanation of an observed phenomena using given data."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F38","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(9,10) Predict and explain what logically might occur if an investigation lasted longer or changed."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F39","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(9,10) Explain the difference between evidence (data) and conclusions."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F3A","dcterms_educationLevel":[{"prefLabel":"10"}],"text":"(10) Revise a scientific explanation to better fit the evidence and defend the logic of the revised explanation."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F3B","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(9,10) Explain how scientific evidence supports or refutes claims or explanations of phenomena."}]},{"leaf":false,"text":"2.1.4 Modeling<br /> Analyze how physical, conceptual, and mathematical models represent and are used to investigate objects, events, systems, and processes.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F3D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(9,10) Compare how a model or different models represent the actual behavior of an object, event, system, or process."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F3E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(9,10) Evaluate how well a model describes or predicts the behavior of an object, event, system, or process."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F3F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(9,10) Create a physical, conceptual, and/or mathematical (computer simulation) model to investigate, predict, and explain the behavior of objects, events, systems, or processes (e.g., DNA replication)."}]},{"leaf":false,"text":"2.1.5 Communicating<br /> Apply understanding of how to report complex scientific investigations and explanations of objects, events, systems, and processes, and how to evaluate scientific reports.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F41","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(9,10) Report observations of scientific investigations without making inferences."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F42","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(9,10) Summarize an investigation by describing: <ul><li>reasons for selecting the investigative plan</li> <li>materials used in the investigation</li> <li>observations, data, results</li> <li>explanations and conclusions in written, mathematical, oral, and information technology presentation formats</li> <li>ramifications of investigations to concepts principles and theories</li> <li>safety procedures used</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F43","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(9,10) Describe the difference between an objective summary of data and an inference made from data."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F44","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(9,10) Compare the effectiveness of different graphics and tables to describe patterns, explanations, conclusions, and implications found in investigations."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F45","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(9,10) Critique a scientific report for completeness, accuracy, and objectivity."}]}]}]},{"leaf":false,"text":"Component 2.2 Nature of Science: Understand the nature of scientific inquiry","children":[{"leaf":false,"text":"Nature of Science","children":[{"leaf":false,"text":"2.2.1 Intellectual Honesty<br /> Understand that all scientific observations are reported accurately even when the observations contradict expectations.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D2F","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"(K, 1, 2) Record what is observed and explain how it was done accurately and honestly."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D30","dcterms_educationLevel":[{"prefLabel":"1"},{"prefLabel":"2"}],"text":"(1, 2) Keep records and explain that the records have not been changed even when they did not match initial expectations."}]},{"leaf":false,"text":"2.2.2 Limitations of Science and Technology <br /> Understand that observations and measurement are used by scientistits to describe the world.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D32","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"(K, 1, 2) Raise questions about the natural world and seek answers by making careful observations and trying things out."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D33","dcterms_educationLevel":[{"prefLabel":"1"},{"prefLabel":"2"}],"text":"(1, 2) Make observations and measurements about natural phenomena."}]},{"leaf":false,"text":"2.2.3 Evaluating Inconsistent Results <br /> Understand that similar investigations may not produce similar results.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D35","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"(2) Observe the procedures of two similiar investigations and explain that they produced different results."}]},{"leaf":false,"text":"2.2.5 Evolution of Scientific Ideas<br /> Know that ideas in science change as new scientific evidence arises.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D37","dcterms_educationLevel":[{"prefLabel":"1"},{"prefLabel":"2"}],"text":"(1,2) Know how scientific inquiry results in facts, unexpected findings, ideas, evidence, and explanations."}]},{"leaf":false,"text":"2.2.1 Intellectual Honesty<br /> Understand that all scientific observations are reported accurately and honestly even when the observations contradict expectations.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DCA","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"(3,4,5) Explain why scientific observations are recorded accurately and honestly."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DCB","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"(3,4,5) Explain why scientific records of observations are not changed even when the records do not match initial expectations."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DCC","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"(3,4,5) Explain why honest acknowledgement of the contributions of others and information sources are necessary."}]},{"leaf":false,"text":"2.2.2 Limitations of Science and Technology<br /> Understand that scientific facts are measurements and observations of phenomena in the natural world which are repeatable and/or verified by expert scientists.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DCE","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"(3) Describe how new scientific facts are established every day (e.g., find examples of new facts in current media)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DCF","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"(4,5) Describe whether measurements and/or observations of phenomena are scientific facts."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DD0","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"(4,5) Describe whether a report of an observation is a scientific fact or an interpretation (e.g., seeing a light in the night sky versus seeing a star)."}]},{"leaf":false,"text":"2.2.3 Evaluating Inconsistent Results<br /> Understand why similar investigations may not produce similar results.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DD2","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"(3,4,5) Describe reasons why two similar investigations can produce different results (e.g., identify possible sources of error)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DD3","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"(4,5) Explain whether sufficient information has been obtained to make a conclusion."}]},{"leaf":false,"text":"2.2.4 Evaluating Methods of Investigation<br /> Understand how to make the results of scientific investigations reliable.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DD5","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"(3,4,5) Describe how the method of investigation insures reliable results (i.e., reliability means that repeating an investigation gives similar results)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DD6","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"(4,5) Identify and describe ways to increase the reliability of the results of an investigation (e.g., multiple trials of an investigation increase the reliability of the results)."}]},{"leaf":false,"text":"2.2.5 Evolution of Scientific Ideas<br /> Understand that scientific comprehension of systems increases through inquiry.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DD8","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"(3,4,5) Describe how scientific inquiry results in facts, unexpected findings, ideas, evidence, and explanations."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DD9","dcterms_educationLevel":[{"prefLabel":"4"},{"prefLabel":"5"}],"text":"(4,5) Describe how results of scientific inquiry may change our understanding of the systems of the natural and constructed world."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DDA","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"(5) Explain how ideas about the natural and/or constructed world have changed because of scientific inquiry."}]},{"leaf":false,"text":"2.1.1 Intellectual Honesty<br /> Apply curiosty, honesty, skepticism, and openness when considering explanations and conducting investigations.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E87","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"(6,7,8) Explain why an honest response to questionable results, conclusions, or explanations is important to the scientific enterprise."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E88","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"(8) Describe a flaw in a claim or a conclusion (i.e., limited data, flawed procedure, or over generalization)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E89","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"(6,7,8) Describe how scientists accurately and honestly, record, report, and share observations and measurements, without bias."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E8A","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"(6,7,8) Explain why honest acknowledgement of the contributions of others and information sources are necessary."}]},{"leaf":false,"text":"2.2.2 Limitations of Science and Technology<br /> Understand that scientific theories explain facts using inferential logic. W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E8C","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"(6,7,8) Describe how a principle or theory logically explains a given set of facts."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E8D","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"}],"text":"(7,8) Describe how new facts or evidence may result in the modification or rejection of a theory (e.g., caloric theory of heat, theory of acquired characteristics)."}]},{"leaf":false,"text":"2.2.3 Evaluating Inconsistent Results<br /> Analyze inconsistent results from scientific investigations to determine how the results can be explained.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E8F","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"(6,7,8) Compare two or more similar investigations and explain why different results were produced (e.g., insufficient data could be interpreted as inconsistent results)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E90","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"(6,7,8) Explain whether sufficient information has been obtained to make a conclusion."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E91","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"}],"text":"(7,8) Explain why the results from a single investigation or demonstration are not sufficient to describe a phenomenon."}]},{"leaf":false,"text":"2.2.4 Evaluating Methods of Investigation<br /> Understand how to make the results of scientific investigations reliable and how to make the method of investigation valid.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E93","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"(6) Describe how the method of an investigation ensures reliable results (e.g., multiple trials ensure more reliable results)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E94","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"(6,7,8) Describe how to increase the reliability of the results of an investigation (e.g., repeating an investigation exactly the same way increases the reliability of the results)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E95","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"}],"text":"(7,8) Describe how the method of an investigation is valid (i.e., validity means that the investigation answered the investigative question with confidence; the manipulated variable caused the change in the responding or dependent variable)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E96","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"}],"text":"(7,8) Describe the purpose of the steps and material of an investigation's procedure in terms of the validity of the investigation."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E97","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"(8) Modify an investigation to improve the validity of the investigation and explain how the modification improved the validity (e.g., more controlled variables, more accurate measuring techniques, greater sample size)."}]},{"leaf":false,"text":"2.2.5 Evolution of Scientific Ideas<br /> Understand that increased comprehension of systems leads to new inquiry.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E99","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"(6,7,8) Describe how scientific inquiry results in new facts, evidence, unexpected findings, ideas, and explanations."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E9A","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"}],"text":"(7,8) Describe how results of scientific inquiry may change our understanding of the systems of the natural and constructed world."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10294F4","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"(6,7,8) Describe how increased understanding of systems leads to new questions to be investigated."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E9B","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"}],"text":"(7,8) Describe how new ideas need repeated inquiries before acceptance."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E9C","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"(8) Describe how new investigative questions arise at the completion of scientific inquiry."}]},{"leaf":false,"text":"2.2.1 Intellectual Honesty<br /> Analyze why curiosity, honesty, cooperation, openness, and skepticism are important to scientific explanations and investigations.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F47","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(9,10) Explain why honesty ensures the integrity of scientific investigations (e.g, explanations in the absence of credible evidence, questionable results, conclusions or explanations inconsistent with established theories)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F48","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(9,10) Explain why a claim or a conclusion is flawed (e.g., limited data, lack of controls, weak logic)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F49","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(9,10) Explain why scientists are expected to accurately and honestly record, report, and share observations and measurements, without bias."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F4A","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(9,10) Explain why honest acknowledgement of the contributions of others and information sources are necessary (e.g., undocumented sources of informations, plagarism)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F4B","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(9,10) Explain why peer review is necessary in the scientific reporting process."}]},{"leaf":false,"text":"2.2.2 Limitations of Science and Technology<br /> Analyze scientific theories for logic, consistency, historical and current evidence, limitations, and for capacity to be investigated and modified.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F4D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(9,10) Describe how a theory logically explains a set of facts, principles, concepts and/or knowledge."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F4E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(9,10) Describe a theory that best explains and predicts phenomena and investigative results."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F4F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(9,10) Explain how scientific theories are open to investigation and have the capacity to be modified."}]},{"leaf":false,"text":"2.2.3 Evaluating Inconsistent Results<br /> Evaluate Inconsistent or unexpected results from scientific investigations using scientific explanations.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F51","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(9,10) Evaluate similar investigations with inconsistent or unexpected results."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F52","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(9,10) Explain whether sufficient data has been obtained to make an explanation or conclusion (e.g., reference previous and current research; incorporate scientific concepts, principles, and theories)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F53","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(9,10) Explain why results from a single investigation or demonstration are not conclusive about a phenomenon."}]},{"leaf":false,"text":"2.2.4 Evaluating Methods of Investigation<br /> Analyze scientific investigation for validity of method and reliability of results.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F55","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(9,10) Describe how the methods of an investigations ensured reliable results."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F56","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(9,10) Explain how to increase the reliability of the results of an investigation (e.g, repeating an investigation exactly the same way increases the reliability of the results."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10294F5","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(9,10) Describe how the methods of an investigation ensured validity (i.e., validity means that the investigation answered the investigative question with confidence; the manipulated variable caused the change in the responding or dependent variable)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F57","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(9,10) Explain the purpose of the steps of an investigation in terms of the validity of the investigation."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F58","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(9,10) Explain how to improve the validity of an investigation (e.g., control more variables, better measuring techniques, increased sample size, control for sample bias, include experimental control condition when appropriate, include a placebo group when appropriate)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F59","dcterms_educationLevel":[{"prefLabel":"10"}],"text":"(10) Explain an appropriate type of investigation to ensure reliability and validity for a given investigative question (e.g., descriptive, controlled, correlational, comparative, See Appendix F)."}]},{"leaf":false,"text":"2.2.5 Evolution of Scientific Ideas<br /> Understand how scientific knowledge evolves.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F5B","dcterms_educationLevel":[{"prefLabel":"9"}],"text":"(9) Explain how existing ideas were synthesized from a long, rich history of scientific explanations and how technological advancements changed scientific theories."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F5C","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(9,10) Explain how scientific inquiry results in new facts, evidence, unexpected findings, ideas, explanations, and revisions to current theories."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F5D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(9,10) Explain how results of scientific inquiry may change our understanding of the systems of the natural and constructed world."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F5E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(9,10) Explain how increased understanding of systems leads to new questions to be investigated."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F5F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(9,10) Explain how new ideas need repeated inquiries before acceptance."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F60","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(9,10) Use new tools to investigate a system to discover new facts about the system that lead to new ideas and questions."}]}]}]}]},{"leaf":false,"text":"EALR 3 APPLICATION: The student knows and applies science concepts and skills to develop solutions to human problems in societal contexts.","children":[{"leaf":false,"text":"Component 3.1 Designing Solutions: Apply knowledge and skills of science and technology to design solutions to human problems or meet challenges.","children":[{"leaf":false,"text":"Designing Solutions","children":[{"leaf":false,"text":"3.1.1 Identifying Problems<br /> Know and understand problems that can be solved or have been solved by using scientific design.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D3C","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"(2) Identify and explain problems that can be solved through investigations and/or with tools."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D3D","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"(2) Identify and describe a problem in a given situation (e.g., \"I want to make the plant grow faster\")."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D3E","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"(2) Identify and name a common material, object, or tool that helps solve a simple problem."}]},{"leaf":false,"text":"3.1.2 Designing and Testing Solutions<br /> Understand how to construct and test a solution to a problem.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D40","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"(2) Propose, construct, and test a solution to a problem <ul><li>Give examples of possible solutions to the problem</li> <li>Select and construct a solution to the problem.</li> <li>Test a solution to the problem.</li></ul>"}]},{"leaf":false,"text":"3.1.3 Evaluating Potential Solutions <br /> Understand how well a design or a product solves a problem.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D42","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"(2) Choose and justify at least one reason why a design or product would or would not work to solve a specific problem."}]},{"leaf":false,"text":"3.1.1 Identifying Problems<br /> Understand problems found in ordinary situations in which scientific design can be or has been used to design solutions.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DDC","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"(3,4,5) Describe an appropriate question that could lead to a possible solution to a problem."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DDD","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"(3,4,5) Describe how science and technology could be used to solve a human problem (e.g., using a controllable electric lamp as a source of light for plant growth)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DDE","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"(3,4,5) Describe the scientific concept, principle, or process used in a solution to a human problem (e.g., a student using the force of a stretched spring for a push or pull)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DDF","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"(3,4,5) Describe how to scientifically gather information to develop a solution (e.g., find an acceptable information source, do an investigation and collect data)."}]},{"leaf":false,"text":"3.1.2 Designing and Testing Solutions<br /> Understand how the scientific design process is used to develop and implement solutions to human problems.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DE1","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"(3,4,5) Propose, implement, and document a scientific design process used to solve a problem or challenge. <ul><li>define the problem</li> <li>scientifically gather information and collect measurable data</li> <li>explore ideas</li> <li>make a plan</li> <li>list steps to do the plan</li> <li>scientifically test solutions</li> <li>document the scientific design process</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DE2","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"(3,4,5) Describe possible solutions to the problem (e.g., preventing an injury on the playground by creating a softer landing at the bottom of a slide)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DE3","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"(3,4,5) Describe the reason(s) for the effectiveness of a solution to a problem or challenge."}]},{"leaf":false,"text":"3.1.3 Evaluating Potential Solutions<br /> Analyze how well a design or a product solves a problem.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DE5","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"(3,4,5) Identify the criteria for an acceptable solution to the problem or challenge."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DE6","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"(3,4,5) Describe the reason(s) for the effectiveness of a solution to a problem or challenge using scientific concepts or principles."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DE7","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"(3,4,5) Describe the consequences of the solution to the problem or challenge (e.g., sharpening a crayon results in using up crayons faster)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DE8","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"(3,4,5) Describe how to change a system to solve a problem or improve a solution to a problem."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DE9","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"(3,4,5) Test how well a solution works based on criteria and recommend and justify with scientific concepts or principles and data, how to make it better (e.g., sharpen a crayon using sandpaper; one grit it better than another)."}]},{"leaf":false,"text":"3.1.1 Identifying Problems<br /> Analyze common problems or challenges in which scientific design can be or has been used to design solutions.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E9E","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"(6,7,8) Describe how science and technology could be used to solve all or part of a human problem and vice versa (e.g., understanding erosion can be used to solve some flooding problems)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028E9F","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"(6,7,8) Describe the scientific concept, principle, or process used in a solution to a human problem (e.g., understanding of the relationship between electricity and magnetism has been used to make electric motors and generators)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028EA0","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"(6,7,8) Explain how to scientifically gather information to develop a solution (e.g., collect data by measuring all the factors and establish which are the most important to solve the problem)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028EA1","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"(6,7,8) Describe an appropriate question that could lead to a possible solution to a problem."}]},{"leaf":false,"text":"3.1.2 Designing and Testing Solutions<br /> Apply the scientific design process to develop and implement solutions to problems or challenges.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028EA3","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"(6,7,8) Propose, implement, and document a scientific design process to solve a problem or challenge by: <ul><li>define the problem</li> <li>scientifically gather information and collect measurable data</li> <li>explore ideas</li> <li>make a plan</li> <li>list steps to do the plan</li> <li>scientifically test solution</li> <li>document the scientific design process</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028EA4","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"(6,7,8) Explain possible solutions to the problem (e.g., use pulleys instead of leavers to life a heavy object)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028EA5","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"(6,7,8) Explain the reason(s) for the effectiveness of a solution to a problem or challenge."}]},{"leaf":false,"text":"3.1.3 Evaluating Potential Solutions<br /> Analyze multiple solutions to a problem or challenge.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028EA7","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"(6,7,8) Describe the criteria to evaluate an acceptable solution to the problem or challenge."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028EA8","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"(6,7,8) Describe the reason(s) for the effectiveness of a solution to a problem or challenge using scientific concepts and principles."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028EA9","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"}],"text":"(7,8) Describe the consequence of the solution to the problem or challenge (e.g., using rocks on the edge of a stream to prevent erosion may destroy habitat)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028EAA","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"}],"text":"(7,8) Describe how to change a system to solve a problem or improve a solution to a problem."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028EAB","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"(8) Compare the effectiveness of different solutions to a problem or challenge based on criteria, using scientific concepts and principles."}]},{"leaf":false,"text":"3.1.1 Identifying Problems<br /> Analyze local, regional, national, or global problems or challenges in which scientific design can be or has been used to design a solution.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F62","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(9,10) Explain how science and technology could be used to solve all or part of a human problem and vice versa. (e.g., understanding the composition of an Earth material can be useful to human, like copper ore being used to make copper wire)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F63","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(9,10) Explain the scientific concept, principle, or process used in a solution to a human problem (e.g., understanding the effect of seismic waves on structures can be used to design buildings to withstand an earthquake)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F64","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(9,10) Explain how to scientifically gather information to develop a solution (e.g., perform a scientific investigation and collect data to establish the best materials to use in a solution to the problem)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F65","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(9,10) Describe an appropriate question that could lead to a possible solution to a problem."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F66","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(9,10) Describe a change that could improve a tool or a technology."}]},{"leaf":false,"text":"3.1.2 Designing and Testing Solutions<br /> Evaluate the scientific design process used to develop and implement solutions to problems or challenges.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F68","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(9,10) Research, propose, implement, and document a scientific design process used to solve a problem or challenge by: <ul><li>define the problem</li> <li>scientifically gather information and collect empirical data</li> <li>explore ideas</li> <li>make a plan</li> <li>list steps to do the plan</li> <li>scientifically test solutions</li> <li>document the scientific design process</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F69","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(9,10) Evaluate possible solutions to the problem (e.g, describe how to clean up a polluted stream)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F6A","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(9,10) Evaluate the reason(s) for the effectiveness of a solution to a problem or challenge."}]},{"leaf":false,"text":"3.1.3 Evaluating Potential Solutions<br /> Evaluate consequences, constraints, and applications of solutions to a problem or challenge.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F6C","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(9,10) Explain the criteria to evaluate the  solution(s) to a problem or challenge."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F6D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(9,10) Explain the effectiveness of the solution to the problem or challenge using scientific principles and cocepts."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F6E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(9,10) Explain the consequences of the solution(s) to the problem or challenge (e.g., doubting the fertilizer will probably not double the plant growth and could cause harm to the ecosystem)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F6F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(9,10) Explain how to change a system to solve a problem or improve a solution to a problem."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F70","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(9,10) Compare and evaluate the effectiveness of different solutions to a problem or challenge based on criteria, using scientific concepts and principles."}]}]}]},{"leaf":false,"text":"Component 3.2 Science, Technology, and Society: Analyze how science and technology are human endeavors, interrelated to each other, to society, and to the workplace and the environment.","children":[{"leaf":false,"text":"Science, Technology, and Society","children":[{"leaf":false,"text":"3.2.1 All Peoples Contribute to Science and Technology<br /> Know that science and technology are practiced by all people around thw world.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D46","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"(2) Identify ways that people around the world use science and technology."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D47","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"(2) Identify ways that people around the world use science and technology to invent things and ideas."}]},{"leaf":false,"text":"3.2.2 Relationship of Science and Technology<br /> Know that people have invented tools for everyday life.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D49","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"(K,1,2) Describe ways in which common tools help people in their everyday life."}]},{"leaf":false,"text":"3.2.3 Careers and Occupations Using Science, Mathematics, and Technology<br /> Know how knowledge and skills of science, mathematics, and technology are used in a common occupation.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1029511","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"(1) Tell at least one way that science, mathematics, or technology is used by a person in a job."}]},{"leaf":false,"text":"3.2.4 Environemntal and Resource Issues <br /> Understand how humans depend on the natural environment.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D4B","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"}],"text":"(K,1,2) Describe what humans obtain from their environment (e.g., a school garden yields vegetables, wool from sheep to make a sweater)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028D4C","dcterms_educationLevel":[{"prefLabel":"1"},{"prefLabel":"2"}],"text":"(1,2) Describe what organisms obtain from their environment (e.g., a school plant needs water and sunlight)."}]},{"leaf":false,"text":"3.2.1 All Peoples Contribute to Science and Techology<br /> Understand that science and technology have been practiced by all peoples throughout history.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DEB","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"(3,4,5) Describe how individuals of diverse backgrounds have made significant scientific discoveries or technological advances."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DEC","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"(3,4,5) Describe how advancements in science and technology have developed over time and with contributions from diverse people."}]},{"leaf":false,"text":"3.2.2 Relationship of Science and Technology<br /> Understand that people have invented tools for everyday life and for scientific investigations.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DEE","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"(3) Describe tools (technology) invented to advance scientific investigations. (e.g., thermometer, rulers, microscopes, telescope)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DEF","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"(4) Describe how scientific tools help people design solutions to human problems (e.g., microscope to see disease cauasing bacteria)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DF0","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"(5) Describe how common tools help people design ways to adapt to different environments (e.g., sewing needle to make clothes)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DF1","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"(5) Describe how scientific ideas and discoveries are used to design solutions to human problems, extend human ability, or help humans to adapt to different environments (e.g., prosthetics used to replace a lost limb)."}]},{"leaf":false,"text":"3.2.3 Careers and Occupations Using Science, Mathematics, and Technology<br /> Understand how knowledge and skills of science, mathematics, and technology are used in common occupations.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DF3","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"(3,4,5) Identify science, math, and technology skills used in a career."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DF4","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"(3,4,5) Identify occupations using scientific, mathematical, and technological knowledge and skills."}]},{"leaf":false,"text":"3.2.4 Environmental and Resource Issues<br /> Understand how humans depend on the natural environment and can cause changes in the environment that affect human's ability to survive.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DF6","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"4"},{"prefLabel":"5"}],"text":"(3,4,5) Describe how resources can be conserved through reusing, reducing, and recycling."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DF7","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"5"}],"text":"(3,5) Describe the effects conservation has on the environment."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DF8","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"5"}],"text":"(3,5) Describe the effects of humans on the health of an ecosystem."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DF9","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"5"}],"text":"(3,5) Describe how humans can cause changes in the environment that affects the livability of the environment for humans."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028DFA","dcterms_educationLevel":[{"prefLabel":"3"},{"prefLabel":"5"}],"text":"(3,5) Describe the limited resources humans depend on and how changes in these resources affect the livability of the environment for humans."}]},{"leaf":false,"text":"3.2.1 All Peoples Contribute to Science and Technology<br /> Analyze how science and technology have been developed, used, and affected by many diverse individuals, cultures, and societies throughout human history.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028EAD","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"(6,7,8) Explain how the contributions of diverse individuals have led to the development of science and technology."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028EAE","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"(8) Explain how science and technology have affected individuals, cultures, and societies throughout human history."}]},{"leaf":false,"text":"3.2.2 Relationship of Science and Technology<br /> Analyze scientific inquiry and scientific design and understand how science supports technological development and vice versa.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028EB0","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"}],"text":"(7,8) Describe how scientific investigations and scientific research support technology (e.g., investigation into materials led to Gortex and Kevlar)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028EB1","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"}],"text":"(7,8) Describe how technology supports scientific investigations and research (e.g., microscopes led to the discovery of unicellular organisms)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028EB2","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"}],"text":"(7,8) Describe how a scientifically designed solution to a human problem can lead to new tools that generate further inquiry (e.g., microscopes, telescopes, and computers)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028EB3","dcterms_educationLevel":[{"prefLabel":"7"},{"prefLabel":"8"}],"text":"(7,8) Compare the processes of scientific inquiry and scientific design in terms of activities, results, and/or influence on individuals and/or society."}]},{"leaf":false,"text":"3.2.3 Careers and Occupations Using Science, Mathematics, and Technology<br /> Analyze the use of science, mathematics, and technology within occupational/career areas of interest.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028EB5","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"(6,7,8) Examine scientific, mathematical, and technological knowledge and skills used in an occupation/career."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028EB6","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"(6,7,8) Research occupational/careers that require knowledge of science, mathematics, and technology."}]},{"leaf":false,"text":"3.2.4 Environmental and Resource Issues<br /> Analyze how human societies' use of natural resources affects the quality of life and the health of ecosystems.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028EB8","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"(6,7,8) Discriminate between renewable and non-renewable resources in an ecosystem."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028EB9","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"(6,7,8) Explain the effects that the conservation of natural resources have on the quality of life and the health of ecosystems."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028EBA","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"},{"prefLabel":"8"}],"text":"(6,7,8) Explain the effects of various human activities on the health of an ecosystem and/or the ability of organisms to survive in that ecosystem (e.g., consumption of natural resources, waste management, urban growth, land use decisions, pesticide, herbicide, or fertilizer use)."}]},{"leaf":false,"text":"3.2.1 All Peoples Contribute to Science and Technology<br /> Analyze how scientific knowledge and technological advances discovered and developed by individuals and communities in all cultures of the world contribute to changes in societies.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F72","dcterms_educationLevel":[{"prefLabel":"9"}],"text":"(9) Explain how life has changed throughout history because of scientific knowledge and technological advances from a variety of peoples."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F73","dcterms_educationLevel":[{"prefLabel":"10"}],"text":"(10) Compare the impacts of diverse cultures and individuals on science and technology."}]},{"leaf":false,"text":"3.2.2 Relationship of Science and Technology<br /> Analyze how the scientific enterprise and tehnological advances influence and are influenced by human activity.W","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F75","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(9,10) Describe how science and/or technology have led to a given social or economic development."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F76","dcterms_educationLevel":[{"prefLabel":"10"}],"text":"(10) Explain risks associated with investigations involving livings things (e.g., drug trials of animals, testing of genetically engineered plants, release of African snails into environment after experimentation}."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F77","dcterms_educationLevel":[{"prefLabel":"10"}],"text":"(10) Identify the limits of scientific research in solving a given social, environmental, and/or economic problem."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F78","dcterms_educationLevel":[{"prefLabel":"10"}],"text":"(10) Compare advantages and/or disadvantages of using new technology or science in terms of ethics, politics, and environmental considerations."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F79","dcterms_educationLevel":[{"prefLabel":"10"}],"text":"(10) Explain the concept of proprietary discovery (e.g., patents on genes)."}]},{"leaf":false,"text":"3.2.3 Careers and Occupations Using Science, Mathematics, and Technology Analyze the use of science, mathematics, and technology within occupational/career areas of interest.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F7B","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(9,10) Evaluate the scientific, mathematical, and technological knowledge, training, and experience needed for occupational/career areas of interest."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F7A","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(9,10) Research and report on educational requirements associated with an  occupation(s)/careers(s) of interest."}]},{"leaf":false,"text":"3.2.4 Environmental and Resource Issues<br /> Analyze the effects human activities have on Earth's capacity to sustain biological diversity","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F7D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(9,10) Explain how the use of renewable and non-renewable natural resources affects the sustainablility of an ecosystem."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1028F7E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"}],"text":"(9,10) Explain how human activities affect Earth's capacity to sustain biological diversity (e.g., global warming, ozone depletion)."}]}]}]}]}]