[{"leaf":false,"text":"Elementary Science","children":[{"leaf":false,"text":"Structure and Transformation of Matter","children":[{"leaf":false,"text":"Physical Science","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C521","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"asn_statementNotation":"SC-EP-1.1.1","text":"Students will classify material objects by their properties providing evidence to support their classifications.<br /><br /> Objects are made of one or more materials such as paper, wood and metal. Objects can be described by the properties of the materials from which they are made. Those properties and measurements of the objects can be used to separate or classify objects or materials."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C522","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"asn_statementNotation":"SC-EP-1.1.2","text":"Students will understand that objects have many observable properties such as size, mass, shape, color, temperature, magnetism and the ability to interact and/or to react with other substances. Some properties can be measured using tools such as metric rulers, balances and thermometers."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C523","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"asn_statementNotation":"SC-EP-1.1.3","text":"Students will describe the properties of water as it occurs as a solid, liquid or gas.<br /><br /> Matter (water) can exist in different states--solid, liquid and gas. Properties of those states of matter can be used to describe and classify them."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C524","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"SC-04-1.1.1","text":"Students will explain how matter, including water, can be changed from one state to another.<br /><br /> Materials can exist in different states--solid, liquid and gas. Some common materials, such as water, can be changed from one state to another by heating or cooling. Resulting cause and effect relationships should be explored, described and predicted."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C525","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"SC-05-1.1.1","text":"Students will describe the physical properties of substances (e.g., boiling point, solubility, density).<br /><br /> A substance has characteristic physical properties (e.g., boiling point, solubility, density) that are independent of the amount of the sample."}]}]},{"leaf":false,"text":"Motion and Forces","children":[{"leaf":false,"text":"Physical Science","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C528","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"asn_statementNotation":"SC-EP-1.2.1","text":"Students will describe and make inferences about the interactions of magnets with other magnets and other matter (e.g., magnets can make some things move without touching them).<br /><br /> Magnets have observable properties that allow them to attract and repel each other and attract certain kinds of other materials (e.g., iron). Based on the knowledge of the basic properties of magnets, predictions can be made and conclusions drawn about their interactions with other common objects."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C529","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"asn_statementNotation":"SC-EP-1.2.2","text":"Students will describe the change in position over time (motion) of an object.<br /><br /> An object's motion can be observed, described, compared and graphed by measuring its change in position over time."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C52A","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"asn_statementNotation":"SC-EP-1.2.3","text":"Students will describe the position and motion of objects and predict changes in position and motion as related to the strength of pushes and pulls.<br /><br /> The position and motion of objects can be changed by pushing or pulling, and can be explored in a variety of ways (such as rolling different objects down different ramps). The amount of change in position and motion is related to the strength of the push or pull (force). The force with which a ball is hit illustrates this principle. By examining cause and effect relationships related to forces and motions, consequences of change can be predicted."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C52B","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"asn_statementNotation":"SC-EP-1.2.4","text":"Students will understand that the position of an object can be described by locating it relative to another object or the background. The position can be described using phrases such as to the right, to the left, 50 cm from the other object."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C52C","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"SC-04-1.2.1","text":"Students will interpret or represent data related to an object's straight-line motion in order to make inferences and predictions of changes in position and/or time.<br /><br /> An object's motion can be described by measuring its change in position over time such as rolling different objects (e.g., spheres, toy cars) down a ramp. Collecting and representing data related to an object's motion provides the opportunity to make comparisons and draw conclusions."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C52D","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"SC-04-1.2.2","text":"Students will infer causes and effects of pushes and pulls (forces) on objects based on representations or interpretations of straight-line movement/motion in charts, graphs and qualitative comparisons.<br /><br /> The position and motion of objects can be changed by pushing or pulling. The amount of change is related to the force (defined as the strength of the push or pull) and the mass of the object(s) used. The force with which a ball is hit illustrates this principle. Cause and effect relationships, along with predicted consequences related to the strength of pushes and pulls (force) on an object's position and motion should be explored and qualitatively compared."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C52E","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"SC-04-1.2.3","text":"Students will:<ul> <li>explain that sound is a result of vibrations, a type of motion;</li> <li>describe pitch ( high, low) as a difference in sounds that are produced and relate that to the rate of vibration.</li></ul> Vibration is a type of motion that can be observed, described, measured and compared. Sound is produced by vibrating objects. The pitch of the sound can be varied by changing the rate of vibration. The relationship between rates of vibration and produced sounds can be described and graphed."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C52F","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"SC-05-1.2.1","text":"Students will interpret data in order to make qualitative (e.g., fast, slow, forward, backward) and quantitative descriptions and predictions about the straight-line motion of an object.<br /><br /> The motion of an object can be described by its relative position, direction of motion and speed. That motion can be measured and represented on a graph."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C530","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"SC-05-1.2.2","text":"Students will understand that forces are pushes and pulls, and that these pushes and pulls may be invisible (e.g., gravity, magnetism) or visible (e.g., friction, collisions)."}]}]},{"leaf":false,"text":"The Earth and the Universe","children":[{"leaf":false,"text":"Earth/Space Science","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C533","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"asn_statementNotation":"SC-EP-2.3.1","text":"Students will describe earth materials (solid rocks, soils, water and gases of the atmosphere) using their properties.<br /><br /> Earth materials include solid rocks and soils, water and the gases of the atmosphere. Minerals that make up rocks have properties of color, luster and hardness. Soils have properties of color, texture, the capacity to retain water and the ability to support plant growth. Water on Earth and in the atmosphere can be a solid, liquid or gas."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C534","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"asn_statementNotation":"SC-EP-2.3.2","text":"Students will describe patterns in weather and weather data in order to make simple predictions based on those patterns discovered.<br /><br /> Weather changes from day to day and over seasons. Weather can be described using observations and measurable quantities such as temperature, wind direction, wind speed and precipitation. Simple predictions can be made by analyzing collected data for patterns."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C535","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"asn_statementNotation":"SC-EP-2.3.3","text":"Students will describe the properties, locations and real or apparent movements of objects in the sky (Sun, moon).<br /><br /> Objects in the sky have properties, locations and real or apparent movements that can be observed and described. Observational data, patterns and models should be used to describe real or apparent movements."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C536","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"asn_statementNotation":"SC-EP-2.3.4","text":"Students will describe the movement of the sun in the sky using evidence of interactions of the sun with the earth (e.g., shadows, position of sun relative to horizon) to identify patterns of movement.<br /><br /> Changes in movement of objects in the sky have patterns that can be observed and described. The Sun appears to move across the sky in the same way every day, but the Sun's apparent path changes slowly over seasons. Recognizing relationships between movements of objects and resulting phenomena, such as shadows, provides information that can be used to make predictions and draw conclusions about those movements."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C537","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"asn_statementNotation":"SC-EP-2.3.5","text":"Students will understand that the moon appears to move across the sky on a daily basis much like the Sun. The observable shape of the moon can be described as it changes from day to day in a cycle that lasts about a month."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C538","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"SC-04-2.3.1","text":"Students will:<ul> <li>classify earth materials by the ways that they are used;</li> <li>explain how their properties make them useful for different purposes.</li></ul> Earth materials provide many of the resources humans use. The varied materials have different physical properties that can be used to describe, separate, sort and classify them. Inferences about the unique properties of the earth materials yield ideas about their usefulness. For example, some are useful as building materials (e.g., stone, clay, marble), some as sources of fuel (e.g., petroleum, natural gas), or some for growing the plants we use as food."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C539","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"SC-04-2.3.2","text":"Students will describe and explain consequences of changes to the surface of the Earth, including some common fast changes (e.g., landslides, volcanic eruptions, earthquakes), and some common slow changes (e.g., erosion, weathering).<br /><br /> The surface of the Earth changes. Some changes are due to slow processes such as erosion or weathering. Some changes are due to rapid processes such as landslides, volcanic eruptions and earthquakes.  Analyzing the changes to identify cause and effect relationships helps to define and understand the consequences."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C53A","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"SC-04-2.3.3","text":"Students will make generalizations and/or predictions about weather changes from day to day and over seasons based on weather data.<br /><br /> Weather changes from day to day and over seasons. Weather can be described by observations and measurable quantities such as temperature, wind direction, wind speed and precipitation. Data can be displayed and used to make predictions."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C53B","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"SC-04-2.3.4","text":"Students will identify patterns, recognize relationships and draw conclusions about the Earth-Sun system by interpreting a variety of representations/models (e.g., diagrams, sundials, distance of sun above horizon) of the sun's apparent movement in the sky.<br /><br />  Changes in movement of objects in the sky have patterns that can be observed, described and modeled. The Sun appears to move across the sky in the same way every day, but the Sun's apparent path changes slowly over seasons. Data collected can be used to identify patterns, recognize relationships and draw conclusions about the Earth and Sun system."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C53C","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"SC-04-2.3.5","text":"Students will understand that the moon appears to move across the sky on a daily basis much like the Sun. The observable shape of the moon can be described as it changes from day to day in a cycle that lasts about a month."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C53D","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"SC-05-2.3.1","text":"Students will: <ul> <li>describe the circulation of water (evaporation and condensation) from the surface of the Earth, through the crust, oceans and atmosphere (water cycle);</li> <li>explain how matter is conserved in this cycle.</li></ul> Water, which covers the majority of the Earth's surface, circulates through the crust, oceans and atmosphere in what is known as the water cycle. This cycle maintains the world's supply of fresh water. Students should have experiences that contribute to the understanding of evaporation, condensation and the conservation of matter."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C53E","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"SC-05-2.3.2","text":"Students will explain interactions of water with Earth materials and results of those interactions (e.g., dissolving minerals, moving minerals and gases).<br /><br /> Water dissolves minerals and gases and may carry them to the oceans."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C53F","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"SC-05-2.3.3","text":"Students will:<ul> <li>describe Earth's atmosphere as a relatively thin blanket of air consisting of a mixture of nitrogen, oxygen and trace gases, including water vapor;</li> <li>analyze atmospheric data in order to draw conclusions about real life phenomena related to atmospheric changes and conditions.</li></ul> Earth is surrounded by a relatively thin blanket of air called the atmosphere. The atmosphere is a mixture of nitrogen, oxygen and trace gases that include water vapor. The atmosphere has different properties at different elevations. Conclusions based on the interpretation of atmospheric data can be used to explain real life phenomena (e.g., pressurized cabins in airplanes, mountain-climber's need for oxygen)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C540","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"SC-05-2.3.4","text":"Students will:<ul> <li>analyze global patterns of atmospheric movement;</li> <li>explain the basic relationships of patterns of atmospheric movement to local weather.</li></ul> Global patterns of atmospheric movement can be observed and/or analyzed by interpreting patterns within data. Atmospheric movements influence local weather. Oceans have a major effect on climate, because water in the oceans holds a large amount of heat. Related data can be used to predict change in weather and climate."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C541","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"SC-05-2.3.5","text":"Students will compare components of our solar system, including using models/representations that illustrate the system.<br /><br /> Earth is the third planet from the Sun in a system that includes the moon, the Sun, eight other planets and their moons, and smaller objects. The Sun, an average star, is the central and largest body in the solar system. Models/diagrams provide understanding of scale within the solar system."}]}]},{"leaf":false,"text":"Unity and Diversity","children":[{"leaf":false,"text":"Biological Science","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C544","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"asn_statementNotation":"SC-EP-3.4.1","text":"Students will explain the basic needs of organisms.<br /><br /> Organisms have basic needs. For example, animals need air, water and food; plants need air, water, nutrients and light. Organisms can survive only in environments in which their needs can be met."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C545","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"asn_statementNotation":"SC-EP-3.4.2","text":"Students will understand that things in the environment are classified as living, nonliving and once living. Living things differ from nonliving things. Organisms are classified into groups by using various characteristics (e.g., body coverings, body structures)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C546","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"asn_statementNotation":"SC-EP-3.4.3","text":"Students will describe the basic structures and related functions of plants and animals that contribute to growth, reproduction and survival.<br /><br /> Each plant or animal has observable structures that serve different functions in growth, survival and reproduction. For example, humans have distinct body structures for walking, holding, seeing and talking. These observable structures should be explored to sort, classify, compare and describe organisms."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C547","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"asn_statementNotation":"SC-EP-3.4.4","text":"Students will describe a variety of plant and animal life cycles to understand patterns of the growth, development, reproduction and death of an organism.<br /><br /> Plants and animals have life cycles that include the beginning of life, growth and development, reproduction and death. The details of a life cycle are different for different organisms. Observations of different life cycles should be made in order to identify patterns and recognize similarities and differences."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C548","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"SC-04-3.4.1","text":"Students will:<ul> <li>compare the different structures and functions of plants and animals that contribute to the growth, survival and reproduction of the organisms;</li> <li>make inferences about the relationship between structure and function in organisms.</li></ul> Each plant or animal has structures that serve different functions in growth, survival and reproduction. For example, humans have distinct body structures for walking, holding, seeing and talking. Evidence about the relationship between structure and function should be used to make inferences and draw conclusions."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C549","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"SC-04-3.4.2","text":"Students will understand that things in the environment are classified as living, nonliving and once living. Living things differ from nonliving things. Organisms are classified into groups by using various characteristics (e.g., body coverings, body structures)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C54A","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"SC-04-3.4.3","text":"Students will compare a variety of life cycles of plants and animals in order to classify and make inferences about an organism.<br /><br /> Plants and animals have life cycles that include the beginning of life, growth and development, reproduction and death. The details of a life cycle are different for different organisms. Models of organisms' life cycles should be used to classify and make inferences about an organism."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C54B","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"SC-04-3.4.4","text":"Students will identify some characteristics of organisms that are inherited from the parents and others that are learned from interactions with the environment.<br /><br /> Observations of plants and animals yield the conclusion that organisms closely resemble their parents at some time in their life cycle. Some characteristics (e.g., the color of flowers, the number of appendages) are passed to offspring. Other characteristics are learned from interactions with the environment, such as the ability to ride a bicycle, and these cannot be passed on to the next generation. Explorations related to inherited versus learned characteristics should offer opportunities to collect data and draw conclusions about various groups of organisms."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C54C","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"SC-05-3.4.1","text":"Students will describe and compare living systems to understand the complementary nature of structure and function.<br /><br /> Observations and comparisons of living systems at all levels of organization illustrate the complementary nature of structure and function. Important levels of organization for structure and function include cells, tissues, organs, organ systems, organisms (e.g., bacteria, protists, fungi, plants, animals), and ecosystems. Examining the relationship between structure and function provides a basis for comparisons and classification schemes."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C54D","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"SC-05-3.4.2","text":"Students will explain the essential functions of cells necessary to sustain life.<br /><br /> Cells carry on the many functions needed to sustain life. Models of cells, both physical and analogical, promote understanding of their structures and functions. Cells grow and divide, thereby producing more cells. This requires that they take in nutrients, which provide energy for the work that cells do and make the materials that a cell needs."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C54E","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"SC-05-3.4.3","text":"Students will understand that all organisms are composed of cells, the fundamental unit of life. Most organisms are single cells; other organisms, including plants and animals are multicellular."}]}]},{"leaf":false,"text":"Biological Change","children":[{"leaf":false,"text":"Biological Science","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C551","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"asn_statementNotation":"SC-EP-3.5.1","text":"Students will describe fossils as evidence of organisms that lived long ago, some of which may be similar to others that are alive today.<br /><br /> Fossils found in Earth materials provide evidence about organisms that lived long ago and the nature of the environment at that time. Representations of fossils provide the basis for describing and drawing conclusions about the organisms and basic environments represented by them."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C552","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"SC-04-3.5.1","text":"Students will use representations of fossils to:<ul> <li>draw conclusions about the nature of the organisms and the basic environments that existed at the time;</li> <li>make inferences about the relationships to organisms that are alive today.</li></ul> Fossils found in Earth materials provide evidence about organisms that lived long ago and the nature of the environment at that time. Representations of fossils provide the basis for describing and drawing conclusions about the organisms and basic environments represented by them."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C553","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"SC-05-3.5.1","text":"Students will describe cause and effect relationships between enhanced survival/reproductive success and particular biological adaptations (e.g., changes in structures, behaviors, and/or physiology) to generalize about the diversity of populations of organisms.<br /><br /> Biological change over time accounts for the diversity of populations developed through gradual processes over many generations. Examining cause and effect relationships between enhanced survival/reproductive success and biological adaptations (e.g., changes in structures, behaviors, and/or physiology), based on evidence gathered, creates the basis for explaining diversity."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C554","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"SC-05-3.5.2","text":"Students will understand that all organisms must be able to obtain and use resources, grow, reproduce, and maintain stable internal conditions while living in a constantly changing external environment."}]}]},{"leaf":false,"text":"Energy Transformations","children":[{"leaf":false,"text":"Unifying Concepts","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C557","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"asn_statementNotation":"SC-EP-4.6.1","text":"Students will describe basic relationships of plants and animals in an ecosystem (food chains).<br /><br /> Plants make their own food. All animals depend on plants. Some animals eat plants for food. Other animals eat animals that eat the plants. Basic relationships and connections between organisms in food chains can be used to discover patterns within ecosystems."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C558","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"asn_statementNotation":"SC-EP-4.6.2","text":"Students will describe evidence of the sun providing light and heat to the Earth.<br /><br /> Simple observations and investigations begin to reveal that the Sun provides the light and heat necessary to maintain the temperature of Earth. Based on those experiences, the conclusion can be drawn that the Sun's light and heat are necessary to sustain life on Earth."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C559","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"asn_statementNotation":"SC-EP-4.6.3","text":"Students will analyze models of basic electrical circuits using batteries, bulbs and wires, in order to determine whether a simple circuit is open or closed.<br /><br /> Electricity in circuits can produce light. Describing and comparing models demonstrates basic understanding of circuits."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C55A","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"asn_statementNotation":"SC-EP-4.6.4","text":"Students will describe light as traveling in a straight line until it strikes an object.<br /><br /> Light can be observed and described as it travels in a straight line until it strikes an object."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C55B","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"SC-04-4.6.1","text":"Students will analyze patterns and make generalizations about the basic relationships of plants and animals in an ecosystem (food chain).<br /><br /> Plants make their own food. All animals depend on plants. Some animals eat plants for food. Other animals eat animals that eat the plants. Basic relationships and connections between organisms in food chains, including the flow of energy, can be used to discover patterns within ecosystems"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C55C","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"SC-04-4.6.2","text":"Students will:<ul> <li>analyze data/evidence of the Sun providing light and heat to earth;</li> <li>use data/evidence to substantiate the conclusion that the Sun's light and heat are necessary to sustaining life on Earth.</li></ul> Simple observations, experiments and data collection begin to reveal that the Sun provides the light and heat necessary to maintain the temperature of Earth. Evidence collected and analyzed should be used to substantiate the conclusion that the sun's light and heat are necessary to sustain life on Earth."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C55D","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"SC-04-4.6.3","text":"Students will evaluate a variety of models/representations of electrical circuits (open, closed, series, and/or parallel) to:<ul> <li>make predictions related to changes in the system;</li> <li>compare the properties of conducting and non-conducting materials.</li></ul> Electricity in circuits can produce light, heat and sound. Electrical circuits require a complete conducting path through which an electrical current can pass. Analysis of a variety of circuit models creates an opportunity to make predictions about circuits, as well as to demonstrate an understanding of the concepts of open and closed circuits and basic conducting and non-conducting materials."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C55E","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"SC-04-4.6.4","text":"Students will:<ul> <li>analyze models/representations of light in order to generalize about the behavior of light;</li> <li>represent the path of light as it interacts with a variety of surfaces (reflecting, refracting, absorbing).</li></ul> Light can be observed as traveling in a straight line until it strikes an object. Light can be reflected by a shiny object (e.g., mirror, spoon), refracted by a lens (e.g., magnifying glass, eyeglasses), or absorbed by an object (e.g., dark surface)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C55F","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"SC-04-4.6.5","text":"Students will:<ul> <li>identify ways that heat can be produced (e.g. burning, rubbing) and properties of materials that conduct heat better than others;</li> <li>describe the movement of heat between objects.</li></ul> Heat can be produced in many ways such as burning or rubbing. Heat moves from a warmer object to a cooler one by contact (conduction) or at a distance. Some materials absorb and conduct heat better than others. Simple investigations can illustrate that metal objects conduct heat better than wooden objects."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C560","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"SC-05-4.6.1","text":"Students will:<ul> <li>classify energy phenomena as kinetic or potential;</li> <li>describe the transfer of energy occurring in simple systems or related data.</li></ul> Energy can be classified as kinetic or potential.  Energy is a property of many substances and energy can be found in several different forms. For example, chemical energy as found in food we eat or in the gasoline we burn in our car.  Heat, light (solar), sound, electrical energy and the energy associated with motion (called kinetic energy) are examples of other forms of energy.  Objects can have energy simply by virtue of their position, called potential energy. Energy is transferred in many ways. Analyzing simple systems can provide the basis for describing the transfer of energy occurring within the system."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C561","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"SC-05-4.6.2","text":"Students will understand that the Sun is a major source of energy for changes on Earth's surface. The Sun loses energy by emitting light. A tiny fraction of that light reaches Earth, transferring energy from the Sun to Earth."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C562","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"SC-05-4.6.3","text":"Students will:<ul> <li>draw conclusions about the transfer of energy within models/representations of electrical circuits as evidenced by the heat, light, sound and magnetic effects that are produced;</li> <li>describe changes within the system that would affect the transfer of energy.</li></ul> Electrical circuits provide a means of transferring electrical energy. This transfer can be observed and described as heat, light, sound and magnetic effects are produced. Models and diagrams can be used to support conclusions and predict consequences of change within an electrical circuit."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C563","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"SC-05-4.6.4","text":"Students will identify predictable patterns and make generalizations about light and matter interactions using data/evidence.<br /><br /> Light energy interacts with matter by transmission (including refraction), absorption, or scattering (including reflection."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C564","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"SC-05-4.6.5","text":"Students will understand that heat energy moves in predictable ways, flowing from warmer objects to cooler ones, until both objects reach the same temperature. By examining cause and effect relationships, consequences of heat movement and conduction can be predicted and inferred."}]}]},{"leaf":false,"text":"Interdependence","children":[{"leaf":false,"text":"Unifying Concepts","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C567","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"asn_statementNotation":"SC-EP-4.7.1","text":"Students will describe the cause and effect relationships existing between organisms and their environments.<br /><br /> The world has many different environments. Organisms require an environment in which their needs can be met. When the environment changes some plants and animals survive and reproduce and others die or move to new locations."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C568","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"SC-04-4.7.1","text":"Students will make predictions and/or inferences based on patterns of evidence related to the survival and reproductive success of organisms in particular environments.<br /><br /> The world has many different environments. Distinct environments support the lives of different types of organisms. When the environment changes some plants and animals survive and reproduce and others die or move to new locations. Examples of environmental changes resulting in either increase or decrease in numbers of a particular organism should be explored in order to discover patterns and resulting cause and effect relationships between organisms and their environments (e.g., structures and behaviors that make an organism suited to a particular environment). Connections and conclusions should be made based on the data."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C569","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"SC-04-4.7.2","text":"Students will:<ul> <li>describe human interactions in the environment where they live;</li> <li>classify the interactions as beneficial or harmful to the environment using data/evidence to support conclusions.</li></ul> All organisms, including humans, cause changes in the environment where they live. Some of these changes are detrimental to the organism or to other organisms; other changes are beneficial (e.g., dams benefit some aquatic organisms but are detrimental to others). By evaluating the consequences of change using cause and effect relationships, solutions to real life situations/dilemmas can be proposed."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C56A","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"SC-05-4.7.1","text":"Students will:<ul> <li>describe and categorize populations of organisms according to the function they serve in an ecosystem (e.g., producers, consumers, decomposers);</li> <li>draw conclusions about the effects of changes to populations in an ecosystem.</li></ul> Populations of organisms can be categorized by the function they serve in an ecosystem. Plants and some microorganisms are producers because they make their own food. All animals, including humans, are consumers, and obtain their food by eating other organisms. Decomposers, primarily bacteria and fungi, are consumers that use waste materials and dead organisms for food. Food webs identify the relationships among producers, consumers and decomposers in an ecosystem. Using data gained from observing interacting components within an ecosystem, the effects of changes can be predicted."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C56B","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"SC-05-4.7.2","text":"Students will understand that a population consists of all individuals of a species that occur together at a given place and time. All populations living together and the physical factors with which they interact compose an ecosystem."}]}]}]},{"leaf":false,"text":"Middle School Science","children":[{"leaf":false,"text":"Structure and Transformation of Matter","children":[{"leaf":false,"text":"Physical Science","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C56E","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"SC-M6 1.1.1","text":"Students will explain how or why mixtures can be separated using physical properties.<br /><br /> A mixture of substances often can be separated into the original substances by using one or more of its characteristic physical properties."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C56F","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"SC-06-1.1.2","text":"Students will identify and describe evidence of chemical and physical changes in matter.<br /><br />  In chemical reactions, the total mass is conserved. Substances are often classified into groups if they react in similar ways. The patterns that allow classification can be used to infer or understand real life applications for those substances."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C570","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"SC-07-1.1.1","text":"Students will:<ul> <li>classify substances according to their chemical/reactive properties;</li> <li>infer real life applications for substances based on chemical/reactive properties.</li></ul> In chemical reactions, the total mass is conserved. Substances are often classified into groups if they react in similar ways. The patterns, which allow classification, can be used to infer or understand real life applications for those substances."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C571","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"SC-07-1.1.2","text":"Students will:<ul> <li>classify elements and compounds according to their properties;</li> <li>compare properties of different combinations of elements.</li></ul> Observations of simple experiments illustrate that the atoms of chemical elements do not break down during normal laboratory reactions such as heating, exposure to electric currents, or reaction with acids. Elements combine in many ways to produce compounds. Common patterns emerge when comparing and contrasting the properties of compounds to the elements from which they are made. Understanding of these patterns allows for evidence- based predictions of new or different combinations of elements/compounds."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C572","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"SC-08-1.1.1","text":"Students will:<ul> <li>interpret models/representations of elements;</li> <li>classify elements based upon patterns in their physical (e.g., density, boiling point, solubility) and chemical (e.g., flammability, reactivity) properties.</li></ul> Models enhance understanding that an element is composed of a single type of atom. Organization/interpretation of data illustrates that when elements are listed according to the number of protons, repeating patterns of physical (e.g., density, boiling point, solubility) and chemical properties (e.g., flammability, reactivity), can be used to identify families of elements with similar properties."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C573","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"SC-08-1.1.2","text":"Students will understand that matter is made of minute particles called atoms, and atoms are composed of even smaller components. The components of an atom have measurable properties such as mass and electrical charge. Each atom has a positively charged nucleus surrounded by negatively charged electrons. The electric force between the nucleus and the electrons holds the atom together."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C574","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"SC-08-1.1.3","text":"Students will understand that the atom's nucleus is composed of protons and neutrons that are much more massive than electrons."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C575","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"SC-08-1.1.4","text":"Students will describe interactions which cause the movement of each element among the solid Earth, oceans, atmosphere and organisms (biogeochemical cycles).<br /><br /> Earth is a system containing essentially a fixed amount of each stable chemical atom or element that can exist in several different reservoirs. The interactions within the earth system cause the movement of each element among reservoirs in the solid Earth, oceans, atmosphere and organisms as part of biogeochemical cycles."}]}]},{"leaf":false,"text":"Motion and Forces","children":[{"leaf":false,"text":"Physical Science","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C578","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"SC-06-1.2.1","text":"Students will describe friction and make inferences about its effects on the motion of an object.<br /><br /> When an unbalanced force (friction) acts on an object, the change in speed or direction depends on the size and direction of the force."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C579","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"SC-07-1.2.1","text":"Students will explain the cause and effect relationship between simple observable motion and unbalanced forces.<br /><br /> An object remains at rest or maintains a constant speed and direction of motion unless an unbalanced force acts on it (e.g., gravity). When an unbalanced force acts on an object, the change in speed or direction depends on the size and direction of the force."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C57A","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"SC-08-1.2.1","text":"Students will describe and explain the effects of balanced and unbalanced forces on motion as found in real-life phenomena.<br /><br /> Objects change their motion only when a net force is applied. Newton's Laws of Motion are used to describe the effects of forces on the motion of objects."}]}]},{"leaf":false,"text":"The Earth and the Universe","children":[{"leaf":false,"text":"Earth/Space Science","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C57D","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"SC-06-2.3.1","text":"Students will explain and predict phenomena (e.g., day, year, moon phases, eclipses) based on models/representations or data related to the motion of objects in the solar system (e.g., earth, sun, moon). <br /><br /> Observations and investigations of patterns indicate that most objects in the solar system are in regular and predictable motion. Evaluation of this data explains such phenomena as the day, the year, phases of the moon and eclipses."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C57E","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"SC-06-2.3.2","text":"Students will explain cause and effect relationships in the Rock cycle.<br /><br /> Materials found in the lithosphere and mantle are changed in a continuous process called the rock cycle, which can be investigated using a variety of models."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C57F","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"SC-06-2.3.3","text":"Students will compare constructive and destructive forces on Earth in order to make predictions about the nature of landforms.<br /><br /> Landforms are a result of a combination of constructive and destructive forces. Collection and analysis of data indicates that constructive forces include crustal deformation, faulting, volcanic eruption and deposition of sediment, while destructive forces include weathering and erosion."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C580","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"SC-07-2.3.1","text":"Students will make inferences and predictions related to changes in the Earth's surface or atmosphere based on data/evidence.<br /><br /> The Earth's processes we see today, including erosion, movement of lithospheric plates and changes in atmospheric composition, are predictable and similar to those that occurred in the past. Analysis of evidence from Earth's history substantiates the conclusion that the planet has also been influenced by occasional catastrophes such as the impact of an asteroid or comet."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C581","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"SC-07-2.3.2","text":"Students will explain the layers of the Earth and their interactions.<br /><br /> The use of models/diagrams/graphs helps illustrate that the Earth is layered. The lithosphere is the thin crust and the upper part of the mantle. Lithospheric plates move slowly in response to movements in the mantle. There is a dense core at the center of the Earth."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C582","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"SC-07-2.3.3","text":"Students will describe the concept of gravity and the effect of gravitational force between the sun, moon and Earth.<br /><br />  The gravitational pull of the Sun and moon on Earth's oceans as the major cause of tides can be understood from generalizations based on evidence."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C583","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"SC-08-2.3.1","text":"Students will describe various techniques for estimating geological time (radioactive dating, observing rock sequences, comparing fossils).<br /><br /> Techniques used to estimate geological time include using radioactive dating, observing rock sequences and comparing fossils to correlate the rock sequences at various locations. Deductions can be made based on available data and observation of models as to the age of rocks/fossils."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C584","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"SC-08-2.3.2","text":"Students will understand that earthquakes and volcanic eruptions can be observed on a human time scale, but many processes, such as mountain building and plate movements, take place over hundreds of millions of years."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C585","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"SC-08-2.3.3","text":"Students will:<ul> <li>explain the transfer of Earth's internal heat in the mantle (crustal movement, hotspots, geysers);</li> <li>describe the interacting components (convection currents) within the Earth's system.</li></ul> The outward transfer of Earth's internal heat drives convection circulation in the mantle. This causes the crustal plates to move on the face of the Earth."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C586","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"SC-08-2.3.4","text":"Students will understand that the Sun, Earth and the rest of the solar system formed approximately 4.6 billion years ago."}]}]},{"leaf":false,"text":"Unity and Diversity","children":[{"leaf":false,"text":"Biological Science","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C589","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"SC-06-3.4.1","text":"Students will describe the relationship between cells, tissues and organs in order to explain their function in multicellular organisms.<br /><br /> Specialized cells perform specialized functions in multicellular organisms. Groups of specialized cells cooperate to form tissues. Different tissues are, in turn, grouped together to form larger functional units called organs. Examination of cells, tissues and organs reveals that each type has a distinct structure and set of functions that serve the organism."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C58A","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"SC-06-3.4.2","text":"Students will make inferences about the factors influencing behavior based on data/evidence of various organism's behaviors.<br /><br /> Behavior is one kind of response an organism may make to an internal or environmental stimulus. Observations of organisms, data collection/analysis, support generalizations/conclusions that a behavioral response is a set of actions determined in part by heredity and in part from experience. A behavioral response requires coordination and communication at many levels including cells, organ systems and organisms."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C58B","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"SC-07-3.4.1","text":"Students will:<ul> <li>describe the role of genes/chromosomes in the passing of information from one generation to another (heredity);</li> <li>compare inherited and learned traits.</li></ul> Every organism requires a set of instructions for specifying its traits. This information is contained in genes located in the chromosomes of each cell that can be illustrated through the use of models. Heredity is the passage of these instructions from one generation to another and should be distinguished from learned traits."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C58C","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"SC-07-3.4.2","text":"Students will describe and compare sexual and asexual reproduction.<br /><br /> Reproduction is a characteristic of all living systems and is essential to the continuation of every species as evidenced through observable patterns. A distinction should be made between organisms that reproduce asexually and those that reproduce sexually. In species that reproduce sexually, including humans and plants, male and female sex cells carrying genetic information unite to begin the development of a new individual."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C58D","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"SC-08-3.4.1","text":"Students will explain the relationship between structure and function of the cell components using a variety of representations. <br /><br /> Observations of cells and analysis of cell representations point out that cells have particular structures that underlie their function. Every cell is surrounded by a membrane that separates it from the outside world. Inside the cell is a concentrated mixture of thousands of different molecules that form a variety of specialized structures. These structures carry out specific cell functions."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C58E","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"SC-08-3.4.2","text":"Students will understand that in the development of multicellular organisms, cells multiply (mitosis) and differentiate to form many specialized cells, tissues and organs. This differentiation is regulated through the expression of different genes."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C58F","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"SC-08-3.4.3","text":"Students will form or justify conclusions as to whether a response is innate or learned using data/evidence on behavioral responses to internal and external stimuli.<br /><br /> Behavioral responses to internal changes and external stimuli can be innate or learned. Responses to external stimuli can result from interactions with the organism's own species or other species, as well as environmental changes."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C590","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"SC-08-3.4.4","text":"Students will describe and explain patterns found within groups of organisms in order to make biological classifications of those organisms.<br /><br /> Observations and patterns found within groups of organisms allow for biological classifications based on how organisms are related."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C591","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"SC-08-3.4.5","text":"Students will understand that multicellular animals have nervous systems that generate behavior. Nerve cells communicate with each other by secreting specific molecules."}]}]},{"leaf":false,"text":"Biological Change","children":[{"leaf":false,"text":"Biological Science","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C594","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"SC-06-3.5.1","text":"Students will explain that biological change over time accounts for the diversity of species developed through gradual processes over many generations.<br /><br /> Biological adaptations include changes in structures, behaviors, or physiology that enhance survival and reproductive success in a particular environment."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C595","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"SC-06-3.5.2","text":"Students will understand that regulation of an organism's internal environment involves sensing the internal environment and changing physiological activities to keep conditions within the range required to survive. Maintaining a stable internal environment is essential for an organism's survival."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C596","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"SC-07-3.5.1","text":"Students will:<ul> <li>describe the usefulness of fossil information to make conclusions about past life forms and environmental conditions;</li> <li>explain the cause and effect relationship of the extinction of a species and environmental changes. </li></ul> Extinction of species is common and occurs when the adaptive characteristics of a species are insufficient to allow its survival. Most of the species that have lived on Earth no longer exist. Fossils provide evidence of how environmental conditions and life have changed."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C597","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"SC-08-3.5.1","text":"Students will draw conclusions and make inferences about the consequences of change over time that can account for the similarities among diverse species.<br /><br /> The consequences of change over time provide a scientific explanation for the fossil record of ancient life forms and for the striking molecular similarities observed among the diverse species of living organisms."}]}]},{"leaf":false,"text":"Energy Transformations","children":[{"leaf":false,"text":"Unifying Concepts","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C59A","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"SC-06-4.6.1","text":"Students will describe or explain the cause and effect relationships between oceans and climate. <br /><br /> Oceans have a major effect on climate, because water in the oceans holds a large amount of heat."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C59B","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"SC-06-4.6.2","text":"Students will describe:<ul> <li>the effect of the Suns' energy on the Earth system;</li> <li>the connection/relationship between the Sun's energy and seasons.</li></ul> The Sun is the major source of energy for Earth. The water cycle, winds, ocean currents and growth of plants are affected by the Sun's energy. Seasons result from variations in the amount of the Sun's energy hitting Earth's surface."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C59C","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"SC-06-4.6.3","text":"Students will understand that, on its own, heat travels only from higher temperature object/region to lower temperature object or region. Heat will continue to flow in this manner until the objects reach the same temperature. For example, a cup of hot water will continue to cool down until it comes to the same temperature as the surrounding area. Usually when heat is transferred to or from an object, the temperature changes. The temperature increases if heat is added and the temperature decreases if the heat is removed."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C59D","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"SC-07-4.6.1","text":"Students will understand that Earth systems have sources of energy that are internal and external to the Earth. The Sun is the major external source of energy."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C59E","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"SC-07-4.6.2","text":"Students will:<ul> <li>describe the transfer and/or transformations of energy which occur in examples that involve several different forms of energy (e.g., heat, electrical, light, motion of objects and chemical).</li> <li>Explain, qualitatively or quantitatively, that heat lost by hot object equals the heat gained by cold object.</li></ul>The transfer and transformation of energy can be examined in a variety of real life examples. Models are an appropriate way to convey the abstract/invisible transfer of energy in a system.  Heat energy is the disorderly motion of molecules. Heat can be transferred through materials by the collisions of atoms or across space by radiation. If the material is fluid, currents will be set up in it that aid the transfer of heat. To change something's speed, to bend or stretch things, to heat or cool them, to push things together, to expand or contract them or tear them apart all require transfers (and some transformations) of energy. Heat lost by hot object equals the heat gained by cold object. This is an energy conservation statement. Whenever hot and cold objects are put in contact, heat energy always transfers from the hot object to the cold object and this continues until all the mass is at the same temperature. Students should understand that heat produced by burning comes from the release of chemical energy of the substance."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C59F","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"SC-07-4.6.3","text":"Students will understand that waves are one way that energy is transferred. Types of waves include sound, light, earthquake, ocean and electromagnetic."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C5A0","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"SC-07-4.6.4","text":"Students will describe or represent the flow of energy in ecosystems, using data to draw conclusions about the role of organisms in an ecosystem.<br /><br /> For most ecosystems, the major source of energy is sunlight. Energy entering ecosystems as sunlight is transferred by producers into chemical energy through photosynthesis. That energy then passes from organism in food webs."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C5A1","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"SC-08-4.6.1","text":"Students will:<ul> <li>explain the cause and effect relationships between global climate and energy transfer;</li> <li>use evidence to make inferences or predictions about global climate issues.</li></ul><br /> Global climate is determined by energy transfer from the Sun at and near Earth's surface."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C5A2","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"SC-08-4.6.2","text":"Students will:<ul> <li>describe or explain energy transfer and energy conservation;</li> <li>evaluate alternative solutions to energy problems.</li></ul><br /> Energy can be transferred in many ways, but it can neither be created nor destroyed."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C5A3","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"SC-08-4.6.3","text":"Students will understand that all energy can be considered to be kinetic energy, potential energy, or energy contained by a field (e.g., electric, magnetic, gravitational)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C5A4","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"SC-08-4.6.4","text":"Students will:<ul> <li>analyze information/data about waves and energy transfer;</li> <li>describe the transfer of energy via waves in real life phenomena.</li></ul><br /> Waves, including sound and seismic waves, waves on water and electromagnetic waves, can transfer energy when they interact with matter."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C5A5","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"SC-08-4.6.5","text":"Students will:<ul> <li>describe the relationships between organisms and energy flow in ecosystems (food chains and energy pyramids);</li> <li>explain the effects of change to any component of the ecosystem.</li></ul><br /> Energy flows through ecosystems in one direction from photosynthetic organisms to herbivores to carnivores and decomposers."}]}]},{"leaf":false,"text":"Interdependence","children":[{"leaf":false,"text":"Unifying Concepts","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C5A8","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"SC-06-4.7.1","text":"Students will describe the consequences of change in one or more abiotic factors on a population within an ecosystem.<br /><br /> The number of organisms an ecosystem can support depends on the resources available and abiotic factors (e.g., quantity of light and water, range of temperatures, soil composition)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C5A9","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"SC-07-4.7.1","text":"Students will compare abiotic and biotic factors in an ecosystem in order to explain consequences of change in one or more factors.<br /><br /> The number of organisms an ecosystem can support depends on the resources available and abiotic factors (e.g., quantity of light and water, range of temperatures, soil composition). Given adequate biotic and abiotic resources and no diseases or predators, populations (including humans) increase at rapid rates. Lack of resources and other factors, such as predation and climate, limit the growth of populations in specific niches in the ecosystem."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C5AA","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"SC-08-4.7.1","text":"Students will describe the interrelationships and interdependencies within an ecosystem and predict the effects of change on one or more components within an ecosystem.<br /><br /> Organisms both cooperate and compete in ecosystems. Often changes in one component of an ecosystem will have effects on the entire system that are difficult to predict. The interrelationships and interdependencies of these organisms may generate ecosystems that are stable for hundreds or thousands of years."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C5AB","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"SC-08-4.7.2","text":"Students will:<ul> <li>explain the interactions of the components of the Earth system (e.g., solid Earth, oceans, atmosphere, living organisms); </li> <li>propose solutions to detrimental interactions.</li></ul> Interactions among the solid Earth, the oceans, the atmosphere and living things have resulted in the ongoing development of a changing Earth system."}]}]}]},{"leaf":false,"text":"High School Science","children":[{"leaf":false,"text":"Structure and Transformation of Matter","children":[{"leaf":false,"text":"Physical Science","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C5AE","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC-HS-1.1.1","text":"Students will classify or make generalizations about elements from data of observed patterns in atomic structure and/or position on the periodic table.<br /><br /> The periodic table is a consequence of the repeating pattern of outermost electrons."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C5AF","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC-HS-1.1.2","text":"Students will understand that the atom's nucleus is composed of protons and neutrons that are much more massive than electrons. When an element has atoms that differ in the number of neutrons, these atoms are called different isotopes of the element."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C5B0","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC-HS-1.1.3","text":"Students will understand that solids, liquids and gases differ in the distances between molecules or atoms and therefore the energy that binds them together. In solids, the structure is nearly rigid; in liquids, molecules or atoms move around each other but do not move apart; and in gases, molecules or atoms move almost independently of each other and are relatively far apart. The behavior of gases and the relationship of the variables influencing them can be described and predicted."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C5B1","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC-HS-1.1.4","text":"Students will understand that in conducting materials, electrons flow easily; whereas, in insulating materials, they can hardly flow at all. Semiconducting materials have intermediate behavior. At low temperatures, some materials become superconductors and offer no resistance to the flow of electrons."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C5B2","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC-HS-1.1.5","text":"Students will explain the role of intermolecular or intramolecular interactions on the physical properties (solubility, density, polarity, conductivity, boiling/melting points) of compounds.<br /><br /> The physical properties of compounds reflect the nature of the interactions among molecules. These interactions are determined by the structure of the molecule including the constituent atoms."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C5B3","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC-HS-1.1.6","text":"Students will:<ul> <li>identify variables that affect reaction rates;</li> <li>predict effects of changes in variables (concentration, temperature, properties of reactants, surface area and catalysts) based on evidence/data from chemical reactions.</li></ul> Rates of chemical reactions vary. Reaction rates depend on concentration, temperature and properties of reactants. Catalysts speed up chemical reactions."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C5B4","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC-HS-1.1.7","text":"Students will:<ul> <li>construct diagrams to illustrate ionic or covalent bonding;</li> <li>predict compound formation and bond type as either ionic or covalent (polar, nonpolar) and represent the products formed with simple chemical formulas.</li></ul> Bonds between atoms are created when outer electrons are paired by being transferred (ionic) or shared (covalent). A compound is formed when two or more kinds of atoms bind together chemically."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C5B5","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC-HS-1.1.8","text":"Students will:<ul> <li>explain the importance of chemical reactions in a real-world context;</li> <li>justify conclusions using evidence/data from chemical reactions.</li></ul> Chemical reactions (e.g., acids and bases, oxidation, combustion of fuels, rusting, tarnishing) occur all around us and in every cell in our bodies. These reactions may release or absorb energy."}]}]},{"leaf":false,"text":"Motion and Forces","children":[{"leaf":false,"text":"Physical Science","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C5B8","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC-HS-1.2.1","text":"Students will:<ul> <li>select or construct accurate and appropriate representations for motion (visual, graphical and mathematical); </li> <li>defend conclusions/explanations about the motion of objects and real-life phenomena from evidence/data. </li></ul> Objects change their motion only when a net force is applied. Newton's Laws of motion are used to describe the effects of forces on the motion of objects. Conservation of mechanical energy and conservation of momentum may also be used to predict motion."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C5B9","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC-HS-1.2.2","text":"Students will:<ul> <li>explain the relationship between electricity and magnetism;</li> <li>propose solutions to real life problems involving electromagnetism.</li></ul> Electricity and magnetism are two aspects of a single electromagnetic force. Moving electric charges produce magnetic forces or \"fields\" and moving magnets produce electric forces or \"fields\". This idea underlies the operation of electric motors and generators."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C5BA","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC-HS-1.2.3","text":"Students will understand that the electric force is a universal force that exists between any two charged objects. Opposite charges attract while like charges repel."}]}]},{"leaf":false,"text":"The Earth and the Universe","children":[{"leaf":false,"text":"Earth/Space Science","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C5BE","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC-HS-2.3.1","text":"Students will:<ul> <li>explain phenomena (falling objects, planetary motion, satellite motion) related to gravity; </li> <li>describe the factors that affect gravitational force.</li></ul> Gravity is a universal force that each mass exerts on every other mass."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C5BF","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC-HS-2.3.2","text":"Students will:<ul> <li>describe the current scientific theory of the formation of the universe (Big Bang) and its evidence; </li> <li>explain the role of gravity in the formation of the universe and it's components.</li></ul> The current and most widely accepted scientific theory of the mechanism of formation of the universe (Big Bang) places the origin of the universe at a time between 10 and 20 billion years ago, when the universe began in a hot dense state. According to this theory, the universe has been expanding since then. Early in the history of the universe, the first atoms to form were mainly hydrogen and helium. Over time, these elements clump together by gravitational attraction to form trillions of stars."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C5C0","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC-HS-2.3.3","text":"Students will explain the origin of the heavy elements in planetary objects (planets, stars).  Some stars explode at the end of their lives, and the heavy elements they have created are blasted out into space to form the next generation of stars and planets."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C5C1","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC-HS-2.3.4","text":"Students will understand that stars have life cycles of birth through death that are analogous to those of living organisms. During their lifetimes, stars generate energy from nuclear fusion reactions that create successively heavier chemical elements."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C5C2","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC-HS-2.3.5","text":"Students will understand that the Sun, Earth and the rest of the solar system formed approximately 4.6 billion years ago from a nebular cloud of dust and gas."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C5C3","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC-HS-2.3.6","text":"Students will:<ul> <li>compare the limitations/benefits of various techniques ( radioactive dating, observing rock sequences and comparing fossils) for estimating geological time; </li> <li>justify deductions about age of geologic features.</li></ul> Techniques used to estimate geological time include using radioactive dating, observing rock sequences and comparing fossils to correlate the rock sequences at various locations."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C5C4","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC-HS-2.3.7","text":"Students will:<ul> <li>explain real-life phenomena caused by the convection of the Earth's mantle; </li> <li>predict the consequences of this motion on humans and other living things on the planet.</li></ul> The outward transfer of Earth's internal heat drives convection circulation in the mantle. This causes the crustal plates to move on the face of the Earth."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C5C5","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC-HS-2.3.8","text":"Students will predict consequences of both rapid (volcanoes, earthquakes) and slow (mountain building, plate movement) earth processes from evidence/data and justify reasoning.<br /><br /> The Earth's surface is dynamic; earthquakes and volcanic eruptions can be observed on a human time scale, but many processes, such as mountain building and plate movements, take place over hundreds of millions of years."}]}]},{"leaf":false,"text":"Unity and Diversity","children":[{"leaf":false,"text":"Biological Science","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C5C8","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC-HS-3.4.1","text":"Students will explain the role of DNA in protein synthesis.<br /><br /> Cells store and use information to guide their functions. The genetic information stored in DNA directs the synthesis of the thousands of proteins that each cell requires. Errors that may occur during this process may result in mutations that may be harmful to the organism."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C5C9","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC-HS-3.4.2","text":"Students will understand that most cell functions involve chemical reactions. Food molecules taken into cells react to provide the chemical constituents needed to synthesize other molecules. Both breakdown and synthesis are made possible by a large set of protein catalysts, called enzymes. The breakdown of some of the food molecules enables the cell to store energy in specific chemicals that are used to carry out the many functions of the cell."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C5CA","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC-HS-3.4.3","text":"Students will:<ul> <li>describe cell regulation (enzyme function, diffusion, osmosis, homeostasis); </li> <li>predict consequences of internal/external environmental change on cell function/regulation.</li></ul> Cell functions are regulated. Regulation occurs both through changes in the activity of the functions performed by proteins and through selective expression of individual genes. This regulation allows cells to respond to their internal and external environments and to control and coordinate cell growth and division."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C5CB","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC-HS-3.4.4","text":"Students will understand that plant cells contain chloroplasts, the site of photosynthesis. Plants and many microorganisms (e.g., Euglena) use solar energy to combine molecules of carbon dioxide and water into complex, energy-rich organic compounds and release oxygen to the environment. This process of photosynthesis provides a vital link between the Sun and energy needs of living systems."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C5CC","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC-HS-3.4.5","text":"Students will:<ul> <li>explain the relationship between sexual reproduction (meiosis) and the transmission of genetic information;</li> <li>draw conclusions/make predictions based on hereditary evidence/data (pedigrees, punnet squares).</li></ul> Multicellular organisms, including humans, form from cells that contain two copies of each chromosome. This explains many features of heredity. Transmission of genetic information through sexual reproduction to offspring occurs when male and female gametes, that contain only one representative from each chromosome pair, unite."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C5CD","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC-HS-3.4.6","text":"Students will understand that in all organisms and viruses, the instructions for specifying the characteristics are carried in nucleic acids. The chemical and structural properties of nucleic acids determine how the genetic information that underlies heredity is both encoded in genes and replicated."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C5CE","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC-HS-3.4.7","text":"Students will:<ul> <li>classify organisms into groups based on similarities;</li> <li>infer relationships based on internal and external structures and chemical processes.</li></ul> Biological classifications are based on how organisms are related. Organisms are classified into a hierarchy of groups and subgroups based on similarities that reflect their relationships. Species is the most fundamental unit of classification. Different species are classified by the comparison and analysis of their internal and external structures and the similarity of their chemical processes."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C5CF","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC-HS-3.4.8","text":"Students will understand that multicellular animals have nervous systems that generate behavior. Nerve cells communicate with each other by secreting specific molecules. Specialized cells in sense organs detect light, sound and specific chemicals enabling animals to monitor what is going on in the world around them."}]}]},{"leaf":false,"text":"Biological Change","children":[{"leaf":false,"text":"Biological Science","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C5D2","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC-HS-3.5.1","text":"Students will:<ul> <li>predict the impact on species of changes to 1) the potential for a species to increase its numbers, (2) the genetic variability of offspring due to mutation and recombination of genes, (3) a finite supply of the resources required for life, or (4) natural selection;</li> <li>propose solutions to real-world problems of endangered and extinct species.</li></ul> Species change over time. Biological change over time is the consequence of the interactions of (1) the potential for a species to increase its numbers, (2) the genetic variability of offspring due to mutation and recombination of genes, (3) a finite supply of the resources required for life and (4) natural selection. The consequences of change over time provide a scientific explanation for the fossil record of ancient life forms and for the striking molecular similarities observed among the diverse species of living organisms. Changes in DNA (mutations) occur spontaneously at low rates. Some of these changes make no difference to the organism, whereas others can change cells and organisms. Only mutations in germ cells have the potential to create the variation that changes an organism's future offspring."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C5D3","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC-HS-3.5.2","text":"Students will:<ul> <li>predict the success of patterns of adaptive behaviors based on evidence/data;</li> <li>justify explanations of organism survival based on scientific understandings of behavior.</li></ul> The broad patterns of behavior exhibited by organisms have changed over time through natural selection to ensure reproductive success. Organisms often live in unpredictable environments, so their behavioral responses must be flexible enough to deal with uncertainty and change. Behaviors often have an adaptive logic."}]}]},{"leaf":false,"text":"Energy Transformations","children":[{"leaf":false,"text":"Unifying Concepts","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C5D6","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC-HS-4.6.1","text":"Students will:<ul> <li>explain the relationships and connections between matter, energy, living systems and the physical environment;</li> <li>give examples of conservation of matter and energy.</li></ul> As matter and energy flow through different organizational levels (e.g., cells, organs, organisms, communities) and between living systems and the physical environment, chemical elements are recombined in different ways. Each recombination results in storage and dissipation of energy into the environment as heat. Matter and energy are conserved in each change."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C5D7","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC-HS-4.6.2","text":"Students will:<ul> <li>predict wave behavior and energy transfer;</li> <li>apply knowledge of waves to real life phenomena/investigations.</li></ul> Waves, including sound and seismic waves, waves on water and electromagnetic waves, can transfer energy when they interact with matter. Apparent changes in frequency can provide information about relative motion."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C5D8","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC-HS-4.6.3","text":"Students will understand that electromagnetic waves, including radio waves, microwaves, infrared radiation, visible light, ultraviolet radiation, x-rays and gamma rays result when a charged object is accelerated."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C5D9","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC-HS-4.6.4","text":"Students will:<ul> <li>describe the components and reservoirs involved in biogeochemical cycles ( water, nitrogen, carbon dioxide and oxygen);</li> <li>explain the movement of matter and energy in biogeochemical cycles and related phenomena.</li></ul> The total energy of the universe is constant. Energy can change forms and/or be transferred in many ways, but it can neither be created nor destroyed. Movement of matter between reservoirs is driven by Earth's internal and external sources of energy. These movements are often accompanied by a change in physical and chemical properties of the matter. Carbon, for example, occurs in carbonate rocks such as limestone, in the atmosphere as carbon dioxide gas, in water as dissolved carbon dioxide and in all organisms as complex molecules that control the chemistry of life."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C5DA","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC-HS-4.6.5","text":"Students will describe and explain the role of carbon-containing molecules and chemical reactions in energy transfer in living systems.<br /><br /> Living systems require a continuous input of energy to maintain their chemical and physical organization since the universal tendency is toward more disorganized states. The energy for life primarily derives from the Sun. Plants capture energy by absorbing light and using it to break weaker bonds in reactants (such as carbon dioxide and water) in chemical reactions that result in the formation of carbon-containing molecules. These molecules can be used to assemble larger molecules (e.g., DNA, proteins, sugars, fats). In addition, the energy released when these molecules react with oxygen to form very strong bonds can be used as sources of energy for life processes."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C5DB","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC-HS-4.6.6","text":"Students will understand that heat is the manifestation of the random motion and vibrations of atoms."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C5DC","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC-HS-4.6.7","text":"Students will:<ul> <li>explain real world applications of energy using information/data;</li> <li>evaluate explanations of mechanical systems using current scientific knowledge about energy.</li></ul> The universe becomes less orderly and less organized over time. Thus, the overall effect is that the energy is spread out uniformly. For example, in the operation of mechanical systems, the useful energy output is always less than the energy input; the difference appears as heat."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C5DD","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC-HS-4.6.8","text":"Students will:<ul> <li>describe the connections between the functioning of the Earth system and its sources of energy (internal and external);</li> <li>predict the consequences of changes to any component of the Earth system.</li></ul> Earth systems have sources of energy that are internal and external to the Earth. The Sun is the major external source of energy. Two primary sources of internal energy are the decay of radioactive isotopes and the gravitational energy from Earth's original formation."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C5DE","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC-HS-4.6.9","text":"Students will:<ul> <li>explain the cause and effect relationship between global climate and weather patterns and energy transfer (cloud cover, location of mountain ranges, oceans);</li> <li>predict the consequences of changes to the global climate and weather patterns.</li></ul> Global climate is determined by energy transfer from the Sun at and near Earth's surface. This energy transfer is influenced by dynamic processes such as cloud cover and the Earth's rotation and static conditions such as the position of mountain ranges and oceans."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C5DF","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC-HS-4.6.10","text":"Students will:<ul> <li>identify the components and mechanisms of energy stored and released from food molecules (photosynthesis and respiration);</li> <li>apply information to real-world situations.</li></ul> Energy is released when the bonds of food molecules are broken and new compounds with lower energy bonds are formed. Cells usually store this energy temporarily in the phosphate bonds of adenosine triphosphate  (ATP). During the process of cellular respiration, some energy is lost as heat."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C5E0","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC-HS-4.6.11","text":"Students will:<ul> <li>explain the difference between alpha and beta decay, fission and fusion;</li> <li>identify the relationship between nuclear reactions and energy.</li></ul> Nuclear reactions convert a fraction of the mass of interacting particles into energy, and they can release much greater amounts of energy than atomic interactions. Fission is the splitting of a large nucleus into smaller pieces. Fusion is the joining of two nuclei at extremely high temperature and pressure. Fusion is the process responsible for the energy of the Sun and other stars."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C5E1","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC-HS-4.6.12","text":"Students will understand that the forces that hold the nucleus together, at nuclear distances, are usually stronger than the forces that would make it fly apart."}]}]},{"leaf":false,"text":"Interdependence","children":[{"leaf":false,"text":"Unifying Concepts","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C5E4","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC-HS-4.7.1","text":"Students will:<ul> <li>analyze relationships and interactions among organisms in ecosystems;</li> <li>predict the effects on other organisms of changes to one or more components of the ecosystem.</li></ul> Organisms both cooperate and compete in ecosystems. Often changes in one component of an ecosystem will have effects on the entire system that are difficult to predict. The interrelationships and interdependencies of these organisms may generate ecosystems that are stable for hundreds or thousands of years."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C5E5","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC-HS-4.7.2","text":"Students will:<ul> <li>evaluate proposed solutions from multiple perspectives to environmental problems caused by human interaction;</li> <li>justify positions using evidence/data.</li></ul> Human beings live within the world's ecosystems. Human activities can deliberately or inadvertently alter the dynamics in ecosystems. These activities can threaten current and future global stability and, if not addressed, ecosystems can be irreversibly affected."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C5E6","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC-HS-4.7.3","text":"Students will<ul> <li>predict the consequences of changes to any component (atmosphere, solid Earth, oceans, living things) of the Earth System;</li> <li>propose justifiable solutions to global problems.</li></ul> Interactions among the solid Earth, the oceans, the atmosphere and living things have resulted in the ongoing development of a changing Earth system."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C5E7","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC-HS-4.7.4","text":"Students will understand that evidence for one-celled forms of life, the bacteria, extends back more than 3.5 billion years. The changes in life over time caused dramatic changes in the composition of the Earth's atmosphere, which did not originally contain oxygen."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S103C5E8","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SC-HS-4.7.5","text":"Students will:<ul> <li>predict the consequences of changes in resources to a population;</li> <li>select or defend solutions to real-world problems of population control.</li></ul> Living organisms have the capacity to produce populations of infinite size. However, behaviors, environments and resources influence the size of populations. Models (e.g., mathematical, physical, conceptual) can be used to make predictions about changes in the size or rate of growth of a population."}]}]}]}]