[{"leaf":false,"text":"STANDARD 1:  THE TEACHER DEMONSTRATES APPLIED CONTENT KNOWLEDGE<br/> The teacher demonstrates a current and sufficient academic knowledge of certified content areas to develop student knowledge and performance in those areas.","children":[{"leaf":false,"text":"1.1 Communicates concepts, processes, and knowledge.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A92","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Accurately and effectively communicates concepts, processes and/or knowledge and uses vocabulary that is clear, correct and appropriate for students. (Initial-Level Performance)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A93","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Accurately and effectively communicates an in-depth understanding of concepts, processes, and/or knowledge in ways that contribute to the learning of all students. (Advanced-Level Performance)"}]},{"leaf":false,"text":"1.2 Connects content to life experiences of student.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A94","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Effectively connects most content, procedures, and activities with relevant life experiences of students. (Initial-Level Performance)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A95","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Effectively connects content to students' life experiences including, when appropriate, prior learning in the content area or other content areas. (Advanced-Level Performance)"}]},{"leaf":false,"text":"1.3 Demonstrates instructional strategies that are appropriate for content and contribute to student learning.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A96","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Uses instructional strategies that are clearly appropriate for the content and processes of the lesson and make a clear contribution to student learning. (Initial-Level Performance)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A97","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Consistently uses instructional strategies that are appropriate for content and contribute to the learning of all students. (Advanced-Level Performance)"}]},{"leaf":false,"text":"1.4 Guides students to understand content from various perspectives.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A98","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Provides opportunities and guidance for students to consider lesson content from different perspectives to extend their understanding. (Initial-Level Performance)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A99","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Regularly guides students to understand content from appropriate diverse, multicultural, or global perspectives. (Advanced-Level Performance)"}]},{"leaf":false,"text":"1.5 Identifies and addresses students' misconceptions of content.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A9A","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Identifies misconceptions related to content and addresses them during planning and instruction. (Initial-Level Performance)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A9B","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Consistently anticipates misconceptions related to content and addresses them by using appropriate instructional practices. (Advanced-Level Performance)"}]}]},{"leaf":false,"text":"STANDARD 2:  THE TEACHER DESIGNS AND PLANS INSTRUCTION<br/> The teacher designs/plans instruction that develops student abilities to use communication skills, apply core concepts, become self-sufficient individuals, become responsible team members, think and solve problems, and integrate knowledge.","children":[{"leaf":false,"text":"2.1 Develops significant objectives aligned with standards.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A88","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"States learning objectives that reflect key concepts of the discipline and are aligned with local or state standards. (Initial-Level Performance)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A89","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Develops challenging and appropriate learning objectives that are aligned with local/state/national standards and are based on students' needs, interests and abilities. (Advanced-Level Performance)"}]},{"leaf":false,"text":"2.2 Uses contextual data to design instruction relevant to students.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A8A","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Plans and designs instruction based on contextual (i.e., student, community, and/or cultural) and pre-assessment data. (Initial-Level Performance)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A8B","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Plans and designs instruction that is based on significant contextual and pre-assessment data. (Advanced-Level Performance)"}]},{"leaf":false,"text":"2.3 Plans assessments to guide instruction and measure learning objectives.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A8C","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Prepares assessments that measure student performance on each objective and help guide teaching. (Initial-Level Performance)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A8D","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Develops well-designed assessments that align with learning objectives, guide instruction, and measure learning results. (Advanced-Level Performance)"}]},{"leaf":false,"text":"2.4 Plans instructional strategies and activities that address learning objectives for all students.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A8E","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Aligns instructional strategies and activities with learning objectives for all students. (Initial-Level Performance)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A8F","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Plans a learning sequence using instructional strategies and activities that build on students' prior knowledge and address learning objectives. (Advanced-Level Performance)"}]},{"leaf":false,"text":"2.5 Plans instructional strategies and activities that facilitate multiple levels of learning.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A90","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Plans instructional strategies that include several levels of learning that require higher order thinking. (Initial-Level Performance)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A91","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Plans a learning sequence using strategies and activities that foster the development of higher-order thinking. (Advanced-Level Performance)"}]}]},{"leaf":false,"text":"STANDARD 3:  THE TEACHER CREATES AND MAINTAINS LEARNING CLIMATE<br/> The teacher creates a learning climate that supports the development of student abilities to use communication skills, apply core concepts, become self-sufficient individuals, become responsible team members, think and solve problems, and integrate knowledge.","children":[{"leaf":false,"text":"3.1 Communicates high expectations.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A7E","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Sets significant and challenging objectives for students and verbally/nonverbally communicates confidence in students' ability to achieve these objectives. (Initial-Level Performance)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A7F","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Consistently Sets significant and challenging behavioral and learning expectations for all students and communicates confidence in their ability to achieve those expectations. (Advanced-Level Performance)"}]},{"leaf":false,"text":"3.2 Establishes a positive learning environment.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A80","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Establishes clear standards of conduct, shows awareness of student behavior, and responds in ways that are both appropriate and respectful of students. (Initial-Level Performance)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A81","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Maintains a fair, respectful, and productive classroom environment conducive to learning. (Advanced-Level Performance)"}]},{"leaf":false,"text":"3.3 Values and supports student diversity and addresses individual needs.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A82","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Uses a variety of strategies and methods to supports student diversity by addressing individual needs. (Initial-Level Performance)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A83","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Consistently uses appropriate and responsive instructional strategies that address the needs of all students. (Advanced-Level Performance)"}]},{"leaf":false,"text":"3.4 Fosters mutual respect between teacher and students and among students.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A84","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Treats all students with respect and concern and monitors student interactions to encourage students to treat each other with respect and concern. (Initial-Level Performance)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A85","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Consistently treats all students with respect and concern and actively encourages students to treat each other with respect and concern. (Advanced-Level Performance)"}]},{"leaf":false,"text":"3.5 Provides a safe environment for learning.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A86","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Creates a classroom environment that is both emotionally and physically safe for all students. (Initial-Level Performance)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A87","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Maintains a classroom environment that is both emotionally and physically safe for all students. (Advanced-Level Performance)"}]}]},{"leaf":false,"text":"STANDARD 4:  THE TEACHER IMPLEMENTS AND MANAGES INSTRUCTION<br/> The teacher introduces/implements/manages instruction that develops student abilities to use communication skills, apply core concepts, become self-sufficient individuals, become responsible team members, think and solve problems, and integrate knowledge.","children":[{"leaf":false,"text":"4.1 Uses a variety of instructional strategies that align with learning objectives and actively engage students.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A74","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Uses a variety of instructional strategies that engage students throughout the lesson on tasks aligned with learning objectives. (Initial-Level Performance)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A75","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Consistently provides a well-planned sequence of appropriate instructional strategies that actively engage students in meeting learning objectives. (Advanced-Level Performance)"}]},{"leaf":false,"text":"4.2 Implements instruction based on diverse student needs and assessment data.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A76","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Implements instruction based on contextual information and assessment data. (Initial-Level Performance)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A77","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Implements instruction based on contextual information and assessment data, adapting instruction to unanticipated circumstances. (Advanced-Level Performance)"}]},{"leaf":false,"text":"4.3 Uses time effectively.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A78","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Establishes efficient procedures for performing non-instructional tasks, handling materials and supplies, managing transitions, and organizing and monitoring group work so that there is minimal loss of instructional time. (Initial-Level Performance)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A79","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Makes thoughtful choices about the organization and implementation of both instructional and non-instructional tasks to maximize time for student learning. (Advanced-Level Performance)"}]},{"leaf":false,"text":"4.4 Uses space and materials effectively.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A7A","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Uses classroom space and materials effectively to facilitate student learning. (Initial-Level Performance)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A7B","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Makes optimal use of classroom space and uses a variety of instructional resources and technologies to enhance student learning. (Advanced-Level Performance)"}]},{"leaf":false,"text":"4.5 Implements and manages instruction in ways that facilitate higher order thinking.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A7C","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Instruction provides opportunity to promote higher-order thinking. (Initial-Level Performance)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A7D","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Consistently uses a variety of appropriate strategies to facilitate higher-order thinking. (Advanced-Level Performance)"}]}]},{"leaf":false,"text":"STANDARD 5:  THE TEACHER ASSESSES AND COMMUNICATES LEARNING RESULTS<br/> The teacher assesses learning and communicates results to students and others with respect to student abilities to use communication skills, apply core concepts, become self-sufficient individuals, become responsible team members, think and solve problems, and integrate knowledge.","children":[{"leaf":false,"text":"5.1 Uses pre-assessments.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A68","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Uses a variety of pre-assessments to establish baseline knowledge and skills for all students. (Initial-Level Performance)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A69","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Consistently uses student baseline data from appropriate pre-assessments to promote the learning of all students. (Advanced-Level Performance)"}]},{"leaf":false,"text":"5.2 Uses formative assessments.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A6A","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Uses a variety of formative assessments to determine each student's progress and guide instruction. (Initial-Level Performance)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A6B","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Consistently uses appropriate formative assessments to determine student progress, guide instruction, and provide feedback to students. (Advanced-Level Performance)"}]},{"leaf":false,"text":"5.3 Uses summative assessments.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A6C","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Uses a variety of summative assessments to measure student achievement. (Initial-Level Performance)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A6D","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Consistently uses appropriate summative assessments aligned with the learning objectives to measure student achievement. (Advanced-Level Performance)"}]},{"leaf":false,"text":"5.4 Describes, analyzes, and evaluates student performance data.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A6E","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Describes, analyzes, and evaluates student performance data to determine progress of individuals and identify differences in progress among student groups. (Initial-Level Performance)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A6F","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Consistently describes, analyzes, and evaluates student performance data to determine student progress, identify differences among student groups, and inform instructional practice. (Advanced-Level Performance)"}]},{"leaf":false,"text":"5.5 Communicates learning results to students and parents.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A70","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Communicates learning results to students and parents that provide a clear and timely understanding of learning progress relative to objectives. (Initial-Level Performance)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A71","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Clearly communicates to students and parents in a timely manner the evidence of student performance and recommends future actions. (Advanced-Level Performance)"}]},{"leaf":false,"text":"5.6 Allows opportunity for student self-assessment.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A72","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Promotes opportunities for students to engage in accurate self-assessment of learning. (Initial-Level Performance)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A73","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Provides on-going opportunities for students to assess and reflect on their own performance in order to identify strengths and areas for future learning. (Advanced-Level Performance)"}]}]},{"leaf":false,"text":"STANDARD 6:  THE TEACHER DEMONSTRATES THE IMPLEMENTATION OF TECHNOLOGY<br/> The teacher uses technology to support instruction; access and manipulate data; enhance professional growth and productivity; communicate and collaborate with colleagues, parents, and the community; and conduct research.","children":[{"leaf":false,"text":"6.1 Uses available technology to design and plan instruction.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A5E","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Uses technology to design and plan instruction. (Initial-Level Performance)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A5F","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Uses appropriate technology to design and plan instruction that supports and extends learning of all students. (Advanced-Level Performance)"}]},{"leaf":false,"text":"6.2 Uses available technology to implement instruction that facilitates student learning.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A60","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Uses technology to implement instruction that facilitates student learning. (Initial-Level Performance)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A61","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Designs and implements research-based, technology-infused instructional strategies to support learning of all students. (Advanced-Level Performance)"}]},{"leaf":false,"text":"6.3 Integrates student use of available technology into instruction.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A62","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Integrates student use of technology into instruction to enhance learning outcomes and meet diverse student needs. (Initial-Level Performance)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A63","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Provides varied and authentic opportunities for all students to use appropriate technology to further their learning. (Advanced-Level Performance)"}]},{"leaf":false,"text":"6.4 Uses available technology to assess and communicate student learning.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A64","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Uses technology to assess and communicate student learning. (Initial-Level Performance)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A65","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Uses technology to assess student learning, manage assessment data, and communicate results to appropriate stakeholders. (Advanced-Level Performance)"}]},{"leaf":false,"text":"6.5 Demonstrates ethical and legal use of technology.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A66","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Ensures that personal use and student use of technology are ethical and legal. (Initial-Level Performance)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A67","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Provides and maintains a safe, secure, and equitable classroom environment that consistently promotes discerning and ethical use of technology. (Advanced-Level Performance)"}]}]},{"leaf":false,"text":"STANDARD 7:  REFLECTS ON AND EVALUATES TEACHING AND LEARNING<br/> The teacher reflects on and evaluates specific teaching/learning situations and/or programs.","children":[{"leaf":false,"text":"7.1 Uses data to reflect on and evaluate student learning.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A58","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Reflects on and accurately evaluates student learning using appropriate data. (Initial-Level Performance)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A59","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Uses formative and summative performance data to determine the learning needs of all students. (Advanced-Level Performance)"}]},{"leaf":false,"text":"7.2 Uses data to reflect on and evaluate instructional practice.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A5A","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Reflects on and accurately evaluates instructional practice using appropriate data. (Initial-Level Performance)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A5B","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Uses performance data to conduct an in-depth analysis and evaluation of instructional practices to inform future teaching. (Advanced-Level Performance)"}]},{"leaf":false,"text":"7.3 Uses data to reflect on and identify areas for professional growth.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A5C","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Identifies areas for professional growth using appropriate data. (Initial-Level Performance)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A5D","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Reflects on the evaluations of student learning and instructional practices to identify and develop plans for professional growth. (Advanced-Level Performance)"}]}]},{"leaf":false,"text":"STANDARD 8:  COLLABORATES WITH COLLEAGUES/PARENTS/OTHERS<br/> The teacher collaborates with colleagues, parents, and other agencies to design, implement, and support learning programs that develop student abilities to use communication skills, apply core concepts, become self-sufficient individuals, become responsible team members, think and solve problems, and integrate knowledge.","children":[{"leaf":false,"text":"8.1 Identifies students whose learning could be enhanced by collaboration.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A50","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Identifies one or more students whose learning could be enhanced by collaboration and provides an appropriate rationale. (Initial-Level Performance)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A51","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Describes an on-going process for identifying situations in which student learning could be enhanced by collaboration. (Advanced-Level Performance)"}]},{"leaf":false,"text":"8.2 Designs a plan to enhance student learning that includes all parties in the collaborative effort.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A52","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Designs a plan to enhance student learning that includes all parties in the collaborative effort. (Initial-Level Performance)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A53","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Designs a plan that involves parents, colleagues, and others in a collaborative effort to enhance student learning. (Advanced-Level Performance)"}]},{"leaf":false,"text":"8.3 Implements planned activities that enhance student learning and engage all parties.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A54","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Implements planned activities that enhance student learning and engage all parties. (Initial-Level Performance)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A55","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Explains how the collaboration to enhance student learning has been implemented. (Advanced-Level Performance)"}]},{"leaf":false,"text":"8.4 Analyzes data to evaluate the outcomes of collaborative efforts.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A56","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Analyzes student learning data to evaluate the outcomes of collaboration and identify next steps. (Initial-Level Performance)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A57","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Uses appropriate student performance data to describe, analyze, and evaluate the impact of the collaborative activities on student learning and to identify next steps. (Advanced-Level Performance)"}]}]},{"leaf":false,"text":"STANDARD 9:  EVALUATES TEACHING AND IMPLEMENTS PROFESSIONAL DEVELOPMENT<br/> The teacher evaluates his/her overall performance with respect to modeling and teaching Kentucky's learning goals, refines the skills and processes necessary, and implements a professional development plan.","children":[{"leaf":false,"text":"9.1 Self assesses performance relative to Kentucky's Teacher Standards.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A48","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Identifies priority growth areas and strengths by thoroughly and accurately assessing current performance on all the Kentucky Teacher Standards. (Initial-Level Performance)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A49","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Thoroughly and accurately assesses current performance related to the Kentucky Teacher Standards and any school/district professional development initiatives. (Advanced-Level Performance)"}]},{"leaf":false,"text":"9.2 Identifies priorities for professional development based on data from self-assessment, student performance and feedback from colleagues.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A4A","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Identifies priorities for professional development based on data from self-assessment, student performance and feedback from colleagues. (Initial-Level Performance)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A4B","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Reflects on data from multiple sources (i.e., self-assessment, student performance, feedback from colleagues, school/district initiatives) and identifies priority areas for growth. (Advanced-Level Performance)"}]},{"leaf":false,"text":"9.3 Designs a professional growth plan that addresses identified priorities.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A4C","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Designs a clear, logical professional growth plan that addresses all priority areas. (Initial-Level Performance)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A4D","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Designs a clear, logical professional growth plan that addresses all priority areas. (Advanced-Level Performance)"}]},{"leaf":false,"text":"9.4 Shows evidence of professional growth and reflection on the identified priority areas and impact on instructional effectiveness and student learning.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A4E","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Shows clear evidence of professional growth and reflection relative to the identified priority areas and impact on instructional effectiveness and student learning. (Initial-Level Performance)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A4F","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Shows clear evidence of the impact of professional growth activities on instructional effectiveness and student learning. (Advanced-Level Performance)"}]}]},{"leaf":false,"text":"STANDARD 10:  PROVIDES LEADERSHIP WITHIN SCHOOL/COMMUNITY/PROFESSION<br/> The teacher provides professional leadership within the school, community, and education profession to improve student learning and well-being.","children":[{"leaf":false,"text":"10.1 Identifies leadership opportunities that enhance student learning and/or professional environment of the school.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A40","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Identifies leadership opportunities in the school, community, or professional organizations and selects one with the potential for positive impact on learning or the professional environment and is realistic in terms of knowledge, skill, and time required. (Initial-Level Performance)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A41","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Identifies leadership opportunities within the school, community, or professional organizations to advance learning, improve instructional practice, facilitate professional development of colleagues, or advocate positive policy change; and selects an opportunity to demonstrate initiative, planning, organization, and professional judgment. (Advanced-Level Performance)"}]},{"leaf":false,"text":"10.2 Develops a plan for engaging in leadership activities.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A42","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Develops a leadership work plan that describes the purpose, scope, and participants involved and how the impact on student learning and/or the professional environment will be assessed. (Initial-Level Performance)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A43","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Develops a leadership work plan that clearly describes the purpose, scope, participants involved, timeline of events/actions, and plan for assessing progress and impact. (Advanced-Level Performance)"}]},{"leaf":false,"text":"10.3 Implements a plan for engaging in leadership activities.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A44","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Implements the approved leadership work plan that has a clear timeline of events/actions and a clear description of how impact will be assessed. (Initial-Level Performance)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A45","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Effectively implements the leadership work plan. (Advanced-Level Performance)"}]},{"leaf":false,"text":"10.4 Analyzes data to evaluate the results of planned and executed leadership efforts.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A46","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Analyzes student learning and/or other data appropriately to evaluate the results of planned and executed leadership efforts. (Initial-Level Performance)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1143A47","dcterms_educationLevel":[{"prefLabel":"Professional Education & Further Development"}],"text":"Uses data from the leadership effort to describe, analyze, and evaluate the impact on student learning. (Advanced-Level Performance)"}]}]}]