[{"leaf":false,"text":"Government and Civics","children":[{"leaf":false,"text":"Formation of Governments","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046687","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"asn_statementNotation":"SS-EP-1.1.1","text":"Students will identify the basic purposes of local government (to establish order, provide security and accomplish common goals); give examples of services local governments provide (e.g., police and fire protection roads and snow removal, garbage pick-up,) and identify how they pay for these services taxes)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046688","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"asn_statementNotation":"SS-EP-1.1.2","text":"Students will identify and explain the purpose of rules within organizations (e.g., school, clubs, teams) and compare rules with laws."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046689","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"SS-04-1.1.1","text":"Students will describe the basic purposes of Kentucky government (to establish order, provide security and accomplish common goals); give examples of the services that state governments provide (e.g., state police, state highways, state parks, public schools) and identify how the government of Kentucky pays for these services (e.g., sales taxes, state income taxes)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046BB9","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"SS-04-1.1.2","text":"Students will explain how state governments function (by making, enacting and enforcing laws) to protect the rights and property of citizens."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046BBA","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"SS-05-1.1.1","text":"Students will describe the basic purposes of the U.S. Government as defined in the Preamble to the U.S. Constitution (to establish justice, to ensure domestic tranquility, to provide for the common defense, to promote the general welfare, to secure the blessings of liberty); give examples of services the U.S. Government provides (e.g., armed forces, interstate highways, national parks) and analyze the importance of these services to citizens today."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046BBC","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"SS-05-1.1.2","text":"Students will explain and give examples of how democratic governments function (by making, enacting and enforcing laws) to promote the \"common good\" (e.g., public smoking ban, speed limits, seat belt requirements)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C25","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"SS-06-1.1.1","text":"Students will compare purposes and sources of power in the most common forms of government (monarchy, democracy, republic, dictatorship) in the present day."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C26","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"SS-06-1.1.2","text":"Students will describe and give examples to support how present day democratic governments function to preserve and protect the rights (e.g., voting), liberty and property of their citizens by making, enacting and enforcing appropriate rules and laws."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C27","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"SS-07-1.1.1","text":"Students will compare purposes and sources of power in the most common forms of government (monarchy, democracy, republic, dictatorship) in early civilizations prior to 1500 A.D."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C28","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"SS-07-1.1.2","text":"Students will describe and give examples to support how some early civilizations (Greece, Rome) practiced democratic principles (e.g., justice, equality, responsibility, freedom)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C29","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"SS-08-1.1.1","text":"Students will compare purposes and sources of power in the most common forms of government (monarchy, democracy, republic)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C2A","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"SS-08-1.1.2","text":"Students will describe and give examples to support how democratic government in the United States prior to Reconstruction functioned to preserve and protect the rights (e.g., voting), liberty and property of their citizens by making, enacting and enforcing appropriate rules and laws (e.g., constitutions, laws, statutes)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C2B","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"SS-08-1.1.3","text":"Students will describe and give examples of the ways the Constitution of the United States is a document that can be changed from time to time through both formal and informal processes (e.g., amendments, court cases, executive actions) to meet the needs of its citizens."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C94","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SS-HS-1.1.1","text":"Students will compare and contrast (purposes, sources of power) various forms of government in the world (e.g., monarchy, democracy, republic, dictatorship) and evaluate how effective they have been in establishing order, providing security and accomplishing common goals."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C96","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SS-HS-1.1.2","text":"Students will explain and give examples of how democratic governments preserve and protect the rights and liberties of their constituents through different sources (e.g., U.N. Charter, Declaration of the Rights of Man, U.N. Declaration of Human Rights, U.S. Constitution)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C97","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SS-HS-1.1.3","text":"Students will evaluate how the U.S. government's response to contemporary issues and societal problems (e.g., education, welfare system, health insurance, childcare, crime) reflects the needs, wants and demands of its citizens (e.g., individuals, political action committees, special interest groups, political parties)."}]},{"leaf":false,"text":"Constitutional Principles","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046BBE","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"asn_statementNotation":"SS-EP-1.2.1","text":"Students will describe how their local government is structured (e.g., mayor, city council, judge-executive, fiscal court, local courts) and compare their local government to other community governments in Kentucky."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046BBF","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"SS-04-1.2.1","text":"Students will identify the three branches of Kentucky government, explain the basic duties of each branch (executive-enforce the laws, legislative-make the laws, judicialinterpret the laws) and identify important state offices/ leaders, (Governor, Lieutenant Governor, General Assembly, Senate, House, representatives, senators, Kentucky Supreme Court, judges) associated with each branch."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046BC1","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"SS-04-1.2.2","text":"Students will explain how power is shared among the different branches (executive, legislative, judicial) of state government."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046BC2","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"SS-05-1.2.1","text":"Students will identify the three branches of the U.S. Government, explain the basic duties of each branch (executive-enforce the laws, legislative-make the laws, judicialinterpret the laws) and identify important national/federal offices/leaders, (President, Vice-President, Congress, House, Senate, U.S. Senators, U.S. Representatives, U.S. Supreme Court, judges) associated with each branch."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046BC3","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"SS-05-1.2.2","text":"Students will explain why the framers of the Constitution felt it was important to establish a government where powers are shared across different levels (local, state, national/federal) and branches (executive, legislative, judicial)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C2C","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"SS-08-1.2.1","text":"Students will identify the three branches of government, describe their functions and analyze and give examples of the ways the U.S. Constitution separates power among the legislative, executive and judicial branches to prevent the concentration of political power and to establish a system of checks and balances."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C2D","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"SS-08-1.2.2","text":"Students will explain the reasons why the powers of the state and national/federal governments are sometimes shared and sometimes separate (federalism) and give examples of shared and separate powers."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C99","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SS-HS-1.2.1","text":"Students will analyze how powers of government are distributed and shared among levels and branches and evaluate how this distribution of powers protects the \"common good\" (e.g., Congress legislates on behalf of the people; the President represents the people as a nation; the Supreme Court acts on behalf of the people as a whole when it interprets the Constitution)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C9A","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SS-HS-1.2.2","text":"Students will interpret the principles of limited government (e.g., rule of law, federalism, checks and balances, majority rule, protection of minority rights, separation of powers) and evaluate how these principles protect individual rights and promote the \"common good.\""}]},{"leaf":false,"text":"Rights and Responsibilities","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046BC5","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"asn_statementNotation":"SS-EP-1.3.1","text":"Students will define basic democratic ideas (e.g., liberty, justice, equality, rights, responsibility) and explain why they are important today."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046BC6","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"asn_statementNotation":"SS-EP-1.3.2","text":"Students will identify and give examples of good citizenship at home, at school and in the community (e.g., helping with chores, obeying rules, participating in community service projects such as recycling, conserving natural resources, donating food/supplies) and explain why civic engagement in the community is important."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046BC7","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"SS-04-1.3.1","text":"Students will identify the basic principles of democracy (e.g., justice, equality, responsibility, freedom) found in Kentucky's Constitution and explain why they are important to citizens today."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046BC9","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"SS-04-1.3.2","text":"Students will describe specific rights and responsibilities individuals have as citizens of Kentucky (e.g., voting in statewide elections, participating in state service projects, obeying state laws) and explain why civic engagement is necessary to preserve a democratic society."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046BCA","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"SS-05-1.3.1","text":"Students will explain the basic principles of democracy (e.g., justice, equality, responsibility, freedom) found in significant U.S. historical documents (Declaration of Independence, U. S. Constitution, Bill of Rights) and analyze why they are important to citizens today."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046BCB","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"SS-05-1.3.2","text":"Students will describe specific rights and responsibilities individuals have as citizens of the United States (e.g., voting in national elections) and explain why civic engagement is necessary to preserve a democratic society."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C2E","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"SS-08-1.3.1","text":"Students will explain and give examples of how significant United States documents (Declaration of Independence, Constitution, Bill of Rights) established democratic principles and guaranteed certain rights for all citizens."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C2F","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"SS-08-1.3.2","text":"Students will explain and give examples of how, in order for the U.S. government to function as a democracy, citizens must assume responsibilities (e.g., participating in community activities, voting in elections) and duties (e.g., obeying the law, paying taxes, serving on a jury, registering for the military)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C9C","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SS-HS-1.3.1","text":"Students will explain and give examples how the rights of one individual (e.g., smoking in public places, free speech) may, at times, be in conflict (e.g., slander, libel) with the rights of another."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C9E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SS-HS-1.3.2","text":"Students will explain how the rights of an individual (e.g., Freedom of information Act, privacy) may, at times, be in conflict with the responsibility of the government to protect the \"common good\" (e.g., homeland security issues, environmental regulations, censorship, search and seizure)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C9F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SS-HS-1.3.3","text":"Students will evaluate the impact citizens have on the functioning of a democratic government by assuming responsibilities (e.g., seeking and assuming leadership positions, voting) and duties (e.g., serving as jurors, paying taxes, complying with local, state and federal laws, serving in the armed forces)."}]}]},{"leaf":false,"text":"Cultures & Societies","children":[{"leaf":false,"text":"Elements of Culture","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046BCD","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"asn_statementNotation":"SS-EP-2.1.1","text":"Students will describe cultural elements (e.g., beliefs, traditions, languages, skills, literature, the arts)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046BCE","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"asn_statementNotation":"SS-EP-2.1.2","text":"Students will study a variety of diverse cultures locally and in the world today and explain the importance of appreciating and understanding other cultures."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046BD0","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"SS-04-2.1.1","text":"Students will identify early cultures (Native American, Appalachian, pioneers) in Kentucky and explain their similarities and differences."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046BD1","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"SS-05-2.1.1","text":"Students will identify early cultures (e.g., English, Spanish, French, West African) in the United States and analyze their similarities and differences."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C30","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"SS-06-2.1.1","text":"Students will explain how elements of culture (e.g., language, the arts, customs, beliefs, literature) define specific groups in the global world of the present day and may result in unique perspectives."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C31","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"SS-07-2.1.1","text":"Students will explain how elements of culture (e.g., language, the arts, customs, beliefs, literature) defined specific groups in the early civilizations prior to 1500 A.D. and resulted in unique perspectives."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C32","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"SS-08-2.1.1","text":"Students will explain how elements of culture (e.g., language, the arts, customs, beliefs, literature) defined specific groups in the United States prior to Reconstruction and resulted in unique perspectives."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046CA1","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SS-HS-2.1.1","text":"Students will explain how belief systems, knowledge, technology and behavior patterns define cultures and help to explain historical perspectives and events in the modern world (1500 A.D. to present) and United States (Reconstruction to present)."}]},{"leaf":false,"text":"Social Institutions","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046BD2","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"asn_statementNotation":"SS-EP-2.2.1","text":"Students will identify social institutions (government, economy, education, religion, family) and explain how they help the community."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046BD4","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"SS-04-2.2.1","text":"Students will describe social institutions (government, economy, education, religion, family) in Kentucky and how they respond to the needs of the people."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046BD5","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"SS-05-2.2.1","text":"Students will describe social institutions (government, economy, education, religion, family) in the United States and explain their role in the growth and development of the nation."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C33","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"SS-06-2.2.1","text":"Students will compare how cultures (present day) develop social institutions (family, religion, education, government, economy) to respond to human needs, structure society and influence behavior."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C34","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"SS-07-2.2.1","text":"Students will compare how cultures (early civilizations prior to 1500 A.D.) developed social institutions (family, religion, education, government, economy) to respond to human needs, structure society and influence behavior."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C35","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"SS-08-2.2.1","text":"Students will compare how cultures (United States prior to Reconstruction) developed social institutions (family, religion, education, government, economy) to respond to human needs, structure society and influence behavior."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046CA2","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SS-HS-2.2.1","text":"Students will explain how various human needs are met through interaction in and among social institutions (e.g., family, religion, education, government, economy) in the modern world (1500 A.D. to present) and the United States (Reconstruction to present)."}]},{"leaf":false,"text":"Interactions Among Individuals and Groups","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046BD7","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"asn_statementNotation":"SS-EP-2.3.1","text":"Students will describe various forms of interactions (compromise, cooperation, conflict, competition) that occur between individuals/ groups at home and at school."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046BD9","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"asn_statementNotation":"SS-EP-2.3.2","text":"Students will identify appropriate conflict resolution strategies (e.g., compromise, cooperation, communication)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046BDB","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"SS-04-2.3.1","text":"Students will describe various forms of interactions (compromise, cooperation, conflict) that occurred during the early settlement of Kentucky between diverse groups (Native Americans, early settlers)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046BDD","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"SS-04-2.3.2","text":"Students will give examples of conflicts between individuals or groups today and describe appropriate conflict resolution strategies (e.g., compromise, cooperation, communication) to use."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046BDF","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"SS-05-2.3.1","text":"Students will describe various forms of interactions (compromise, cooperation, conflict) that occurred between diverse groups (e.g., Native Americans, European Explorers, English colonists, British Parliament) in the history of the United States."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046BE0","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"SS-05-2.3.2","text":"Students will give examples of conflicts between individuals or groups and describe appropriate conflict resolution strategies (e.g., compromise, cooperation, communication)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C36","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"SS-06-2.3.1","text":"Students will explain how conflict and competition (e.g., political, economic, religious, ethnic) occur among individuals and groups in the present day."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C37","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"SS-06-2.3.2","text":"Students will explain how compromise and cooperation are possible choices to resolve conflict among individuals and groups in the present day."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C38","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"SS-07-2.3.1","text":"Students will explain how conflict and competition (e.g., political, economic, religious, ethnic) occurred among individuals and groups in early civilizations prior to 1500 A.D."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C39","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"SS-07-2.3.2","text":"Students will explain how compromise and cooperation were possible choices to resolve conflict among individuals and groups in early civilizations prior to 1500 A.D."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C3A","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"SS-08-2.3.1","text":"Students will explain how conflict and competition (e.g., political, economic, religious, ethnic) occurred among individuals and groups in the United States prior to Reconstruction."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C3B","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"SS-08-2.3.2","text":"Students will explain how compromise and cooperation were possible choices to resolve conflict among individuals and groups in the United States prior to Reconstruction."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046CA3","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SS-HS-2.3.1","text":"Students will explain the reasons why conflict and competition (e.g., violence, difference of opinion, stereotypes, prejudice, discrimination, genocide) may develop as cultures emerge in the modern world (1500 A.D. to present) and the United States (Reconstruction to present)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046CA4","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SS-HS-2.3.2","text":"Students will explain and give examples of how compromise and cooperation are characteristics that influence interaction (e.g., peace studies, treaties, conflict resolution) in the modern world (1500 A.D. to present) and the United States (Reconstruction to present)."}]}]},{"leaf":false,"text":"Economics","children":[{"leaf":false,"text":"Scarcity","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046BE1","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"asn_statementNotation":"SS-EP-3.1.1","text":"Students will define basic economic terms related to scarcity (e.g., opportunity cost, wants and needs, limited productive resources-natural, human, capital) and explain that scarcity requires people to make economic choices and incur opportunity costs."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046BE3","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"SS-04-3.1.1","text":"Students will describe scarcity and explain how scarcity requires people in Kentucky to make economic choices (e.g., use of productive resources - natural, human, capital) and incur opportunity costs."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046BE4","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"SS-05-3.1.1","text":"Students will describe scarcity and explain how scarcity required people in different periods in the U.S. (Colonization, Expansion, Twentieth Century to Present) to make economic choices (e.g., use of productive resources- natural, human, capital) and incur opportunity costs."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C3C","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"SS-06-3.1.1","text":"Students will explain and give examples of how scarcity requires individuals, groups and governments in the present day to make decisions about how productive resources (natural resources, human resources capital goods) are used."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C3D","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"SS-07-3.1.1","text":"Students will explain and give examples of how scarcity required individuals, groups and governments in early civilizations prior to 1500 A.D. to make decisions about how productive resources (natural resources, human resources, capital goods) were used."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C3E","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"SS-08-3.1.1","text":"Students will explain and give examples of how scarcity required individuals, groups and the government in the United States prior to Reconstruction to make decisions about how productive resources (natural resources, human resources, capital goods) were used."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C3F","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"SS-08-3.1.2","text":"Students will identify how financial decisions (considering finance and opportunity cost) by individuals and groups impacted historical events in U.S. History prior to Reconstruction."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046CA5","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SS-HS-3.1.1","text":"Students will give examples of and explain how scarcity of resources necessitates choices at both the personal and societal levels in the modern world (1500 A.D. to present) and the United States (Reconstruction to present) and explain the impact of those choices."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046CA7","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SS-HS-3.1.2","text":"Students will explain how governments have limited budgets, so they must compare revenues to costs and consider opportunity cost when planning public projects."}]},{"leaf":false,"text":"Economic Systems and Institutions","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046BE5","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"asn_statementNotation":"SS-EP-3.2.1","text":"Students will identify and give examples of economic institutions (banks) and explain how they help people deal with the problem of scarcity (e.g., loan money, save money) in today's market economy."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046BE7","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"SS-04-3.2.1","text":"Students will explain how profit motivates individuals/businesses to take risks in producing goods and services."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046BE8","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"SS-05-3.2.1","text":"Students will explain how profits motivated individuals/businesses in the U.S. (Expansion, Industrialization) to take risks in producing goods and services."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C40","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"SS-06-3.2.1","text":"Students will compare present day economic systems (traditional, command, market, mixed)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C41","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"SS-08-3.2.1","text":"Students will describe the economic system that developed in the United States prior to Reconstruction."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C42","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"SS-08-3.2.2","text":"Students will explain how profit motivated individuals and groups to take risks in producing goods and services in the early United States prior to Reconstruction and influenced the growth of a free enterprise system."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046CA9","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SS-HS-3.2.1","text":"Students will compare and contrast economic systems (traditional, command, market, mixed) based on their abilities to achieve broad social goals such as freedom, efficiency, equity, security and growth in the modern world."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046CAB","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SS-HS-3.2.2","text":"Students will describe economic institutions such as corporations, labor unions, banks, stock markets, cooperatives and partnerships."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046CAC","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SS-HS-3.2.3","text":"Students will explain how, in a free enterprise system, individuals attempt to maximize their profits based on their role in the economy (e.g., producers try to maximize resources, entrepreneurs try to maximize profits, workers try to maximize income, savers and investors try to maximize return)."}]},{"leaf":false,"text":"Markets","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046BEA","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"asn_statementNotation":"SS-EP-3.3.1","text":"Students will define basic economic terms related to markets (e.g., market economy, markets, wants and needs, goods and services, profit, consumer, producer, supply and demand, barter, money, trade, advertising)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046BEB","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"asn_statementNotation":"SS-EP-3.3.2","text":"Students will explain different ways that people acquire goods and services (by trading/bartering goods and services for other goods and services or by using money)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046BEC","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"SS-04-3.3.1","text":"Students will give examples of markets; explain how they function and how the prices of goods and services are determined by supply and demand."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046BED","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"SS-04-3.3.2","text":"Students will explain how competition among buyers and sellers influences the price of goods and services in our state, nation and world."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046BEF","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"SS-05-3.3.1","text":"Students will give examples of markets in different periods of U.S. History (Colonization, Expansion, Industrialization, Twentieth Century to Present) and explain similarities and differences."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046BF0","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"SS-05-3.3.2","text":"Students will explain how competition among buyers and sellers influences the price of goods and services in our state, nation and world."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C43","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"SS-06-3.3.1","text":"Students will explain how in present day market economies, the prices of goods and services are determined by supply and demand."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C44","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"SS-06-3.3.2","text":"Students will explain how money (unit of account) can be used to express the market value of goods and services and how money makes it easier to trade, borrow, invest and save in the present day."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C46","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"SS-06-3.3.3","text":"Students will explain how competition among buyers and sellers impacts the price of goods and services in the present day."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C47","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"SS-08-3.3.1","text":"Students will explain how in the United States prior to Reconstruction, the prices of goods and services were determined by supply and demand."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C48","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"SS-08-3.3.2","text":"Students will explain how money (unit of account) was used to express the market value of goods and services and how money made it easier to trade, borrow, invest and save in the United States prior to Reconstruction."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C49","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"SS-08-3.3.3","text":"Students will explain how competition among buyers and sellers impacted the price of goods and services in the United States prior to Reconstruction."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046CAE","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SS-HS-3.3.1","text":"Students will explain and give examples of how numerous factors influence the supply and demand of products (e.g., supply—technology, cost of inputs, number of sellers: demand—income, utility, price of similar products, consumers' preferences)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046CB0","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SS-HS-3.3.2","text":"Students will describe how specific financial and non-financial incentives often influence individuals differently (e.g., discounts, sales promotions, trends, personal convictions)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046CB1","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SS-HS-3.3.3","text":"Students will explain how the level of competition in a market is largely determined by the number of buyers and sellers."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046CB2","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SS-HS-3.3.4","text":"Students will explain how laws and government mandates (e.g., anti-trust legislation, tariff policy, regulatory policy) have been adopted to maintain competition in the United States and in the global marketplace."}]},{"leaf":false,"text":"Production, Distribution, and Consumption","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046BF2","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"asn_statementNotation":"SS-EP-3.4.1","text":"Students will define basic economic terms related to production, distribution and consumption (e.g., goods and services, wants and needs, supply and demand, specialization, entrepreneur) and describe various ways goods and services are distributed (e.g., by price, first-come-firstserved, sharing equally)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046BF3","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"asn_statementNotation":"SS-EP-3.4.2","text":"Students will describe how new knowledge, technology/tools, and specialization increases productivity in our community, state, nation and world."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046BF4","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"asn_statementNotation":"SS-EP-3.4.3","text":"Students will define interdependence and give examples of how people in our communities, states, nation and world depend on each other for goods and services."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046BF6","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"SS-04-3.4.1","text":"Students will describe production, distribution and consumption of goods and services in regions of Kentucky and the U.S."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046BF7","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"SS-04-3.4.2","text":"Students will describe how new knowledge, technology/tools and specialization increases productivity and promotes trade between regions of Kentucky and the United States (e.g., Midwest – corn, South - citrus)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046BF9","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"SS-04-3.4.3","text":"Students will define interdependence and give examples of how people in our communities, states, nation and world depend on each other for goods and services."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046BFA","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"SS-05-3.4.1","text":"Students will describe production, distribution and consumption of goods and services in the history of the U.S. (Colonization, Industrialization, Twentieth Century to Present)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046BFB","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"SS-05-3.4.2","text":"Students will describe how new knowledge, technology/tools and specialization increase/increased productivity in the U.S. (Colonization, Industrialization, Twentieth Century to Present)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046BFD","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"SS-05-3.4.3","text":"Students will define interdependence and give examples of how people in our communities, states, nation and world depend on each other for goods and services."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C4B","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"SS-06-3.4.1","text":"Students will explain ways in which the basic economic questions about the production, distribution and consumption of goods and services are addressed in the present day."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C4C","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"SS-06-3.4.2","text":"Students will describe how new knowledge, technology/tools and specialization increase human productivity in the present day."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C4D","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"SS-06-3.4.3","text":"Students will explain how international economic activities are interdependent in the present day."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C4F","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"SS-07-3.4.1","text":"Students will explain ways in which the basic economic questions about the production, distribution and consumption of goods and services were addressed in early civilizations prior to 1500 A.D."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C50","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"SS-07-3.4.2","text":"Students will describe how new knowledge, technology/tools and specialization increased productivity in early civilizations prior to 1500 A.D."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C51","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"SS-08-3.4.1","text":"Students will explain ways in which the basic economic questions about the production, distribution and consumption of goods and services were addressed in the United States prior to Reconstruction."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C53","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"SS-08-3.4.2","text":"Students will describe how new knowledge, technology/tools and specialization increased productivity in the United States prior to Reconstruction."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C54","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"SS-08-3.4.3","text":"Students will explain how personal, national and international economic activities were interdependent in the United States prior to Reconstruction."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046CB3","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SS-HS-3.4.1","text":"Students will analyze the changing relationships among business, labor and government (e.g., unions, anti-trust laws, tariff policy, price controls, subsidies, tax incentives) and how each has affected production, distribution and consumption in the United States or the world."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046CB5","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SS-HS-3.4.2","text":"Students will describe and give examples of how factors such as technological change, investments in capital goods and human capital/resources have increased productivity in the world."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046CB7","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SS-HS-3.4.3","text":"Students will explain and give examples of how interdependence of personal, national and international economic activities often results in international issues and concerns (e.g., natural resource dependencies, economic sanctions, environmental and humanitarian issues) in the modern world (1500 A.D. to present) and the United States (Reconstruction to present)."}]}]},{"leaf":false,"text":"Geography","children":[{"leaf":false,"text":"The Use of Geographic Tools","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046BFE","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"asn_statementNotation":"SS-EP-4.1.1","text":"Students will use geographic tools (e.g., maps, globes, mental maps, charts, graphs) to locate and describe familiar places at home, school and the community."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046BFF","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"asn_statementNotation":"SS-EP-4.1.2","text":"Students will use geographic tools to identify major landforms (e.g., continents, mountain ranges), bodies of water (e.g., oceans, major rivers) and natural resources on Earth's surface and use relative location."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C00","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"asn_statementNotation":"SS-EP-4.1.3","text":"Students will describe how different factors (e.g. rivers, mountains) influence where human activities are located in the community."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C01","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"SS-04-4.1.1","text":"Students will use geographic tools (e.g., maps, charts, graphs) to identify and describe natural resources and other physical characteristics (e.g., major landforms, major bodies of water, weather, climate, roads, bridges) in regions of Kentucky and the United States."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C02","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"SS-04-4.1.2","text":"Students will use geographic tools to locate major landforms, bodies of water, places and objects in Kentucky by their absolute and relative locations."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C03","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"SS-04-4.1.3","text":"Students will describe how different factors (e.g. rivers, mountains) influence where human activities were/are located in Kentucky."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C04","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"SS-05-4.1.1","text":"Students will use geographic tools (e.g., maps, charts, graphs) to identify natural resources and other physical characteristics (e.g., major landforms, major bodies of water, weather, climate, roads, bridges) and analyze patterns of movement and settlement in the United States."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C05","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"SS-05-4.1.2","text":"Students will use geographic tools to locate and describe major landforms, bodies of water, places and objects in the United States by their absolute location."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C06","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"SS-05-4.1.3","text":"Students will describe how different factors (e.g. rivers, mountains) influence where human activities were/are located in the United States."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C07","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"SS-05-4.1.4","text":"Students explain how factors in one location can impact other locations (e.g., natural disasters, building dams)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C55","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"SS-06-4.1.1","text":"Students will use a variety of geographic tools (maps, photographs, charts, graphs, databases, satellite images) to interpret patterns and locations on Earth's surface in the present day."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C57","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"SS-06-4.1.2","text":"Students will describe how different factors (e.g., rivers, mountains, plains) affect where human activities are located in the present day."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C58","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"SS-07-4.1.1","text":"Students will use a variety of geographic tools (maps, photographs, charts, graphs, databases) to interpret patterns and locations on Earth's surface in early civilizations prior to 1500 A.D."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C59","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"SS-07-4.1.2","text":"Students will describe how different factors (e.g., rivers, mountains, plains) affected where human activities were located in early civilizations prior to 1500 A.D."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C5B","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"SS-08-4.1.1","text":"Students will use a variety of geographic tools (maps, photographs, charts, graphs, databases) to interpret patterns and locations on Earth's surface in United States history prior to Reconstruction."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C5C","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"SS-08-4.1.2","text":"Students will describe how different factors (e.g., rivers, mountains, plains, harbors) affected where human activities were located in the United States prior to Reconstruction."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046CB9","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SS-HS-4.1.1","text":"Students will use a variety of geographic tools (e.g., maps, globes, photographs, models, satellite images, charts, graphs, databases) to explain and analyze the reasons for the distribution of physical and human features on Earth's surface."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046CBA","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SS-HS-4.1.2","text":"Students will explain how mental maps, the mental image a person has of an area including knowledge of features and spatial relationships, become more complex as experience, study and the media bring new geographic information."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046CBC","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SS-HS-4.1.3","text":"Students will use geographic tools (e.g., maps, globes, photographs, models, satellite images) to interpret the reasoning patterns (e.g., available transportation, location of resources and markets, individual preference, centralization versus dispersion) on which the location and distribution of Earth's human features is based."}]},{"leaf":false,"text":"Regions","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C08","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"asn_statementNotation":"SS-EP-4.2.1","text":"Students will describe places on Earth's surface by their physical characteristics (e.g., climate, landforms, bodies of water)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C09","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"SS-04-4.2.1","text":"Students will compare regions in Kentucky and the United States by their human characteristics (e.g., language, settlement patterns, beliefs) and physical characteristics (e.g., climate, landforms, bodies of water)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C5D","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"SS-06-4.2.1","text":"Students will describe how regions in the present day are made distinctive by human characteristics (e.g., dams, roads, urban centers) and physical characteristics (e.g., mountains, bodies of water, valleys) that create advantages and disadvantages for human activities (e.g., exploration, migration, trade, settlement, development)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C5F","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"SS-06-4.2.2","text":"Students will describe and give examples of how places and regions in the present day change over time as technologies, resources and knowledge become available."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C60","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"SS-07-4.2.1","text":"Students will describe how regions in early civilizations prior to 1500 A.D. were made distinctive by human characteristics (e.g., dams, irrigation, roads) and physical characteristics (e.g., mountains, bodies of water, valleys) that created advantages and disadvantages for human activities (e.g., exploration, migration, trade, settlement)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C62","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"SS-07-4.2.2","text":"Students will describe and give examples of how places and regions in early civilizations prior to 1500 A.D changed over time as technologies, resources and knowledge became available."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C64","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"SS-08-4.2.1","text":"Students will describe how regions in the U.S. prior to Reconstruction were made distinctive by human characteristics (e.g., dams, roads, urban centers) and physical characteristics (e.g., mountains, bodies of water) that created advantages and disadvantages for human activities (e.g., exploration, migration, trade, settlement)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C65","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"SS-08-4.2.2","text":"Students will describe how places and regions in United States history prior to Reconstruction changed over time as technologies, resources and knowledge became available."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046CBE","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SS-HS-4.2.1","text":"Students will interpret how places and regions serve as meaningful symbols for individuals and societies (e.g., Jerusalem, Vietnam Memorial, Ellis Island, the Appalachian region)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046CBF","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SS-HS-4.2.2","text":"Students will explain how physical (e.g., climate, mountains, rivers) and human characteristics (e.g., interstate highways, urban centers, workforce) of regions create advantages and disadvantages for human activities in a specific place."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046CC0","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SS-HS-4.2.3","text":"Students will explain how people can develop stereotypes about places and regions (e.g., all cities are dangerous and dirty; rural areas are poor)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046CC2","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SS-HS-4.2.4","text":"Students will explain how people from different cultures with different perspectives view regions (e.g., Middle East, Balkans) in different ways, sometimes resulting in conflict in the modern world (1500 A.D. to present) and United States (Reconstruction to present)."}]},{"leaf":false,"text":"Patterns","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C0A","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"asn_statementNotation":"SS-EP-4.3.1","text":"Students will describe patterns of human settlement in places and regions on the Earth's surface."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C0C","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"asn_statementNotation":"SS-EP-4.3.2","text":"Students will describe how technology helps us move, settle and interact in the modern world."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C0D","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"SS-04-4.3.1","text":"Students will describe patterns of human settlement in regions of Kentucky and explain how these patterns were/are influenced by physical characteristics (e.g., climate, landforms, bodies of water)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C0E","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"SS-04-4.3.2","text":"Students will describe how advances in technology (e.g., dams, reservoirs, roads, irrigation) allow people to settle in places previously inaccessible in Kentucky."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C0F","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"SS-05-4.3.1","text":"Students will explain patterns of human settlement in the early development of the United States and explain how these patterns were influenced by physical characteristics (e.g., climate, landforms, bodies of water)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C10","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"SS-05-4.3.2","text":"Students will describe how advances in technology (e.g., dams, reservoirs, roads, irrigation) allow people to settle in places previously inaccessible in the United States."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C66","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"SS-06-4.3.1","text":"Students will describe patterns of human settlement in the present day and explain how these patterns are influenced by human needs."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C68","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"SS-06-4.3.2","text":"Students will explain why and give examples of how human populations may change and/or migrate because of factors such as war, famine, disease, economic opportunity and technology in the present day."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C69","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"SS-07-4.3.1","text":"Students will describe patterns of human settlement in early civilizations prior to 1500 A.D. and explain how these patterns were influenced by human needs."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C6A","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"SS-07-4.3.2","text":"Students will explain why and give examples of how human populations changed and/or migrated because of factors such as war, disease, economic opportunity and technology in early civilizations prior to 1500 A.D."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C6B","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"SS-08-4.3.1","text":"Students will describe patterns of human settlement in the United States prior to Reconstruction and explain how these patterns were influenced by human needs."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C6C","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"SS-08-4.3.2","text":"Students will explain why and give examples of how human populations changed and/or migrated because of factors such as war, disease, economic opportunity and technology in the United States prior to Reconstruction."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046CC3","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SS-HS-4.3.1","text":"Students will describe the movement and settlement patterns of people in various places and analyze the causes of that movement and settlement (e.g., push factors such as famines or military conflicts; pull factors such as climate or economic opportunity) and the impacts in the modern world (1500 A.D. to present) and United States (Reconstruction to present)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046CC5","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SS-HS-4.3.2","text":"Students will explain how technology (e.g., computers, telecommunications) has facilitated the movement of goods, services and populations, increased economic interdependence at all levels and influenced development of centers of economic activity."}]},{"leaf":false,"text":"Human-Environment Interaction","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C11","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"asn_statementNotation":"SS-EP-4.4.1","text":"Students will describe ways people adapt to/modify the physical environment to meet their basic needs (food, shelter, clothing)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C12","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"asn_statementNotation":"SS-EP-4.4.2","text":"Students will describe how the physical environment can both promote and restrict human activities."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C13","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"SS-04-4.4.1","text":"Students will explain and give examples of how people adapted to/modified the physical environment (e.g., natural resources, physical geography, natural disasters) to meet their needs during the history of Kentucky and explain its impact on the environment today."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C14","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"SS-04-4.4.2","text":"Students will describe how the physical environment (e.g., mountains as barriers for protection, rivers as barriers of transportation) both promoted and restricted human activities during the early settlement of Kentucky."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C15","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"SS-05-4.4.1","text":"Students will explain and give examples of how people adapted to/modified the physical environment (e.g., natural resources, physical geography, natural disasters) to meet their needs during the history of the U.S. (Colonization, Expansion) and analyze the impact on their environment."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C16","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"SS-05-4.4.2","text":"Students will describe how the physical environment (e.g., mountains as barriers for protection, rivers as barriers of transportation) both promoted and restricted human activities during the early settlement of the U.S. (Colonization, Expansion)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C17","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"SS-05-4.4.3","text":"Students will describe how individuals/groups may have different perspectives about the use of land (e.g., farming, industrial, residential, recreational)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C6E","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"SS-06-4.4.1","text":"Students will explain how technology in the present day assists human modification (e.g., irrigation, clearing land, building roads) of the physical environment in regions."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C6F","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"SS-06-4.4.2","text":"Students will describe ways in which the physical environment (e.g., natural resources, physical geography, natural disasters) both promotes and limits human activities (e.g., exploration, migration, trade, settlement, development) in the present day."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C71","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"SS-06-4.4.3","text":"Students will explain how the natural resources of a place or region impact its political, social and economic development in the present day."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C73","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"SS-06-4.4.4","text":"Students will explain how individual and group perspectives impact the use of natural resources (e.g., urban development, recycling) in the present day."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C74","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"SS-07-4.4.1","text":"Students will explain how technology in early civilizations prior to 1500 A.D. assisted human modification (e.g., irrigation, clearing land, building roads) of the physical environment."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C76","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"SS-07-4.4.2","text":"Students will describe ways in which the physical environment (e.g., natural resources, physical geography, natural disasters) both promoted and limited human activities (e.g., exploration, migration, trade, settlement, development) in early civilizations prior to 1500 A.D."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C77","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"SS-07-4.4.3","text":"Students will explain how the natural resources of a place or region impact its political, social and economic development in early civilizations prior to 1500 A.D."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C78","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"SS-08-4.4.1","text":"Students will explain how technology in the United States prior to Reconstruction assisted human modification (e.g., irrigation, clearing land, building roads) of the physical environment."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C7A","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"SS-08-4.4.2","text":"Students will describe ways in which the physical environment (e.g., natural resources, physical geography, natural disasters) both promoted and limited human activities (e.g., exploration, migration, trade, settlement, development) in the United States prior to Reconstruction."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C7B","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"SS-08-4.4.3","text":"Students will explain how the natural resources of a place or region impact its political, social and economic development in the United States prior to Reconstruction."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C7D","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"SS-08-4.4.4","text":"Students will compare and contrast different perspectives (viewpoints) that people have about how to use land (e.g., farming, industrial, residential, recreational) in the United States prior to Reconstruction."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046CC6","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SS-HS-4.4.1","text":"Students will explain how humans develop strategies (e.g., transportation, communication, technology) to overcome limits of their physical environment."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046CC7","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SS-HS-4.4.2","text":"Students will explain how human modifications to the physical environment (e.g., deforestation, mining), perspectives on the use of natural resources (e.g., oil, water, land), and natural disasters (e.g., earthquakes, tsunamis, floods) may have possible global effects (e.g., global warming, destruction of the rainforest, acid rain) in the modern world (1500 A.D. to present) and United States (Reconstruction to present)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046CC8","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SS-HS-4.4.3","text":"Students will explain how group and individual perspectives impact the use of natural resources (e.g., mineral extraction, land reclamation)."}]}]},{"leaf":false,"text":"Historical Perspective","children":[{"leaf":false,"text":"The Factual and Interpretive Nature of History","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C18","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"asn_statementNotation":"SS-EP-5.1.1","text":"Students will use a variety of primary and secondary sources (e.g., artifacts, diaries, timelines) to interpret the past."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C19","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"SS-04-5.1.1","text":"Students will use a variety of primary and secondary sources (e.g., artifacts, diaries, timelines) to describe significant events in the history of Kentucky and interpret different perspectives."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C1A","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"SS-05-5.1.1","text":"Students will use a variety of primary and secondary sources (e.g., artifacts, diaries, maps, timelines) to describe significant events in the history of the U.S. and interpret different perspectives."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C7E","dcterms_educationLevel":[{"prefLabel":"6"}],"asn_statementNotation":"SS-06-5.1.1","text":"Students will use a variety of tools (e.g., primary and secondary sources) to describe and explain historical events and conditions and to analyze the perspectives of different individuals and groups (e.g., gender, race, region, ethnic group, age, economic status, religion, political group) in present day regions."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C80","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"SS-07-5.1.1","text":"Students will use a variety of tools (e.g. primary and secondary sources) to describe and explain historical events and conditions and to analyze the perspectives of different individuals and groups (e.g., gender, race, region, ethnic group, age, economic status, religion, political group) in early civilizations prior to 1500 A.D."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C82","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"SS-07-5.1.2","text":"Students will explain how history is a series of connected events shaped by multiple cause-and-effect relationships and give examples of those relationships."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C83","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"SS-08-5.1.1","text":"Students will use a variety of tools (e.g., primary and secondary sources) to describe and explain historical events and conditions and to analyze the perspectives of different individuals and groups (e.g., gender, race, region, ethnic group, age, economic status, religion, political group) in U.S. history prior to Reconstruction."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C84","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"SS-08-5.1.2","text":"Students will explain how history is a series of connected events shaped by multiple cause-and-effect relationships and give examples of those relationships."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046CC9","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SS-HS-5.1.1","text":"Students will use a variety of tools (e.g., primary and secondary sources, data, artifacts) to analyze perceptions and perspectives (e.g., gender, race, region, ethnic group, nationality, age, economic status, religion, politics, geographic factors) of people and historical events in the modern world (1500 A.D. to present) and United States History (Reconstruction to present)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046CCA","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SS-HS-5.1.2","text":"Students will analyze how history is a series of connected events shaped by multiple cause and effect relationships, tying past to present."}]},{"leaf":false,"text":"The History of the United States","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C1B","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"asn_statementNotation":"SS-EP-5.2.1","text":"Students will identify significant patriotic and historical songs, symbols, monuments/landmarks (e.g., The Star- Spangled Banner, the Underground Railroad, the Statue of Liberty) and patriotic holidays (e.g., Veteran's Day, Martin Luther King's birthday, Fourth of July) and explain their historical significance."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C1C","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"asn_statementNotation":"SS-EP-5.2.2","text":"Students will identify and compare the early cultures of diverse groups of Native Americans (e.g., Northwest, Southwest, Plains, Eastern Woodlands) and explain why they settled in what is now the United States."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C1D","dcterms_educationLevel":[{"prefLabel":"K"},{"prefLabel":"1"},{"prefLabel":"2"},{"prefLabel":"3"}],"asn_statementNotation":"SS-EP-5.2.3","text":"Students will describe change over time in communication, technology, transportation and education in the community."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C1E","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"SS-04-5.2.1","text":"Students will identify significant historical documents, symbols, songs and selected readings (e.g., state flag, United We Stand, Divided We Fall, My Old Kentucky Home,) specific to Kentucky and explain their historical significance."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C1F","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"SS-04-5.2.2","text":"Students will identify and compare the cultures of diverse groups and explain why people explored and settled in Kentucky."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C20","dcterms_educationLevel":[{"prefLabel":"4"}],"asn_statementNotation":"SS-04-5.2.3","text":"Students will compare change over time in communication, technology, transportation and education in Kentucky."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C21","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"SS-05-5.2.1","text":"Students will identify historical documents, selected readings and speeches (e.g., Mayflower Compact, Emancipation Proclamation, Dr. Martin Luther King's speech: I Have a Dream) and explain their historical significance."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C22","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"SS-05-5.2.2","text":"Students will explain reasons (e.g., freedoms, opportunities, fleeing negative situations) immigrants came to America long ago (Colonization and Settlement, Industrialization and Immigration, Twentieth Century to Present) and compare with why immigrants come to America today."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C23","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"SS-05-5.2.3","text":"Students will compare change over time (Colonization, Industrialization, Twentieth Century to Present) in communication, technology, transportation and education."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C24","dcterms_educationLevel":[{"prefLabel":"5"}],"asn_statementNotation":"SS-05-5.2.4","text":"Students will describe significant historical events in each of the broad historical periods and eras in U.S. history (Colonization and Settlement, Revolution and a New Nation, Expansion and Conflict, Industrialization and Immigration, Twentieth Century to Present) and explain cause and effect relationships."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C86","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"SS-08-5.2.1","text":"Students will explain events and conditions that led to the \"Great Convergence\" of European, African and Native American people beginning in the late 15th century, and analyze how America's diverse society developed as a result of these events."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C87","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"SS-08-5.2.2","text":"Students will explain and give examples of how the ideals of equality and personal liberty (rise of individual rights, economic freedom, religious diversity) that developed during the colonial period, were motivations for the American Revolution and proved instrumental in the development of a new nation."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C88","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"SS-08-5.2.3","text":"Students will explain how the growth of democracy and geographic expansion occurred and were significant to the development of the United States prior to Reconstruction."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C89","dcterms_educationLevel":[{"prefLabel":"8"}],"asn_statementNotation":"SS-08-5.2.4","text":"Students will describe the political, social, economic and cultural differences (e.g., slavery, tariffs, industrialism vs. agrarianism, federal vs. states' rights) among sections of the U.S. and explain how these differences resulted in the American Civil War."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046CCB","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SS-HS-5.2.1","text":"Students will compare and contrast the ways in which various Reconstruction plans were approached and evaluate the outcomes of Reconstruction."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046CCC","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SS-HS-5.2.2","text":"Students will explain how the rise of big business, factories, mechanized farming and the labor movement impacted the lives of Americans."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046CCD","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SS-HS-5.2.3","text":"Students will explain the impact of massive immigration (e.g., new social patterns, conflicts in ideas about national unity amid growing cultural diversity) after the Civil War."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046CCF","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SS-HS-5.2.4","text":"Students will explain and evaluate the impact of significant social, political and economic changes during the Progressive Movement (e.g., industrial capitalism, urbanization, political corruption, initiation of reforms), World War I (e.g., imperialism to isolationism, nationalism) and the Twenties (e.g., economic prosperity, consumerism, women's suffrage)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046CD0","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SS-HS-5.2.5","text":"Students will evaluate how the Great Depression, New Deal policies and World War II transformed America socially and politically at home (e.g., stock market crash, relief, recovery, reform initiatives, increased role of government in business, influx of women into workforce, rationing) and reshaped its role in world affairs (e.g., emergence of the U.S. as economic and political superpower)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046CD2","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SS-HS-5.2.6","text":"Students will explain and give examples of how after WWII, America experienced economic growth (e.g., suburban growth), struggles for racial and gender equality (e.g., Civil Rights Movement), the extension of civil liberties (e.g., desegregation, Civil Rights Acts) and conflict over political issues (e.g., McCarthyism, U.S. involvement in Vietnam)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046CD3","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SS-HS-5.2.7","text":"Students will analyze how the United States participates with the global community to maintain and restore world peace (e.g., League of Nations, United Nations, Cold War politics, Persian Gulf War) and evaluate the impact of these efforts."}]},{"leaf":false,"text":"The History of the World","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C8B","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"SS-07-5.3.1","text":"Students will explain and give examples of how early hunters and gatherers (Paleolithic and Neolithic) developed new technologies as they settled into organized civilizations."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C8C","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"SS-07-5.3.2","text":"Students will describe the rise of classical civilizations and empires (Greece and Rome) and explain how these civilizations had lasting impacts on the world in government, philosophy, architecture, art, drama and literature."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C8E","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"SS-07-5.3.3","text":"Students will describe the rise of non-Western cultures (e.g., Egyptian, Chinese, Indian, Persian) and explain ways in which these cultures influenced government, philosophy, art, drama and literature in the present day."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C90","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"SS-07-5.3.4","text":"Students will describe developments during the Middle Ages (feudalism, nation states, monarchies, religious institutions, limited government, trade, trade associations, capitalism) and give examples of how these developments influenced modern societies."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046C91","dcterms_educationLevel":[{"prefLabel":"7"}],"asn_statementNotation":"SS-07-5.3.5","text":"Students will explain how the Age of Exploration (early civilizations prior to 1500 A.D.) produced extensive contact among isolated cultures and explain the impact of this contact."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046CD4","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SS-HS-5.3.1","text":"Students will explain how humans began to rediscover the ideas of the Classical Age (e.g., humanism, developments in art and architecture, literature, political theories) and to question their place in the universe during the Renaissance and Reformation."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046CD5","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SS-HS-5.3.2","text":"Students will explain and give examples of how new ideas and technologies led to an Age of Exploration by Europeans that brought great wealth to the absolute monarchies and caused significant political, economic and social changes (disease, religious ideas, technologies, new plants/animals, forms of government) to the other regions of the world."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046CD6","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SS-HS-5.3.3","text":"Students will analyze how an Age of Revolution brought about changes in science, thought, government and industry (e.g., Newtonian physics, free trade principles, rise of democratic principles, development of the modern state) that shaped the modern world, and evaluate the long range impact of these changes on the modern world."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046CD7","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SS-HS-5.3.4","text":"Students will analyze how nationalism, militarism and imperialism led to world conflicts and the rise of totalitarian governments (e.g., European imperialism in Africa, World War I, the Bolshevik Revolution, Nazism, World War II)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046CD8","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SS-HS-5.3.5","text":"Students will explain the rise of both the United States and the Soviet Union to superpower status following World War II, the subsequent development of the Cold War, and the formation of new nations in Africa, Asia, Eastern Europe and the Middle East, and evaluate the impact of these events on the global community."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1046CDA","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"asn_statementNotation":"SS-HS-5.3.6","text":"Students will explain how the second half of the 20th century was characterized by rapid social, political and economic changes that created new challenges (e.g., population growth, diminishing natural resources, environmental concerns, human rights issues, technological and scientific advances, shifting political alliances, globalization of the economy) in countries around the world, and give examples of how countries have addressed these challenges."}]}]}]