[{"leaf":false,"text":"Strand: History","children":[{"leaf":false,"text":"Content Standard I : Students are able to identify important people and events in order to analyze significant patterns, relationships, themes, ideas, beliefs, and turning points in New Mexico, United States, and world history in order to understand the complexity of the human experience.","children":[{"leaf":false,"text":"K-4 Benchmark I-A-New Mexico: Describe how contemporary and historical people and events have influenced New Mexico communities and regions.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F3F","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"1. Identify the customs, celebrations, and holidays of various cultures in New Mexico."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F40","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"1. Identify common attributes of people living in New Mexico today."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F41","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"1. Describe how historical people, groups, and events have influenced the local community."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F42","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"1. Describe how the lives and contributions of people of New Mexico influenced local communities and regions."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F43","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"1. Identify important issues, events, and individuals from New Mexico pre-history to the present."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F44","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"2. Describe the role of contemporary figures and how their contributions and perspectives are creating impact in New Mexico."}]},{"leaf":false,"text":"5-8 Benchmark I-A-New Mexico: Explore and explain how people and events have influenced the development of New Mexico up to the present day.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F45","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"1. Describe changes of governance of New Mexico (e.g., indigenous, Spanish, Mexican, French, Texan, United States)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F46","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"2. Explain the reasons for European exploration of the Americas."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F47","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"1. Describe the relationships among ancient civilizations of the world (e.g., scientific discoveries, architecture, politics, cultures, and religious systems) and their connection to the early development of New Mexico."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F48","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"1. Compare and contrast the contributions of the civilizations of the Western Hemisphere (e.g., Aztecs, Mayas, Toltecs, Mound Builders) with the early civilizations of the Eastern Hemisphere (e.g., Sumerians, Babylonians, Hebrews, Egyptians) and their impact upon societies, to include:<ul> <li>effect on world economies and trade</li> <li>roles of people, class structures, language</li> <li>religious traditions and forms of government</li> <li>cultural and scientific contributions (e.g., advances in astronomy, mathematics, agriculture, architecture, artistic and oral traditions, development of writing systems and calendars).</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F49","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"2. Describe the characteristics of other indigenous peoples that had an affect upon New Mexico's development (e.g., pueblo farmers, great plains horse culture, nomadic bands, noting their development of tools, trading routes, adaptation to environments, social structure, domestication of plants, and animals)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F4A","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"3. Explain the significance of trails and trade routes within the region (e.g., Spanish Trail, Camino Real, Santa Fe Trail)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F4B","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"4. Describe how important individuals, groups, and events impacted the development of New Mexico from 16th century to the present (e.g., Don Juan de Oñate, Don Diego deVargas, Pueblo Revolt, Popé, 1837 Revolt, 1848 Rebellion, Treaty of Guadalupe Hildago, William Becknell and the Santa Fe Trail, Buffalo Soldiers, Lincoln County War, Navajo Long Walk, Theodore Roosevelt and the Rough Riders, Robert Goddard, J. Robert Oppenhiemer, Smokey Bear, Dennis Chavez, Manuel Lujan, Manhattan Project, Harrison Schmitt, Albuquerque International Balloon Fiesta)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F4C","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"5. Explain how New Mexicans have adapted to their physical environments to meet their needs over time (e.g., living in the desert, control over water resources, pueblo structure, highway system, use of natural resources)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F4D","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"6. Explain the impact of New Mexico on the development of the American West up to the present, to include:<ul> <li>availability of land (e.g., individuals, governments, railroads, tribal)</li> <li>government land grants/treaties</li> <li>transportation (e.g., wagons, railroads, automobile)</li> <li>identification and use of natural and human resources</li> <li>population growth and economic patterns</li> <li>cultural interactions among indigenous and arriving populations and the resulting changes.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F4E","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"1. Compare and contrast the settlement patterns of the American Southwest with other regions of the United States."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F4F","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"2. Analyze New Mexico's role and impact on the outcome of the Civil War (e.g., strategic geographic location, significance of the Battle of Glorieta Pass, trade routes to California, native allegiances)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F50","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"3. Explain the role New Mexico played in the United States participation in the Spanish American War."}]},{"leaf":false,"text":"9-12 Benchmark I-A-New Mexico: Analyze how people and events of New Mexico have influenced United States and world history since statehood.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F51","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. Compare and contrast the relationships over time of Native American tribes in New Mexico with other cultures."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F52","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. Analyze the geographic, economic, social, and political factors of New Mexico that impacted United States and world history, to include:<ul> <li>land grant and treaty issues unresolved to present day and continuing to impact relations between and among citizens at the state, tribal, and federal government levels</li> <li>role of water issues as they relate to development of industry, population growth, historical issues, and current acequia systems/water organizations</li> <li>urban development</li> <li>role of the federal government (e.g., military bases, national laboratories, national parks, Indian reservations, transportation systems, water projects)</li> <li>unique role of New Mexico in the 21st century as a \"Minority Majority\" state.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F53","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. Analyze the role and impact of New Mexico and New Mexicans in World War II (e.g., Native Code Talkers, New Mexico National Guard, internment camps, Manhattan Project, Bataan Death March)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F54","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. Analyze the impact of the arts, sciences, and technology of New Mexico since World War II (e.g., artists, cultural artifacts, nuclear weapons, the arms race, technological advances, scientific developments, high tech industries, federal laboratories)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F55","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"5. Explain how New Mexico history represents a framework of knowledge and skills within which to understand the complexity of the human experience, to include:<ul> <li>analyze perspectives that have shaped the structures of historical knowledge</li> <li>describe ways historians study the past</li> <li>explain connections made between the past and the present and their impact.</li></ul>"}]},{"leaf":false,"text":"K-4 Benchmark I-B-United States: Understand connections among historical events, people, and symbols significant to United States history and cultures.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F56","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"1. Demonstrate an awareness of community leaders."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F57","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"1. Identify the significance of United States historical events and symbols (e.g., Martin Luther King, Jr. Day, Memorial Day, Independence Day, Labor Day, Veterans Day, United States flag, bald eagle)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F58","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"2. Identify and recognize major political and social figures in the United States."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F59","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"1. Describe the cultural diversity of individuals and groups and their contributions to United States history (e.g., George Washington, Ben Franklin, César Chávez, Rosa Parks, National Association for Advancement of Colored People [NAACP], tribal leaders, American Indian Movement [AIM])."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F5A","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"1. Describe local events and their connections to state history."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F5B","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"1. Describe local events and their connections and relationships to national history."}]},{"leaf":false,"text":"5-8 Benchmark I-B-United States: Analyze and interpret major eras, events, and individuals from the periods of exploration and colonization through the Civil War and Reconstruction in United States history.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F5C","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"1. Explain the motivations for the European exploration of the Americas (e.g., Leif Ericson, Christopher Columbus, John Cabot, Hernán Cortez, Jacques Cartier, Henry Hudson)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F5D","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"2. Describe and explain the reasons for colonization, to include:<ul> <li>religious freedom</li> <li>desire for land</li> <li>economic opportunity</li> <li>a new way of life, including the role and views of key individuals who founded colonies (e.g., John Smith, William Penn, Lord Baltimore).</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F5E","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"3. Explain the significance of major historical documents (e.g., the Mayflower Compact, the Declaration of Independence, Federalist Papers, United States Constitution, Bill of Rights, the Gettysburg Address)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F5F","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"4. Identify the interactions between American Indians and European settlers, including agriculture, cultural exchanges, alliances, and conflicts (e.g., the First Thanksgiving, the Pueblo Revolt, French and Indian War)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F60","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"5. Describe how the introduction of slavery into the Americas, and especially the United States, laid a foundation for conflict."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F61","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"6. Explain early representative government and identify democratic practices that emerged (e.g., Iroquois Nation model, town meetings, assemblies)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F62","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"1. Explain and describe the origins, obstacles, and impact of the Age of Exploration, to include:<ul> <li>improvements in technology (e.g., the clock, sextant, work of Prince Henry the Navigator)</li> <li>voyages of Columbus to the New World and the later searches for the Northwest passage</li> <li>introduction of disease and the resulting population decline, especially among indigenous peoples</li> <li>exchanges of technology, ideas, agricultural products and practices.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F63","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"1. Analyze United States political policies on expansion of the United States into the Southwest (e.g., Mexican Cession, Gadsden Purchase, broken treaties, Long Walk of the Navajos)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F64","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"1. Describe, evaluate, and interpret the economic and political reasons for the American Revolution, to include:<ul> <li>attempts to regulate colonial trade through passage of Tea Act, Stamp Act, and Intolerable Acts</li> <li>colonists' reaction to British policy (e.g., boycotts, the Sons of Liberty, petitions, appeals to Parliament)</li> <li>the ideas expressed in the Declaration of Independence, including the Preamble.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F65","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"2. Describe the aspirations, ideals, and events that served as the foundation for the creation of a new national government, to include:<ul> <li>Articles of Confederation, the Constitution, and the success of each in implementing the ideals of the Declaration of Independence</li> <li>major debates of the Constitutional Convention and their resolution (e.g., The Federalist Papers)</li> <li>contributions and roles of major individuals in the writing and ratification of the Constitution (e.g., George Washington, James Madison, Alexander Hamilton, Thomas Jefferson, James Monroe, John Jay)</li> <li>struggles over ratification of the Constitution and the creation of the Bill of Rights.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F66","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"3. Describe and explain the actions taken to build one nation from thirteen states, to include:<ul> <li>precedents established by George Washington (e.g., Cabinet, two-term presidency)</li> <li>Alexander Hamilton's financial plan (e.g., the National Bank, payment of debts)</li> <li>creation of political parties (Democratic Republicans and the Federalists).</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F67","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"4. Describe the successes and failures of the reforms during the Age of Jackson, to include:<ul> <li>extension of franchise to all white men</li> <li>Indian Removal, The Trail of Tears, The Long Walk</li> <li>abolition movement (e.g., Quakers, Harriet Tubman, Underground Railroad).</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F68","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"5. Describe, explain, and analyze the aims and impact of Western Expansion and the settlement of the United States, to include:<ul> <li>American belief in Manifest Destiny and how it led to the Mexican War and its consequences</li> <li>compare African American and Native American slavery</li> <li>westward migration of peoples (e.g., Oregon, California, Mormons, and Southwest)</li> <li>origins and early history of the Women's Movement.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F69","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"6. Explain how sectionalism led to the Civil War, to include:<ul> <li>different economies that developed in the North, South, and West</li> <li>addition of new states to the Union and the balance of power in the United States Senate (Missouri and 1850 Compromises)</li> <li>extension of slavery into the territories (e.g., Dred Scott Decision, Kansas-Nebraska Act, Frederick Douglass, John Brown)</li> <li>presidential election of 1860, Lincoln's victory, and the South's secession.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F6A","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"7. Explain the course and consequences of the Civil War and how it divided people in the United States, to include:<ul> <li>contributions and significance of key figures (e.g., Abraham Lincoln, Jefferson Davis, Robert E. Lee, William Tecumseh Sherman, Ulysses S. Grant)</li> <li>major turning points in the Civil War, including Gettysburg</li> <li>unique nature of the Civil War (e.g., impact of Americans fighting Americans, high casualties caused by disease and type of warfare, widespread destruction of American property)</li> <li>role of African Americans</li> <li>purpose and effect of the Emancipation Proclamation.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F6B","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"8. Analyze the character and lasting consequences of Reconstruction, to include:<ul> <li>Reconstruction plans</li> <li>impact of Lincoln's assassination and the impeachment of Andrew Johnson</li> <li>attempts to protect the rights and enhance the opportunities for freemen by the 13th, 14th, and 15th Amendments to the United States Constitution</li> <li>post-Civil War segregation policies and their resulting impact on racial issues in the United States.</li></ul>"}]},{"leaf":false,"text":"9-12 Benchmark I-B-United States: Analyze and evaluate the impact of major eras, events, and individuals in United States history since the Civil War and Reconstruction.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F6C","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. Analyze the impact and changes that Reconstruction had on the historical, political and social developments of the United States."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F6D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. Analyze the transformation of the American economy and the changing social and political conditions in the United States in response to the Industrial Revolution, to include:<ul> <li>innovations in technology, evolution of marketing techniques, changes to the standard of living, and the rise of consumer culture</li> <li>rise of business leaders and their companies as major forces in America (e.g., John D. Rockefeller, Andrew Carnegie)</li> <li>development of monopolies and their impact on economic and political policies (e.g., laissez-faire economics, trusts, trust busting)</li> <li>growth of cities (e.g., influx of immigrants, rural-to-urban migrations, racial and ethnic conflicts that resulted)</li> <li>efforts of workers to improve working conditions (e.g., organizing labor unions, strikes, strike breakers)</li> <li>rise and effect of reform movements (e.g., Populists, William Jennings Bryan, Jane Addams, muckrakers)</li> <li>conservation of natural resources (e.g., the Grand Canyon, Yellowstone, Anasazi ruins at Mesa Verde, Colorado, National Reclamation Act of 1902)</li> <li>progressive reforms (e.g., the national income tax, direct election of senators, women's suffrage, prohibition).</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F6E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. Analyze the United States' expanding role in the world during the late 19th and 20th centuries, to include:<ul> <li>causes for a change in foreign policy from isolationism to interventionism</li> <li>causes and consequences of the Spanish American War</li> <li>expanding influence in the Western Hemisphere (e.g., the Panama Canal, Roosevelt Corollary added to the Monroe Doctrine, the \"Big Stick\" policy, \"Dollar Diplomacy\")</li> <li>events that led to the United States' involvement in World War I</li> <li>United States' rationale for entry into WWI and impact on military process, public opinion and policy</li> <li>United States' mobilization in WWI (e.g., its impact on politics, economics, and society)</li> <li>United States' impact on the outcome of World War I</li> <li>United States' role in settling the peace (e.g., Woodrow Wilson, Treaty of Versailles, League of Nations, Senator Henry Cabot Lodge, Sr.).</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F6F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. Analyze the major political, economic, and social developments that occurred between World War I and World War II, to include:<ul> <li>social liberation and conservative reaction during the 1920s (e.g., flappers, prohibition, the Scopes trial, Red Scare)</li> <li>causes of the Great Depression (e.g., over production, under consumption, credit structure)</li> <li>rise of youth culture in the \"Jazz Age\"</li> <li>development of mass/popular culture (e.g., rise of radio, movies, professional sports, popular literature)</li> <li>human and natural crises of the Great Depression, (e.g., unemployment, food lines, the Dust Bowl, western migration of Midwest farmers)</li> <li>changes in policies, role of government, and issues that emerged from the New Deal (e.g., the Works programs, Social Security, challenges to the Supreme Court)</li> <li>role of changing demographics on traditional communities and social structures.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F70","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"5. Analyze the role of the United States in World War II to include:<ul> <li>reasons the United States moved from a policy of isolationism to involvement after the bombing of Pearl Harbor</li> <li>events on the home front to support the war effort (e.g., war bond drives, mobilization of the war industry, women and minorities in the work force)</li> <li>major turning points in the war (e.g., the Battle of Midway, D-Day Invasion, dropping of atomic bombs on Japan).</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F71","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"6. Analyze the development of voting and civil rights for all groups in the United States following Reconstruction, to include:<ul> <li>intent and impact of the 13th, 14th, and 15th Amendments to the Constitution</li> <li>segregation as enforced by Jim Crow laws following Reconstruction</li> <li>key court cases (e.g., Plessy v. Ferguson, Brown v. Board of Education of Topeka, Roe v. Wade)</li> <li>roles and methods of civil rights advocates (e.g., Martin Luther King, Jr., Malcolm X, Rosa Parks, Russell Means, César Chávez)</li> <li>the passage and effect of the voting rights legislation on minorities (e.g., 19th Amendment, role of Arizona Supreme Court decision on Native Americans and their disenfranchisement under Arizona constitution and subsequent changes made in other state constitutions regarding their voting rights [New Mexico 1962], 1964 Civil Rights Act, Voting Act of 1965, 24th Amendment)</li> <li>impact and reaction to the efforts to pass the Equal Rights Amendment</li> <li>rise of Black Power, Brown Power, American Indian Movement, United Farm Workers.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F72","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"7. Analyze the impact of World War II and the Cold War on United States foreign and domestic policy, to include:<ul> <li>origins, dynamics, and consequences of the Cold War tensions between the United States and the Soviet Union</li> <li>new role of the United States as a world leader (e.g., Marshall Plan, NATO)</li> <li>need for, establishment, and support of the United Nations</li> <li>implementation of the foreign policy of containment, including the Truman Doctrine</li> <li>Red Scare (e.g., McCarthyism, House Un-American Activities Committee, nuclear weapons, arms race)</li> <li>external confrontations with communism (e.g., the Berlin Blockade, Berlin Wall, Bay of Pigs, Cuban Missile Crisis, Korea, Vietnam)</li> <li>Sputnik and the space race</li> <li>image of 1950s affluent society</li> <li>political protests of Vietnam Conflict (War)</li> <li>counter culture in the 1960s.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F73","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"8. Analyze the impact of the post-Cold War Era on United States foreign policy, to include:<ul> <li>role of the United States in supporting democracy in Eastern Europe following the collapse of the Berlin Wall</li> <li>new allegiances in defining the new world order</li> <li>role of technology in the information age.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F74","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"9. Explain how United States history represents a framework of knowledge and skills within which to understand the complexity of the human experience, to include:<ul> <li>analyze perspectives that have shaped the structures of historical knowledge</li> <li>describe ways historians study the past</li> <li>explain connections made between the past and the present and their impact.</li></ul>"}]},{"leaf":false,"text":"K-4 Benchmark I-C-World: Students will identify and describe similar historical characteristics of the United States and its neighboring countries.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F75","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"1. Identify the local, state, and national symbols (e.g., flag, bird, song)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F76","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"1. Identify and compare celebrations and events from the United States, Mexico, and Canada."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F77","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"1. Describe and compare similarities of the history of peoples in North America through literature (e.g., storytelling, fables, folktales, fairy tales)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F78","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"1. Identify and compare components that create a community in the United States and its neighboring countries."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F79","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"1. Explain how historical events, people, and culture influence present day Canada, Mexico, and the United States (e.g., food, art, shelter, language)."}]},{"leaf":false,"text":"5-8 Benchmark I-C-World: Compare and contrast major historical eras, events, and figures from ancient civilizations to the Age of Exploration.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F7A","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"1. Describe the characteristics of early societies, including the development of tools and adaptation to environments."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F7B","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"2. Identify, describe, and explain the political, religious, economic and social conditions in Europe that led to the Era of Colonization."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F7C","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"3. Identify the European countries that colonized the North American continent and their areas of settlement."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F7D","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"4. Describe the development of slavery as a widespread practice that limits human freedoms and potentials."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F7E","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"1. Describe and compare the characteristics of the ancient civilizations of Egypt, Mesopotamia and China and explain the importance of their contributions to later civilizations, to include:<ul> <li>significance of river valleys</li> <li>early irrigation and its impact on agriculture</li> <li>forms of government (e.g., the theocracies in Egypt, dynasties in China)</li> <li>effect on world economies and trade</li> <li>key historical figures</li> <li>religious traditions, cultural, and scientific contributions (e.g., writing systems, calendars, building of monuments such as the pyramids).</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F7F","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"2. Describe and analyze the geographic, political, economic, religious, and social structures of early civilizations of India, to include:<ul> <li>location and description of the river systems and other topographical features that supported the rise of this civilization</li> <li>significance of the Aryan invasions</li> <li>structure and function of the caste system</li> <li>important aesthetic and intellectual traditions (e.g., Sanskrit literature, medicine, metallurgy, mathematics including Hindu-Arabic numerals and the number zero).</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F80","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"3. Describe and analyze the geographic, political, economic, religious, and social structures of the early civilizations in China, to include:<ul> <li>location and description of the origins of Chinese civilization in the Huang-He Valley, Shang dynasty</li> <li>geographical features of China that made governance and movement of ideas and goods difficult and served to isolate the country</li> <li>life of Confucius and the fundamental teachings of Confucianism and Taoism</li> <li>rule by dynasties (e.g., Shang, Qin, Han, Tang, and Ming)</li> <li>historical influence of China on other parts of the world (e.g., tea, paper, wood block printing, compass, gunpowder).</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F81","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"4. Describe major religions of the world to include Hinduism, Buddhism, Judaism, Christianity and Islam (e.g., founding leaders, traditions, customs, beliefs)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F82","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"5. Compare and contrast the geographic, political, economic, and social characteristics of the Ancient Greek, Ancient Roman, Ottoman, Indian, Arabic, African, and Middle Eastern civilizations and their enduring impacts on later civilizations, to include:<ul> <li>influence of Mediterranean geography on the development and expansion of the civilizations</li> <li>development of concepts of government and citizenship (e.g., democracy, republics, codification of laws, Code of Hammurabi)</li> <li>scientific and cultural advancements (e.g., networks of roads, aqueducts, art, architecture, literature, theater, philosophy)</li> <li>contributions and roles of key figures, (e.g., Socrates, Plato, Aristotle, Alexander the Great, Julius Caesar, Augustus).</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F83","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"6. Compare and contrast the political and economic events and the social and geographic characteristics of Medieval European life and its enduring impacts on later civilizations, to include:<ul> <li>creation and expansion of the Byzantine empire</li> <li>reasons for the fall of the Roman Empire</li> <li>new forms of government, feudalism, and the beginning of limited government with the Magna Carta</li> <li>role of the Roman Catholic Church and its monasteries; causes, course, and effects of the Crusades</li> <li>impact of the Black Plague</li> <li>contributions and roles of key figures (e.g., Charlemagne, Joan of Arc, Marco Polo).</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F84","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"1. Compare and contrast the influence of Spain on the Western Hemisphere from colonization to the present."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F85","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"1. Describe and explain the significance of the Line of Demarcation on the colonization of the New World."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F86","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"2. Compare and contrast the influence of European countries (e.g., England, France, Holland) on the development of colonies in the New World."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F87","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"3. Describe and explain the impact the American Revolution on France and the French Revolution."}]},{"leaf":false,"text":"9-12 Benchmark I-C-World: Analyze and interpret the major eras and important turning points in world history from the Age of Enlightenment to the present to develop an understanding of the complexity of the human experience.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F88","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. Describe and explain how the Renaissance and Reformation influenced education, art, religion, and government in Europe, to include:<ul> <li>development of Renaissance artistic and literary traditions (e.g., Michelangelo, Leonardo da Vinci, Shakespeare)</li> <li>development of Protestantism (e.g., Martin Luther, John Calvin)</li> <li>religious conflict and persecutions (e.g., Spanish Inquisition).</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F89","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. Analyze and evaluate the actions of competing European nations for colonies around the world and the impact on indigenous populations."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F8A","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. Explain and analyze revolutions (e.g., democratic, scientific, technological, social) as they evolved throughout the Enlightenment and their enduring effects on political, economic, and cultural institutions, to include:<ul> <li>Copernican view of the universe and Newton's natural laws</li> <li>tension and cooperation between religion and new scientific discoveries</li> <li>impact of Galileo's ideas and the introduction of the scientific method as a means of understanding the universe</li> <li>events and ideas that led to parliamentary government (English Civil War, Glorious Revolution)</li> <li>Enlightenment philosophies used to support events leading to American and French Revolutions</li> <li>Napoleonic Era (e.g., codification of law)</li> <li>Latin America's wars of independence.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F8B","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. Analyze the pattern of historical change as evidenced by the Industrial Revolution, to include:<ul> <li>conditions that promoted industrialization</li> <li>how scientific and technological innovations brought about change</li> <li>impact of population changes (e.g., population growth, rural-to-urban migrations, growth of industrial cities, emigration out of Europe)</li> <li>evolution of work/business and the role of labor (e.g., the demise of slavery, division of labor, union movement, impact of immigration)</li> <li>political and economic theories of capitalism and socialism (e.g., Adam Smith, Karl Marx)</li> <li>status and roles of women and minorities.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F8C","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"5. Analyze and evaluate the impact of 19th century imperialism from varied perspectives, to include:<ul> <li>clash of cultures</li> <li>British Empire expands around the world</li> <li>nationalism (e.g., competition and conflict between European nations for raw materials and markets, acquisition of colonies in Africa and Asia, impact on indigenous populations).</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F8D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"6. Describe and analyze the geographic, political, economic, religious, and social structures of the civilizations of East Asia."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F8E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"7. Analyze and evaluate the causes, events, and effects of World War I, to include:<ul> <li>rise of nationalism (e.g., unification of Germany, Otto Von Bismarck's leadership)</li> <li>rise of ethnic and ideological conflicts (e.g., the Balkans, Austria-Hungary, decline of the Ottoman Empire)</li> <li>major turning points and the importance of geographic, military, and political factors in decisions and outcomes human costs of the mechanization of war (e.g., machine-gun, airplane, poison gas, submarine, trench warfare, tanks)</li> <li>effects of loss of human potential through devastation of populations and their successive generations</li> <li>effects of the Russian Revolution and the implementation of communist rule.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F8F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"8. Analyze and evaluate the causes, events, and impacts of World War II from various perspectives, to include:<ul> <li>failures and successes of the Treaty of Versailles and the League of Nations</li> <li>rise of totalitarianism (e.g., Nazi Germany's policies of European domination, Holocaust)</li> <li>political, diplomatic, and military leadership (e.g., Winston Churchill, Joseph Stalin, Franklin Roosevelt, Emperor Hirohito, Adolf Hitler, Benito Mussolini, Francisco Franco)</li> <li>principal theaters of battle, major turning points, and geographic factors in military decisions and outcomes (e.g., Pearl Harbor, \"island-hopping,\" D-Day invasion, Stalingrad, atomic bombs dropped on Japan).</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F90","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"9. Analyze and evaluate international developments following World War II, the Cold War, and post-Cold War, to include: <ul><li>war crime trials</li> <li>creation of the state of Israel and resulting conflicts in the Middle East</li> <li>rebuilding of Western Europe (e.g., Marshall Plan, NATO)</li> <li>Soviet control of Eastern Europe (e.g., Warsaw Pact, Hungarian Revolt)</li> <li>creation and role of the United Nations</li> <li>Mao Zedong and the Chinese Revolution (e.g., Long March, Taiwan, Cultural Revolution)</li> <li>national security in the changing world order</li> <li>technology's role in ending the Cold War</li> <li>fluidity of political alliances</li> <li>new threats to peace</li> <li>reasons for the collapse of the Soviet Union and the end of the Cold War</li> <li>use of technology in the Information Age.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F91","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"10. Evaluate the ideologies and outcomes of independence movements in the emerging third world to include:<ul> <li>French Indochina and the Vietnam War (e.g., the role of Ho Chi Minh)</li> <li>Mohandas Gandhi's non-violence movement for India's independence</li> <li>apartheid in South Africa and evolution from white minority government (e.g., Nelson Mandela, Desmond Tutu)</li> <li>Middle East conflicts (Israel, Palestine, Egypt).</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F92","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"11. Analyze historical and modern-day policies of the Western Hemisphere, with emphasis on Mexico and Canada, to include:<ul> <li>expansion of democracy in Western Hemisphere</li> <li>immigration and migration issues</li> <li>changes in foreign policy brings spiraling impact on each nation and international relations</li> <li>trade.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F93","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"12. Explain how world history presents a framework of knowledge and skills within which to understand the complexity of the human experience, to include:<ul> <li>analyze perspectives that have shaped the structures of historical knowledge</li> <li>describe ways historians study the past</li> <li>explain connections made between the past and the present and their impact.</li></ul>"}]},{"leaf":false,"text":"K-4 Benchmark I-D-Skills: Understand time passage and chronology.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F94","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"1. Understand the concept of past and present."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F95","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"1. Demonstrate the use of timelines in order to show events in relation to one another."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F96","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"1. Correctly sequence historical events."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F97","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"1. Interpret information from multiple resources and contexts to determine chronological relationships."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F98","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"1. Describe and explain how historians and archaeologists provide information about people in different time periods."}]},{"leaf":false,"text":"5-8 Benchmark I-D-Skills: Research historical events and people from a variety of perspectives.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F99","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"1. Differentiate between, locate, and use primary and secondary sources (e.g., computer software, interviews, biographies, oral histories, print, visual material, artifacts) to acquire information."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F9A","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"2. Use resources for historical information (e.g., libraries, museums, historical societies, courthouse, world wide web, family records, elders)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F9B","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"3. Gather, organize, and interpret information using a variety of media and technology."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F9C","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"4. Show the relationship between social contexts and events."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F9D","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"5. Use effective communication skills and strategies to share research findings."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F9E","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"1. Organize information by sequencing, categorizing, identifying cause-and-effect relationships, comparing and contrasting, finding the main idea, summarizing, making generalizations and predictions, drawing inferences and conclusions."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F9F","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"2. Identify different points of view about an issue or topic."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FA0","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"3. Use a decision-making process to identify a situation that requires a solution; gather information, identify options, predict consequences, and take action to implement that solution."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FA1","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"1. Analyze and evaluate information by developing and applying criteria for selecting appropriate information and use it to answer critical questions."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FA2","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"2. Demonstrate the ability to examine history from the perspectives of the participants."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FA3","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"3. Use the problem-solving process to identify a problem; gather information, list and consider advantages and disadvantages, choose and implement a solution, and evaluate the effectiveness of the solution using technology to present findings."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FA4","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"1. Understand and apply the problem-solving skills for historical research, to include:<ul> <li>use of primary and secondary sources</li> <li>sequencing</li> <li>posing questions to be answered by historical inquiry</li> <li>collecting, interpreting, and applying information</li> <li>gathering and validating materials that present a variety of perspectives.</li></ul>"}]},{"leaf":false,"text":"9-12 Benchmark I-D-Skills: Use critical thinking skills to understand and communicate perspectives of individuals, groups, and societies from multiple contexts.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FA5","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. Understand how to use the skills of historical analysis to apply to current social, political, geographic, and economic issues."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FA6","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. Apply chronological and spatial thinking to understand the importance of events."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FA7","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. Describe primary and secondary sources and their uses in research."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FA8","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. Explain how to use a variety of historical research methods and documents to interpret and understand social issues (e.g., the friction among societies, the diffusion of ideas)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FA9","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"5. Distinguish \"facts\" from authors' opinions and evaluate an author's implicit and explicit philosophical assumptions, beliefs, or biases about the subject."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FAA","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"6. Interpret events and issues based upon the historical, economic, political, social, and geographic context of the participants."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FAB","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"7. Analyze the evolution of particular historical and contemporary perspectives."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FAC","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"8. Explain how to use technological tools to research data, verify facts and information, and communicate findings."}]}]}]},{"leaf":false,"text":"Strand: Geography","children":[{"leaf":false,"text":"Content Standard II: Students understand how physical, natural, and cultural processes influence where people live, the ways in which people live, and how societies interact with one another and their environments.","children":[{"leaf":false,"text":"K-4 Benchmark II-A: Understand the concept of location by using and constructing maps, globes, and other geographic tools to identify and derive information about people, places, and environments.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FAD","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"1. Define relative location of items in the physical environment in terms of over, under, near, far, up, and down."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FAE","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"2. Define personal direction of front, back, left, and right."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FAF","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"1. Understand maps and globes as representations of places and phenomena."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FB0","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"2. Identify and use the four cardinal directions to locate places in community, state, and tribal districts."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FB1","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"3. Create, use, and describe simple maps to identify locations within familiar places (e.g., classroom, school, community, state)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FB2","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"1. Use a variety of maps to locate specific places and regions."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FB3","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"2. Identify major landforms, bodies of water, and other places of significance in selected countries, continents, and oceans."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FB4","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"1. Identify and use the mapping tools of scale, compass rose, grid, symbols, and mental mapping to locate and draw places on maps and globes."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FB5","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"1. Apply geographic tools of title, grid system, legends, symbols, scale, and compass rose to construct and interpret maps."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FB6","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"2. Translate geographic information into a variety of formats such as graphs, maps, diagrams, and charts."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FB7","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"3. Draw conclusions and make generalizations from geographic information and inquiry."}]},{"leaf":false,"text":"5-8 Benchmark II-A: Analyze and evaluate the characteristics and purposes of geographic tools, knowledge, skills and perspectives and apply them to explain the past, present, and future in terms of patterns, events, and issues.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FB8","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"1. Make and use different kinds of maps, globes, charts, and databases."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FB9","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"2. Demonstrate how different areas of the United States are organized and interconnected."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FBA","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"3. Identify and locate each of the fifty states and capitols of the United States."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FBB","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"4. Identify tribal territories within states."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FBC","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"5. Employ fundamental geographic vocabulary (e.g., latitude, longitude, interdependence, accessibility, connections)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FBD","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"6. Demonstrate a relational understanding of time zones."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FBE","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"7. Use spatial organization to communicate information"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FBF","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"8. Identify and locate natural and man-made features of local, regional, state, national, and international locales."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FC0","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"1. Identify the location of places using latitude and longitude."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FC1","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"2. Draw complex and accurate maps from memory and interpret them to answer questions about the location of physical features."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FC2","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"1. Describe ways that mental maps reflect attitudes about places."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FC3","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"2. Describe factors affecting location of human activities, including land use patterns in urban, suburban, and rural areas."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FC4","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"1.Describe patterns and processes of migration and diffusion."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FC5","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"2.Provide a historic overview of patterns of population expansion into the West by the many diverse groups of people (e.g., Native Americans, European Americans, and others) to include movement into the Southwest along established settlement, trade, and rail routes."}]},{"leaf":false,"text":"9-12 Benchmark II-A: Analyze and evaluate the characteristics and purposes of geographic tools, knowledge, skills, and perspectives, and apply them to explain the past, present, and future in terms of patterns, events, and issues.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FC6","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. Evaluate and select appropriate geographic representations to analyze and explain natural and man-made issues and problems."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FC7","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. Understand the vocabulary and concepts of spatial interaction, including an analysis of population distributions and settlements patterns."}]},{"leaf":false,"text":"K-4 Benchmark II-B: Distinguish between natural and human characteristics of places and use this knowledge to define regions, their relationships with other regions, and patterns of change.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FC8","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"1. Identify natural characteristics of places (e.g., climate, topography)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FC9","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"1. Identify and classify characteristics of places as human or natural."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FCA","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"2. Identify how traditional tribal and local folklore attempt to explain weather, characteristics of places, and human origins and relationships."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FCB","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"1. Describe how climate, natural resources, and natural hazards affect activities and settlement patterns."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FCC","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"2. Explain how people depend on the environment and its resources to satisfy their basic needs."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FCD","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"1. Describe how human and natural processes can sometimes work together to shape the appearance of places (e.g., post-fire reforestation)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FCE","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"2. Explore examples of environmental and social changes in various regions."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FCF","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"1. Identify a region as an area with unifying characteristics (e.g., human, weather, agriculture, industry, natural characteristics)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FD0","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"2. Describe the regions of New Mexico, the United States, and the Western Hemisphere."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FD1","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"3. Identify ways in which different individuals and groups of people view and relate to places and regions."}]},{"leaf":false,"text":"5-8 Benchmark II-B: Explain the physical and human characteristics of places and use this knowledge to define regions, their relationships with other regions, and their patterns of change.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FD2","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"1. Describe human and natural characteristics of places."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FD3","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"2. Describe similarities and differences among regions of the globe, and their patterns of change."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FD4","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"1. Explain how places change due to human activity."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FD5","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"2. Explain how places and regions serve as cultural symbols and explore the influences and effects of regional symbols."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FD6","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"3. Identify a region by its formal, functional, or perceived characteristics."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FD7","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"1. Select and explore a region by its distinguishing characteristics."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FD8","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"2. Describe the role of technology in shaping the characteristics of places."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FD9","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"3. Explain how and why regions change using global examples."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FDA","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"4. Describe geographically based pathways of inter-regional interaction (e.g., Camino Real's role in establishing a major trade and communication route in the New World, the significance of waterways)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FDB","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"1. Describe how individual and cultural characteristics affect perceptions of locales and regions."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FDC","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"2. Describe political, population, and economic regions that result from patterns of human activity, using New Mexico as an example."}]},{"leaf":false,"text":"9-12 Benchmark II-B: Analyze natural and man-made characteristics of worldwide locales; describe regions, their interrelationships, and patterns of change.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FDD","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. Analyze the interrelationships among natural and human processes that shape the geographic connections and characteristics of regions, including connections among economic development, urbanization, population growth, and environmental change."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FDE","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. Analyze how the character and meaning of a place is related to its economic, social, and cultural characteristics, and why diverse groups in society view places and regions differently."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FDF","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. Analyze and evaluate changes in regions and recognize the patterns and causes of those changes (e.g., mining, tourism)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FE0","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. Analyze and evaluate why places and regions are important to human identity (e.g., sacred tribal grounds, culturally unified neighborhoods)."}]},{"leaf":false,"text":"K-4 Benchmark II-C: Be familiar with aspects of human behavior and man-made and natural environments in order to recognize their impact on the past and present.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FE1","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"1. Identify family customs and traditions and explain their importance."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FE2","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"2. Describe the natural characteristics of places (e.g., landforms, bodies of water, natural resources, and weather)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FE3","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"1. Identify examples of and uses for natural resources in the community, state, and nation."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FE4","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"2. Describe the human characteristics of places such as housing types and professions."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FE5","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"1. Identify ways in which people depend on natural and man-made environments including natural resources to meet basic needs."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FE6","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"1. Identify personal behaviors that can affect community planning."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FE7","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"2. Identify ways in which people have modified their environments (e.g., building roads, clearing land for development, mining, and constructing towns and cities)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FE8","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"3. Describe the consequences of human modification of the natural environment (e.g., use of irrigation to improve crop yields, highways)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FE9","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"1. Explain how geographic factors have influenced people, including settlement patterns and population distribution in New Mexico, past and present."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FEA","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"2. Describe how environments, both natural and man-made, have influenced people and events over time, and describe how places change."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FEB","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"3. Understand how visual data (e.g., maps, graphs, diagrams, tables, charts) organizes and presents geographic information."}]},{"leaf":false,"text":"5-8 Benchmark II-C: Understand how human behavior impacts man-made and natural environments, recognizes past and present results, and predicts potential changes.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FEC","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"1. Describe how man-made and natural environments have influenced conditions in the past."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FED","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"2. Identify and define geographic issues and problems from accounts of current events."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FEE","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"1. Compare and contrast the influences of man-made and natural environments upon ancient civilizations."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FEF","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"1. Explain how differing perceptions of places, people, and resources have affected events and conditions in the past."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FF0","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"2. Interpret and analyze geographic information obtained from a variety of sources (e.g., maps, directly witnessed and surveillanced photographic and digital data, symbolic representations [e.g., graphs, charts, diagrams, tables], personal documents, and interviews)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FF1","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"3. Recognize geographic questions and understand how to plan and execute an inquiry to answer them."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FF2","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"4. Explain a contemporary issue using geographic knowledge, tools, and perspectives."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FF3","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"1. Explain and evaluate how changing perceptions of place and the natural environment have affected human behavior"}]},{"leaf":false,"text":"9-12 Benchmark II-C: Analyze the impact of people, places, and natural environments upon the past and present in terms of our ability to plan for the future.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FF4","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. Analyze the fundamental role that geography has played in human history (e.g., the Russian winter on the defeat of Napoleon's army and the same effect in World War II)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FF5","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. Compare and contrast how different viewpoints influence policy regarding the use and management of natural resources."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FF6","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. Analyze the role that spatial relationships have played in effecting historic events."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FF7","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. Analyze the use of and effectiveness of technology in the study of geography."}]},{"leaf":false,"text":"K-4 Benchmark II-D: Understand how physical processes shape the Earth's surface patterns and biosystems.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FF8","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"1. Describe the Earth's physical characteristics."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FF9","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"1. Describe the Earth-Sun relationship and how it affects living conditions on Earth."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FFA","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"1. Describe the physical processes that affect the Earth's features (e.g., weather, erosion)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FFB","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"2. Identify characteristics of physical systems (e.g., water cycle)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FFC","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"1. Identify the components of the Earth's biosystems and their makeup (e.g., air, land, water, plants, and animals)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FFD","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"2. Describe how physical processes shape features on the Earth's surface."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FFE","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"1. Explain how the Earth-Sun relationships produce day and night, seasons, major climatic variations, and cause the need for time zones."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042FFF","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"2. Describe the four provinces (plains, mountains, plateau, and basin and range) that make up New Mexico's land surface (geographic conditions)."}]},{"leaf":false,"text":"5-8 Benchmark II-D: Explain how physical processes shape the Earth's surface patterns and biosystems.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043000","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"1. Explain how the four provinces of New Mexico's land surface (plains, mountains, plateau, and basin and range) support life."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043001","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"1. Describe how physical processes shape the environmental patterns of air, land, water, plants and animals."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043002","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"1. Explain how physical processes influence the formation and location of resources."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043003","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"2. Use data to interpret changing patterns of air, land, water, plants, and animals."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043004","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"3. Explain how ecosystems influence settlements and societies."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043005","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"1. Explain how human activities and physical processes influence change in ecosystems."}]},{"leaf":false,"text":"9-12 Benchmark II-D: Analyze how physical processes shape the Earth's surface patterns and biosystems.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043006","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. Analyze how the Earth's physical processes are dynamic and interactive."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043007","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. Analyze the importance of ecosystems in understanding environments."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043008","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. Explain and analyze how water is a scare resource in New Mexico, both in quantity and quality."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043009","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. Explain the dynamics of the four basic components of the Earth's physical systems (atmosphere, biosphere, lithosphere, and hydrosphere)."}]},{"leaf":false,"text":"K-4 Benchmark II-E : Describe how economic, political, cultural, and social processes interact to shape patterns of human populations, and their interdependence, cooperation, and conflict.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S104300A","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"1. Identify classroom population."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104300B","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"1. Identify characteristics of culture (e.g., language, customs, religion, shelter)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104300C","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"1. Describe how characteristics of culture affect behaviors and lifestyles."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104300D","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"1. Describe how patterns of culture vary geographically."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104300E","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"2. Describe how transportation and communication networks are used in daily life."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104300F","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"3. Describe how cooperation and conflict affect neighborhoods and communities."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043010","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"1. Describe how cultures change."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043011","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"2. Describe how geographic factors influence the location and distribution of economic activities."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043012","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"3. Describe types and patterns of settlements."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043013","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"4. Identify the causes of human migration."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043014","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"5. Describe how and why people create boundaries and describe types of boundaries."}]},{"leaf":false,"text":"5-8 Benchmark II-E: Understand how economic, political, cultural, and social processes interact to shape patterns of human populations, and their interdependence, cooperation, and conflict.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043015","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"1. Explain how physical features influenced the expansion of the United States."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043016","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"1. Explain how human migration impacted places, societies, and civilizations."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043017","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"2. Describe, locate, and compare different settlement patterns throughout the world."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043018","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"3. Explain how cultures create a cultural landscape, locally and throughout the world, and how these landscapes change over time."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043019","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"1. Analyze New Mexico settlement patterns and their impact on current issues."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104301A","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"2. Describe and analyze how the study of geography is used to improve our quality of life, including urban and environmental planning"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104301B","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"3. Explain the accessibility to the New Mexico territory via the Santa Fe Trail and the railroad, conflicts with indigenous peoples, and the resulting development of New Mexico."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104301C","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"1. Explain and describe how movement of people impacted and shaped western settlement of the United States (e.g., growth of towns and cities, affect upon native populations, railroads, livestock)."}]},{"leaf":false,"text":"9-12 Benchmark II-E: Analyze and evaluate how economic, political, cultural, and social processes interact to shape patterns of human populations, and their interdependence, cooperation, and conflict.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S104301D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. Analyze the factors influencing economic activities (e.g., mining, ranching, agriculture, tribal gaming, tourism, high tech) that have resulted in New Mexico's population growth."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104301E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. Analyze the effects of geographic factors on major events in United States and world history."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104301F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. Analyze the interrelationships among settlement, migration, population-distribution patterns, landforms, and climates in developing and developed countries."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043020","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. Analyze how cooperation and conflict are involved in shaping the distribution of political, social and economic factors in New Mexico, United States, and throughout the world (e.g., land grants, border issues, United States territories, Israel and the Middle East, the former Soviet Union, and Sub-Saharan Africa)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043021","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"5. Analyze how cultures shape characteristics of a region."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043022","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"6. Analyze how differing points of view and self-interest play a role in conflict over territory and resources (e.g., impact of culture, politics, strategic locations, resources)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043023","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"7. Evaluate the effects of technology on the developments, changes to, and interactions of cultures."}]},{"leaf":false,"text":"K-4 Benchmark II-F: Describe how natural and man-made changes affect the meaning, use, distribution, and value of resources.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043024","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"1. Identify natural resources."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043025","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"1. Describe the role of resources in daily life."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043026","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"2. Describe ways that humans depend upon, adapt to, and affect the physical environment."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043027","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"1. Describe ways that people and groups can conserve and replenish natural resources."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043028","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"1. Identify the characteristics of renewable and nonrenewable resources."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043029","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"1. Identify the distributions of natural and man-made resources in New Mexico, the Southwest, and the United States."}]},{"leaf":false,"text":"5-8 Benchmark II-F: Understand the effects of interactions between human and natural systems in terms of changes in meaning, use, distribution, and relative importance of resources.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S104302A","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"1. Understand how resources impact daily life."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104302B","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"1. Describe how human modifications to physical environments and use of resources in one place often lead to changes in other places."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104302C","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"1. Describe and evaluate the use and distribution of resources and their impact on countries throughout the world."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104302D","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"2. Describe how environmental events (e.g., hurricanes, tornados, floods) affect human activities and resources."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104302E","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"1. Describe the differing viewpoints that individuals and groups have with respect to the use of resources."}]},{"leaf":false,"text":"9-12 Benchmark II-F: Analyze and evaluate the effects of human and natural interactions in terms of changes in the meaning, use, distribution, and importance of resources in order to predict our global capacity to support human activity.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S104302F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. Compare the ways man-made and natural processes modify the environment and how these modifications impact resource allocations."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043030","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. Analyze how environmental changes bring about and impact resources."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043031","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. Analyze the geographic factors that influence the major world patterns of economic activity, economic connections among different regions, changing alignments in world trade partners, and the potential redistribution of resources based on changing patterns and alignments."}]}]}]},{"leaf":false,"text":"Strand: Civics and Government","children":[{"leaf":false,"text":"Content Standard III: Students understand the ideals, rights, and responsibilities of citizenship and understand the content and history of the founding documents of the United States with particular emphasis on the United States and New Mexico constitutions and how governments function at local, state, tribal, and national levels.","children":[{"leaf":false,"text":"K-4 Benchmark III-A: Know the fundamental purposes, concepts, structures, and functions of local, state, tribal, and national governments.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043032","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"1. Identify authority figures and describe their roles (e.g., parents, teachers, principal, superintendent, police, public officials)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043033","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"1. Understand the purpose of rules and identify examples of rules and the consequences of breaking them."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043034","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"2. Describe different groups and rules that apply to them (e.g., families, classrooms, communities)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043035","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"1. Understand the purposes of government."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043036","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"2. Describe and compare class rules made by direct democracy (entire class votes on the rules) and by representative democracy (class elects a smaller group to make the rules)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043037","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"1. Explain the basic structure and functions of local governments."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043038","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"2. Describe and give examples of \"public good.\""},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043039","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"3. Explain how New Mexico helps to form a nation with other states."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104303A","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"1. Explain how the organization of New Mexico's government changed during its early history."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104303B","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"2. Compare how the State of New Mexico serves national interests and the interests of New Mexicans."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104303C","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"3. Explain the difference between making laws, carrying out the laws, and determining if the laws have been broken, and identify the government bodies that perform these functions at the local, state, tribal, and national levels."}]},{"leaf":false,"text":"5-8 Benchmark III-A: Understand the structure, functions, and powers of government (local, state, tribal and national).","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S104303D","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"1. Explain how the three branches of national government function and understand how they are defined in the United States Constitution."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104303E","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"2. Identify the fundamental ideals and principles of our republican form of government (e.g., inalienable rights (\"life, liberty, and the pursuit of happiness\"), the rule of law, justice, equality under the law)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104303F","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"3. Identify and describe the significance of American symbols, landmarks, and essential documents (e.g., Declaration of Independence; United States Constitution; Bill of Rights; Federalist Papers; Washington, DC; Liberty Bell; Gettysburg Address; Statute of Liberty; government to government accords; Treaty of Guadalupe Hildago; Gadsden Purchase)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043040","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"4. Compare and contrast the basic government sovereignty of local, state, tribal, and national governments."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043041","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"1. Describe the concept of democracy as developed by the Greeks, and compare the evolution of democracies throughout the world."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043042","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"2. Describe the concept of republic as developed by the Romans and compare to other republican governments."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043043","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"1. Explain the structure and functions of New Mexico's state government as expressed in the New Mexico Constitution, to include:<ul> <li>roles and methods of initiative, referendum, and recall processes</li> <li>function of multiple executive offices</li> <li>election process (e.g., primaries and general elections)</li> <li>criminal justice system (e.g., juvenile justice).</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043044","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"2. Explain the roles and relationships of different levels of the legislative process, to include:<ul> <li>structure of New Mexico legislative districts (e.g., number of districts, students' legislative district, representatives and senators of the students' district).</li> <li>the structure of the New Mexico Legislature and leaders of the Legislature during the current session (e.g., bicameral, House of Representatives and Senate, Speaker of the House of Representatives, Senate Pro Tem).</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043045","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"3. Compare the structure and functions of the New Mexico Legislature with that of the state's tribal governments (e.g., Pueblo Indian Council; Navajo, Apache, and Hopi nations)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043046","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"1. Explain the structure and functions of the national government as expressed in the United States Constitution, and explain the powers granted to the three branches of government and those reserved to the people, states, and tribes, to include:<ul> <li>the federal system dividing sovereignty between the states and the federal government, and their supporting bureaucracies</li> <li>the sovereignty of Native American tribes in relation to state and federal governments (and government to government relationships)</li> <li>Bill of Rights, amendments to Constitution</li> <li>the primacy of individual liberty</li> <li>Constitution is designed to secure our liberty by both empowering and limiting central government</li> <li>struggles over the creation of the Bill of Rights and its ratification</li> <li>separation of powers through the development of differing branches</li> <li>John Marshall's role in judicial review, including Marbury v. Madison.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043047","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"2. Identify and describe a citizen's fundamental constitutional rights, to include:<ul> <li>freedom of religion, expression, assembly, and press</li> <li>right to a fair trial</li> <li>equal protection and due process.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043048","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"3. Describe the contributions of Native Americans in providing a model that was utilized in forming the United States government (Iroquois Nation)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043049","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"4. Explain and describe how water rights and energy issues cross state and national boundaries."}]},{"leaf":false,"text":"9-12 Benchmark III-A: Compare and analyze the structure, power, and purpose of government at the local, state, tribal, and national levels as set forth in their respective constitutions or governance documents.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S104304A","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. Analyze the structure, powers, and role of the legislative branch of the United States government, to include:<ul> <li>specific powers delegated in Article I of the Constitution</li> <li>checks and balances described in The Federalist Papers Number 51</li> <li>lawmaking process</li> <li>role of leadership within Congress</li> <li>Federalist and anti-Federalists positions.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104304B","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. Analyze the structure, powers, and role of the executive branch of the United States government, to include:<ul> <li>specific powers delegated in Article II of the Constitution</li> <li>checks and balances</li> <li>development of the Cabinet and federal bureaucracy</li> <li>roles and duties of the presidency, including those acquired over time such as \"head of state\" and \"head of a political party.\"</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104304C","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. Examine the election of the president through the nomination process, national conventions, and Electoral College."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104304D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. Analyze the structure, powers, and role of the judicial branch of the United States government, including landmark United States Supreme Court decisions, to include:<ul> <li>specific powers delegated by the Constitution in Article III and described in the Federalist Papers Numbers 78- 83</li> <li>checks and balances</li> <li>judicial review as developed in Marbury v. Madison</li> <li>issues raised in McCulloch v. Maryland</li> <li>dual court system of state and federal governments, including their organization and jurisdiction.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104304E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"5. Analyze the rights, protections, limits, and freedoms included within the United States Constitution and Bill of Rights, to include:<ul> <li>constitutional mandates such as the right of habeas corpus, no bill of attainder, and the prohibition of the ex post facto laws</li> <li>1st Amendment guarantees freedom of religion, speech, press, assembly, and petition</li> <li>4th, 5th, and 6th Amendments address search and seizure, rights of the accused, right to a fair and speedy trial, and other legal protections</li> <li>14th Amendment protection of due process and equal protection under the law</li> <li>conflicts which occur between rights, including tensions between the right to a fair trial and freedom of the press and between majority rule and individual rights</li> <li>expansion of voting rights, limitation of presidential terms, etc.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104304F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"6. Compare and contrast the structure and powers of New Mexico's government as expressed in the New Mexico Constitution with that of the United States Constitution, to include:<ul> <li>direct democracy in the initiative, referendum, and recall process</li> <li>impeachment process</li> <li>process of voter registration and voting</li> <li>role of primary elections to nominate candidates</li> <li>how a bill becomes a law</li> <li>executive officers and their respective powers</li> <li>New Mexico courts, appointment of judges, and election and retainment processes for judges</li> <li>organization of county and municipal governments.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043050","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"7. Describe and analyze the powers and responsibilities of (including the concept of legitimate power) local, state, tribal, and national governments."}]},{"leaf":false,"text":"K-4 Benchmark III-B: Identify and describe the symbols, icons, songs, traditions, and leaders of local, state, tribal, and national levels that exemplify ideals and provide continuity and a sense of community across time.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043051","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"1. Recognize and name symbols and activities of the United States, New Mexico, and tribes, to include:<ul> <li>United States symbols to include the flag, bald eagle, monuments</li> <li>New Mexico symbols to include the flag, Smokey Bear, State Bird, chili</li> <li>tribal symbols and activities to include Feast Days, pottery, arts, storytelling.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043052","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"2. Recognize patriotic activities including \"The Pledge of Allegiance\", \"The Star Spangled Banner\", salute to the New Mexico flag, and New Mexico state songs."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043053","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"1. Identify the President of the United States and the Governor of New Mexico."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043054","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"2. Describe how local, state, tribal and national leaders exemplify the ideals of the communities they represent."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043055","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"1. Identify local governing officials and explain how their roles reflect their community."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043056","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"1. Explain how symbols, songs, icons, and traditions combine to reflect various cultures over time."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043057","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"1. Describe various cultures and the communities they represent, and explain how they have evolved over time."}]},{"leaf":false,"text":"5-8 Benchmark III-B: Explain the significance of symbols, icons, songs, traditions, and leaders of New Mexico and the United States that exemplify ideals and provide continuity and a sense of unity.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043058","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"1. Explain the significance and importance of American customs, symbols, landmarks, and celebrations."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043059","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"2. Identify and summarize contributions of various racial, ethnic, and religious groups to national identity."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104305A","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"3. Describe selected ethnic and religious customs and celebrations that enhance local, state, tribal, and national identities."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104305B","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"1. Describe the significance of leadership in democratic societies and provide examples of local, national, and international leadership, to include:<ul> <li>qualities of leadership</li> <li>names and contributions New Mexico leaders</li> <li>names and contributions of national leaders.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104305C","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"1. Explain the concept of diversity and its significance within the political and social unity of New Mexico."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104305D","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"2. Describe ways in which different groups maintain their cultural heritage."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104305E","dcterms_educationLevel":[{"prefLabel":"6"},{"prefLabel":"7"}],"text":"3. Explain how New Mexico's state legislature and other state legislatures identify symbols representative of a state."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104305F","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"4. Identify official and unofficial public symbols of various cultures and describe how they are or are not exemplary of enduring elements of those cultures."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043060","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"1. Explain how the development of symbols, songs, traditions, and concepts of leadership reflect American beliefs and principles."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043061","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"2. Explain the importance of point of view and its relationship to freedom of speech and press."}]},{"leaf":false,"text":"9-12 Benchmark III-B: Analyze how the symbols, icons, songs, traditions, and leaders of New Mexico and the United States exemplify ideals and provide continuity and a sense of unity.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043062","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. Analyze the qualities of effective leadership."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043063","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. Evaluate the impact of United States political, tribal, and social leaders on New Mexico and the nation."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043064","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. Analyze the contributions of symbols, songs, and traditions toward promoting a sense of unity at the state and national levels."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043065","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. Evaluate the role of New Mexico and United States symbols, icons, songs, and traditions in providing continuity over time."}]},{"leaf":false,"text":"K-4 Benchmark III-C: Become familiar with the basic purposes of government in New Mexico and the United States.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043066","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"1. Describe and provide examples of fairness."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043067","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"1. Describe different ways to determine a decision (e.g., majority rule, consensus, authoritarian [parent, teacher, principal])."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043068","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"1. Describe the concept of \"public good\" and identify local examples of systems that support the \"public good.\""},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043069","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"1. Describe how the majority protects the rights of the minority."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104306A","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"2. Explain how rules/laws are made and compare different processes used by local, state, tribal, and national governments to determine rules/laws."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104306B","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"1. Compare and contrast how the various governments have applied rules/laws, majority rule, \"public good,\" and protections of the minority in different periods of New Mexico's history."}]},{"leaf":false,"text":"5-8 Benchmark III-C: Compare political philosophies and concepts of government that became the foundation for the American Revolution and the United States government.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S104306C","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"1. Describe the narrative of the people and events associated with the development of the United States Constitution and describe its significance to the foundation of the American republic, to include:<ul> <li>colonists' and Native Americans' shared sense of individualism, independence, and religious freedom that developed before the Revolution</li> <li>Articles of Confederation</li> <li>purpose of the Constitutional Convention</li> <li>natural rights expressed in the Declaration of Independence</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104306D","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"2. Describe the contributions and roles of major individuals, including George Washington, James Madison, and Benjamin Franklin."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104306E","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"1. Explain how Greek and Roman societies expanded and advanced the role of citizen."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104306F","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"2. Identify historical origins of democratic forms of government (e.g., early civilizations, Native American governments)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043070","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"1. Compare and contrast New Mexico's entry into the United States with that of the original thirteen colonies."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043071","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"2. Understand the structure and function of New Mexico government as created by the New Mexico Constitution and how it supports local, tribal, and federal governments."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043072","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"1. Describe political philosophies and concepts of government that became the foundation for the American Revolution and the United States government, to include:<ul> <li>ideas of the nature of government and rights of the individuals expressed in the Declaration of Independence with its roots in English philosophers (e.g., John Locke)</li> <li>concept of limited government and the rule of law established in the Magna Carta and the English Bill of Rights</li> <li>social covenant established in the Mayflower Compact</li> <li>characteristics of representative governments</li> <li>anti-Federalist and Federalist arguments towards the new Constitution, including those expressed in The Federalist Papers</li> <li>concepts of federalism, democracy, bicameralism, separation of powers, and checks and balances.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043073","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"2. Explain the concept and practice of separation of powers among the Congress, the president, and the Supreme Court."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043074","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"3. Understand the fundamental principles of American constitutional democracy, including how the government derives its power from the people."}]},{"leaf":false,"text":"9-12 Benchmark III-C: Compare and contrast the philosophical foundations of the United States political system in terms of the purpose of government, including its historical sources and ideals, with those of other governments in the world.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043075","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. Analyze the structure, function, and powers of the federal government (e.g., legislative, executive, and judicial branches)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043076","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. Analyze and explain the philosophical foundations of the American political system in terms of the inalienable rights of people and the purpose of government, to include:<ul> <li>Iroquois League and its organizational structure for effective governance</li> <li>basic philosophical principles of John Locke expressed in the Second Treatise of Government (nature, equality, and dissolution of government)</li> <li>foundation principles of laws by William Blackstone (laws in general and absolute rights of individuals)</li> <li>importance of the founders of the Rights of Englishmen, the Magna Carta, and representative government in England.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043077","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. Analyze the fundamental principles in the Declaration of Independence."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043078","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. Analyze the historical sources and ideals of the structure of the United States government, to include:<ul> <li>principles of democracy</li> <li>essential principles of a republican form of government</li> <li>code of law put forth in the Code of Hammurabi</li> <li>separation of powers as expressed by the Baron of Montesquieu</li> <li>checks and balances as expressed by Thomas Hobbs</li> <li>ideas of individual rights developed in the English Bill of Rights</li> <li>role of philosophers in supporting changes in governments in the 18th and 19th centuries (e.g., Locke, Rousseau, Voltaire).</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043079","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"5. Compare and contrast the concepts of courts and justice from Henry II of England to the court system of today."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104307A","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"6. Compare and contrast the unitary, confederal, and federal systems."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104307B","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"7. Analyze the ways powers are distributed and shared in a parliamentary system."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104307C","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"8. Compare and contrast the different philosophies, structures, and institutions of democratic versus totalitarian systems of government."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104307D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"9. Analyze and evaluate the concept of limited government and the rule of law."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104307E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"10. Compare and contrast the characteristics of representative governments."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104307F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"11. Compare and contrast characteristics of Native American governments with early United States government."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043080","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"12. Compare and contrast the philosophical foundations of forms of government to understand the purpose of the corresponding political systems (e.g., socialism, capitalism, secular, theocratic, totalitarian)"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043081","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"13. Analyze the role that the United States has played as a constitutional republican government for nations around the world."}]},{"leaf":false,"text":"K-4 Benchmark III-D: Understand rights and responsibilities of \"good citizenship\" as members of a family, school and community.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043082","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"1. Describe what is meant by citizenship."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043083","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"2. Explain what is meant by \"good citizenship,\" to include:<ul> <li>taking turns and sharing</li> <li>taking responsibility for own actions, assignments, and personal belongings within the classroom and respecting the property of others</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043084","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"1. Identify examples of honesty, courage, fairness, loyalty, patriotism, and other character traits seen in American history."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043085","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"2. Explain and apply \"good citizenship\" traits within the school and community using the elements of fair play, good sportsmanship, the idea of treating others the way you want to be treated, and being trustworthy."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043086","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"1. Understand characteristics of \"good citizenship\" as exemplified by historic and ordinary people."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043087","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"2. Explain the responsibilities of being a member of various groups (e.g. family, school, community)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043088","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"1. Explain the significance of participation and cooperation in a classroom and community."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043089","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"2. Understands the impact of individual and group decisions on communities in a democratic society."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104308A","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"3. Explain the significance and process of voting."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104308B","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"1. Explain the difference between rights and responsibilities, why we have rules and laws, and the role of citizenship in promoting them."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104308C","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"2. Examine issues of human rights."}]},{"leaf":false,"text":"5-8 Benchmark III-D: Explain how individuals have rights and responsibilities as members of social groups, families, schools, communities, states, tribes, and countries.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S104308D","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"1. Explain the meaning of the American creed that calls on citizens to safeguard the liberty of individual Americans within a unified nation, to respect the rule of law, and to preserve the constitution of local, state, tribal and federal governments."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104308E","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"1. Understand that the nature of citizenship varies among societies."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S104308F","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"1. Explain the obligations and responsibilities of citizenship (e.g., the obligations of upholding the Constitution, obeying the law, paying taxes, jury duty)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043090","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"2. Explain the roles of citizens in political decision-making (e.g., voting, petitioning public officials, analyzing issues)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043091","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"1. Explain basic law-making processes and how the design of the United States Constitution provides numerous opportunities for citizens to participate in the political process and to monitor and influence government (e.g., elections, political parties, interest groups)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043092","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"2. Understand the multiplicity and complexity of human rights issues."}]},{"leaf":false,"text":"9-12 Benchmark III-D: Understand how to exercise rights and responsibilities as citizens by participating in civic life and using skills that include interacting, monitoring, and influencing.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043093","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. Describe and analyze the influence of the non-elected (e.g., staff, lobbyists, interest groups)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043094","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. Analyze the rights and obligations of citizens in the United States, to include:<ul> <li>connections between self-interest, the common good, and the essential element of civic virtue as described in The Federalist Papers Numbers 5 and 49</li> <li>obeying the law, serving on juries, paying taxes, voting, registering for selective service, and military service.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043095","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. Demonstrate the skills needed to participate in government at all levels, to include:<ul> <li>analyze public issues and the political system</li> <li>evaluate candidates and their positions</li> <li>debate current issues.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043096","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. Analyze factors that influence the formation of public opinion (e.g., media, print, advertising, news broadcasts, magazines, radio)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1043097","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"5. Evaluate standards, conflicts, and issues related to universal human rights and their impact on public policy."}]}]}]},{"leaf":false,"text":"Strand: Economics","children":[{"leaf":false,"text":"Content Standard IV: Students understand basic economic principles and use economic reasoning skills to analyze the impact of economic systems (including the market economy) on individuals, families, businesses, communities, and governments.","children":[{"leaf":false,"text":"K-4 Benchmark IV-A: Understand that individuals, households, businesses, governments, and societies make decisions that affect the distribution of resources and that these decisions are influenced by incentives (both economic and intrinsic).","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F33","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"1. Understand that basic human needs are met in many ways."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F34","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"1. Understand how resources are limited and varied in meeting human needs."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F35","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"2. Define and differentiate between needs and wants."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F36","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"1. Identify economic decisions made by individuals and households and explain how resources are distributed."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F37","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"1. Explain that people want more goods and services than is possible to produce."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F38","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"2. Define and categorize resources (e.g., human, financial, natural)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F39","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"3. Identify a variety of products that use similar resources."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F3A","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"1. Understand when choices are made that those choices impose \"opportunity costs.\""},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F3B","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"2. Describe different economic, public, and/or community incentives (wages, business profits, amenities rights for property owners and renters)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F3C","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"3. Illustrate how resources can be used in alternative ways and, sometimes, allocated to different users."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F3D","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"4. Explain why there may be unequal distribution of resources (e.g., among people, communities, states, nations)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F3E","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"5. Understand and explain how conflict may arise between private and public incentives (e.g., new parks, parking structures)."}]},{"leaf":false,"text":"5-8 Benchmark IV-A: Explain and describe how individuals, households, businesses, governments, and societies make decisions, are influenced by incentives (economic as well as intrinsic) and the availability and use of scarce resources, and that their choices involve costs and varying ways of allocating.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F29","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"1. Understand the impact of supply and demand on consumers and producers in a free enterprise system."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F2A","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"2. Understand the patterns of work and economic activities in New Mexico and the United States (e.g., farming, ranching, oil and gas production, high tech, manufacturing, medicine)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F2B","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"3. Describe the aspects of trade."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F2C","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"4. Explain how voluntary trade is not coercive."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F2D","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"1. Explain and predict how people respond to economic and intrinsic incentives."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F2E","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"1. Explain how economic and intrinsic incentives influence how individuals, households, businesses, governments, and societies allocate and use their scarce resources."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F2F","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"2. Explain why cooperation can yield higher benefits."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F30","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"1. Explain and provide examples of economic goals."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F31","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"2. Analyze the full costs and benefits of alternative uses of resources that will lead to productive use of resources today and in the future."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F32","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"3. Explain that tension between individuals, groups, and/or countries is often based upon differential access to resources."}]},{"leaf":false,"text":"9-12 Benchmark IV-A: Analyze the ways individuals, households, businesses, governments, and societies make decisions, are influenced by incentives (economic and intrinsic) and the availability and use of scarce resources and that their choices involve costs and varying ways of allocating.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F1C","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. Analyze \"opportunity costs\" as a factor resulting from the process of decision making."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F1D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. Understand how socioeconomic stratification (SES) arises and how it affects human motivation, using data."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F1E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. Understand the relationship between socioeconomic stratification and cultural values."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F1F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. Analyze and evaluate the impact of economic choices on the allocation of scarce resources."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F20","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"5. Describe and analyze how economic incentives allow individuals, households, businesses, governments, and societies to use scarce human, financial, and natural resources more efficiently to meet economic goals."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F21","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"6. Evaluate present and future economic costs and economic risks in the use of productive resources associated with investments."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F22","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"7. Understand labor markets and how they work."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F23","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"8. Describe and analyze the three major divisions of economics: macro-, micro-, and consumer."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F24","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"9. Understand the relationship between essential learning skills and workforce requirements (e.g., School to Work initiatives, Service Learning) as they relate to supply and demand in the labor market."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F25","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"10. Use quantitative data to analyze economic information."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F26","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"11. Analyze various investment strategies available when meeting personal and business goals."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F27","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"12. Understand the basis of supply and demand and marginal productivity."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F28","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"13. Understand personal financing (e.g., banking, credit, debit, lending institutions)."}]},{"leaf":false,"text":"K-4 Benchmark IV-B: Understand that economic systems impact the way individuals, households, businesses, governments, and societies make decisions about goods and services.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F10","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"1. Understand the concept of product (something produced by human, mechanical, or natural process)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F11","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"2. Understand the importance of jobs."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F12","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"1. Understand the concept of goods and services."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F13","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"2. Understand the condition of not being able to have all of the goods and services one wants."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F14","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"3. Understand the value of work."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F15","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"1. Understand the roles of producers and consumers in the production of goods and services."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F16","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"2. Explain the role of the worker in the local economy."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F17","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"1. Recognize that a market system exists whenever buyers and sellers exchange goods and services."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F18","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"2. Understand how businesses operate in the United States' free enterprise system."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F19","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"3. Identify examples of economic systems."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F1A","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"1. Understand how the characteristics and benefits of the free enterprise system in New Mexico compares to other economic systems in New Mexico (e.g., acequia systems)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F1B","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"2. Explain that government raises money by taxing and borrowing to pay for the goods and services it provides."}]},{"leaf":false,"text":"5-8 Benchmark IV-B: Explain how economic systems impact the way individuals, households, businesses, governments and societies make decisions about resources and the production and distribution of goods and services.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F03","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"1. Explain how all economic systems must consider the following: What will be produced? How will it be produced? For whom will it be produced?"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F04","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"2. Identify the influence of bordering countries (Canada and Mexico) on United States commerce."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F05","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"1. Describe the characteristics of traditional, command, market, and mixed economic systems."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F06","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"2. Explain how different economic systems affect the allocation of resources."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F07","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"3. Understand the role that \"factors of production\" play in a society's economy (e.g., natural resources, labor, capital, entrepreneurs)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F08","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"1. Identify governmental activities that affect local, state, tribal, and national economies."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F09","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"2. Analyze the impact of taxing and spending decisions upon individuals, organizations, businesses, and various government entities."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F0A","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"3. Explain the relationship of New Mexico with tribal governments regarding compact issues (e.g., taxes, gambling revenue, rights of way)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F0B","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"1. Describe the relationships among supply, demand, and price and their roles in the United States market system."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F0C","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"2. Identify how fundamental characteristics of the United States' economic system influence economic decision making (e.g., private property, profits, competition) at local, state, tribal, and national levels."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F0D","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"3. Explain changing economic activities in the United States and New Mexico and the role of technology in those changes."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F0E","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"4. Identify situations in which price and value diverge."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F0F","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"5. Describe the use of money over time (e.g., college funds beginning in elementary years, saving accounts, 401Ks)."}]},{"leaf":false,"text":"9-12 Benchmark IV-B: Analyze and evaluate how economic systems impact the way individuals, households, businesses, governments, and societies make decisions about resources and the production and distribution of goods and services.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042EF2","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. Analyze the historic origins of the economic systems of capitalism, socialism, and communism."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042EF3","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. Compare the relationships between and among contemporary countries with differing economic systems."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042EF4","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. Understand the distribution and characteristics of economic systems throughout the world, to include:<ul> <li>characteristics of command, market and traditional economies</li> <li>how command, market, and traditional economies operate in specific countries</li> <li>comparison of the ways that people satisfy their basic needs through the production of goods and services.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042EF5","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. Analyze the importance of, and issues related to, the location and management of the factors of production."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042EF6","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"5. Describe how changes in technology, transportation, and communication affect the location and patterns of economic activities in New Mexico and the United States."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042EF7","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"6. Analyze the roles played by local, state, tribal, and national governments in both public and private sectors of the United States system."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042EF8","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"7. Understand the relationship between United States governmental policies and international trade."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042EF9","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"8. Evaluate economic systems by their ability to achieve broad societal goals (e.g., efficiency, equity, security, employment, stability, economic growth)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042EFA","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"9. Explain how businesses (e.g., sole proprietorships, partnerships, corporations, franchises) are organized and financed in the United States economy."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042EFB","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"10. Interpret measurements of inflation and unemployment and relate them to the general economic \"health\" of the national economy."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042EFC","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"11. Analyze the impact of fiscal policy on an economic system (e.g., deficit, surplus, inflation)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042EFD","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"12. Compare and contrast different types of taxes (e.g., progressive, regressive, proportional)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042EFE","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"13. Analyze the effects of specific government regulations on different economically designated groups (e.g., consumers, employees, businesses)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042EFF","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"14. Compare, analyze, and evaluate the positive and negative aspects of American capitalism in relationship to other economic systems."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F00","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"15. Describe and evaluate how the United States economy moved from manufacturing-based to information driven."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F01","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"16. Analyze the reasons for uneven economic growth-based changes (e.g., demographic, political, economic)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042F02","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"17. Analyze the economic ramifications of entrepreneurship."}]},{"leaf":false,"text":"K-4 Benchmark IV-C: Understand the patterns and results of trade and exchange among individuals, households, businesses, governments, and societies, and their interdependent qualities.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042EE8","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"1. Describe trade (e.g., buying and selling, bartering, simple exchange)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042EE9","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"1. Define the simplest form of exchange (the barter system being the direct trading of goods and services between people)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042EEA","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"1. Understand that money is the generally accepted medium of exchange in most societies, and that different countries use different currencies."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042EEB","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"1. Understand the purposes of spending and saving money."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042EEC","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"2. Identify currency, credit, debit, and checks as the basic mediums of exchange in Western society."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042EED","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"1. Identify patterns of work and economic activity in New Mexico and their sustainability over time (e.g., farming, ranching, mining, retail, transportation, manufacturing, tourism, high tech)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042EEE","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"2. Explain how New Mexico, the United States, and other parts of the world are economically interdependent."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042EEF","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"3. Explain that banks handle currency and other forms of money and serve as intermediaries between savers and borrowers."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042EF0","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"4. Explain that money can be used to express the \"market value\" of goods and services in the form of prices."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042EF1","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"5. Use data to explain an economic pattern."}]},{"leaf":false,"text":"5-8 Benchmark IV-C: Describe the patterns of trade and exchange in early societies and civilizations and explore the extent of their continuation in today's world.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042ED8","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"1. Understand basic economic patterns of early societies (e.g., hunter-gathers, early farming, business)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042ED9","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"2. Understand the economic motivation of exploration and colonization by colonial powers."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042EDA","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"1. Compare and contrast the trade patterns of early civilizations."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042EDB","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"2. Analyze the impact of the Neolithic agricultural revolution on mankind and the impact of technological changes in the Bronze Age and the Iron Age."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042EDC","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"1. Explain how specialization leads to interdependence and describe ways most Americans depend on people in other households, communities, and nations for some of the goods they consume."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042EDD","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"2. Understand the interdependencies between the economies of New Mexico, the United States, and the world."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042EDE","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"3. Understand the factors that currently limit New Mexico from becoming an urban state, including the availability and allocation of water, and the extent to which New Mexico relies upon traditional economic forms (e.g., the acequia systems, localized agricultural markets)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042EDF","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"4. Describe the relationship between New Mexico, tribal, and United States economic systems."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042EE0","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"5. Compare and contrast New Mexico commerce with that of other states' commerce."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042EE1","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"1. Understand why various sections of the early United States developed different patterns of economic activity and explore why and to what extent those differences remain today."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042EE2","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"2. Understand how various economic forces resulted in the Industrial Revolution in the 19th century."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042EE3","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"3. Explain how economic interdependence between countries around the world can improve the standard of living."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042EE4","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"4. Explain the rise of the credit system and how the use of credit involves the use of someone else's money at a certain interest rate, and explore the social impact of credit, pro and con."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042EE5","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"5. Explain the exchange rate as the price of a nation's currency."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042EE6","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"6. Describe the role of technology in economic development, historically and in the contemporary world."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042EE7","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"7. Describe how \"cost benefits\" are determined by individuals, groups, societies, and nations in capitalist systems."}]},{"leaf":false,"text":"9-12 Benchmark IV-C: Analyze and evaluate the patterns and results of trade, exchange, and interdependence between the United States and the world since 1900.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042ECC","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"1. Analyze foreign and domestic issues related to United States economic growth since 1900."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042ECD","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"2. Analyze significant economic developments between World War I and World War II, to include:<ul> <li>economic growth and prosperity of the 1920s</li> <li>causes of the Great Depression and the effects on United States economy and government</li> <li>New Deal measures enacted to counter the Great Depression</li> <li>expansion of government under New Deal.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042ECE","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"3. Analyze the effects of World War II, the Cold War, and post-Cold War on contemporary society, to include:<ul> <li>economic effects of WWII on the home front</li> <li>United States prosperity of the 1950s</li> <li>impact of the Cold War on business cycle and defense spending</li> <li>recession of 1980s</li> <li>technology boom and consequent economic slow down of 2000.</li></ul>"},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042ECF","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"4. Describe the relationship between United States' international trade policies and its economic system."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042ED0","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"5. Identify and analyze the international differences in resources, productivity, and prices that are a basis for international trade."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042ED1","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"6. Explain the comparative advantage of a nation when it can produce a product at a lower \"opportunity cost\" than its trading partner."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042ED2","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"7. Evaluate the effect on international trade of domestic policies that either encourage or discourage exchange of goods and services and investments abroad."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042ED3","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"8. Analyze and evaluate how domestic policies can affect the balance of trade between nations."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042ED4","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"9. Explain and describe how the Federal Reserve System and monetary policies (e.g., open market, discount rate, change in reserve requirements) are used to promote price stability, maximum employment, and economic growth."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042ED5","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"10. Identify how monetary policies can affect exchange rates and international trade."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042ED6","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"11. Analyze and evaluate the use of technology on economic development."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1042ED7","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"12. Describe and analyze multinational entities (e.g., NAFTA, European Union) in economic and social terms."}]}]}]}]