[{"leaf":false,"text":"Physical Sciences","children":[{"leaf":false,"text":"1.  Properties of materials can be observed, measured, and predicted.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1009A93","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"a.  Students know objects can be described in terms of the materials they are made of (e.g., clay, cloth, paper) and their physical properties (e.g., color, size, shape, weight, texture, flexibility, attraction to magnets, floating, sinking)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1018282","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"b.  Students know water can be a liquid or a solid and can be made to change back and forth from one form to the other."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1025BDC","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"c.  Students know water left in an open container evaporates (goes into the air) but water in a closed container does not."}]},{"leaf":false,"text":"1.  Materials come in different forms (states), including solids, liquids, and gases.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S100B3FE","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"a.  Students know solids, liquids, and gases have different properties."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1002546","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"b.  Students know the properties of substances can change when the substances are mixed, cooled, or heated."}]},{"leaf":false,"text":"1.  The motion of objects can be observed and measured.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1000132","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"a.  Students know the position of an object can be described by locating it in relation to another object or to the background."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10129A6","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"b.  Students know an object's motion can be described by recording the change in position of the object over time."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1022634","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"c.  Students know the way to change how something is moving is by giving it a push or a pull.  The size of the change is related to the strength, or the amount of force, of the push or pull."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101FC3F","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"d.  Students know tools and machines are used to apply pushes and pulls (forces) to make things move."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10151B3","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"e.  Students know objects fall to the ground unless something holds them up."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10055B6","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"f.  Students know magnets can be used to make some objects move without being touched."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S102520E","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"g.  Students know sound is made by vibrating objects and can be described by its pitch and volume."}]},{"leaf":false,"text":"1.  Energy and matter have multiple forms and can be changed from one form to another.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S101BC76","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"a.  Students know energy comes from the Sun to Earth in the form of light."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100FBB8","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"b.  Students know sources of stored energy take many forms, such as food, fuel, and batteries."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100F68E","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"c.  Students know machines and living things convert stored energy to motion and heat."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100F4B5","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"d.  Students know energy can be carried from one place to another by waves, such as water waves and sound waves, by electric current, and by moving objects."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1006D1C","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"e.  Students know matter has three forms:  solid, liquid, and gas."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1017ECB","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"f.  Students know evaporation and melting are changes that occur when objects are heated."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101538C","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"g.  Students know that when two or more substances are combined, a new substance may be formed with properties that are different from those of the original materials."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100DE18","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"h.  Students know all matter is made of small particles called atoms, too small to see with the naked eye."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1021014","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"i.  Students know people once thought that earth, wind, fire, and water were the basic elements that made up all matter.  Science experiments show that there are more than 100 different types of atoms, which are presented on the periodic table of the elements."}]},{"leaf":false,"text":"2.  Light has a source and travels in a direction.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S101CEB4","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"a.  Students know sunlight can be blocked to create shadows."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100AFF8","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"b.  Students know light is reflected from mirrors and other surfaces."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101EB98","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"c.  Students know the color of light striking an object affects the way the object is seen."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1000DF3","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"d.  Students know an object is seen when light traveling from the object enters the eye."}]},{"leaf":false,"text":"1.  Electricity and magnetism are related effects that have many useful applications in everyday life.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1008F01","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"a.  Students know how to design and build simple series and parallel circuits by using components such as wires, batteries, and bulbs."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10020E2","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"b.  Students know how to build a simple compass and use it to detect magnetic effects, including Earth's magnetic field."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1020EC6","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"c.  Students know electric currents produce magnetic fields and know how to build a simple electromagnet."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101C6A8","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"d.  Students know the role of electromagnets in the construction of electric motors, electric generators, and simple devices, such as doorbells and earphones."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10183B9","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"e.  Students know electrically charged objects attract or repel each other."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1004FFD","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"f.  Students know that magnets have two poles (north and south) and that like poles repel each other while unlike poles attract each other."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1009D84","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"g.  Students know electrical energy can be converted to heat, light, and motion."}]},{"leaf":false,"text":"1.  Elements and their combinations account for all the varied types of matter in the world.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S101068B","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"a.  Students know that during chemical reactions the atoms in the reactants rearrange to form products with different properties."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1013DFC","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"b.  Students know all matter is made of atoms, which may combine to form molecules."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10202E1","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"c.  Students know metals have properties in common, such as high electrical and thermal conductivity.  Some metals, such as aluminum (Al), iron (Fe), nickel (Ni), copper (Cu), silver (Ag), and gold (Au), are pure elements; others, such as steel and brass, are composed of a combination of elemental metals."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10268CC","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"d.  Students know that each element is made of one kind of atom and that the elements are organized in the periodic table by their chemical properties."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100B866","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"e.  Students know scientists have developed instruments that can create discrete images of atoms and molecules that show that the atoms and molecules often occur in well-ordered arrays."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100A591","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"f.  Students know differences in chemical and physical properties of substances are used to separate mixtures and identify compounds."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1018325","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"g.  Students know properties of solid, liquid, and gaseous substances, such as sugar(C<sub>6</sub>H<sub>12</sub>O<sub>6</sub>), water (H<sub>2</sub>O), helium (He), oxygen (O<sub>2</sub>), nitrogen (N<sub>2</sub>), and carbon dioxide (CO<sub>2</sub>)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10075CE","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"h.  Students know living organisms and most materials are composed of just a few elements."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101F351","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"i.  Students know the common properties of salts, such as sodium chloride (NaCl)."}]}]},{"leaf":false,"text":"Life Sciences","children":[{"leaf":false,"text":"2.  Different types of plants and animals inhabit the earth.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S101B0C5","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"a.  Students know how to observe and describe similarities and differences in the appearance and behavior of plants and animals (e.g., seed-bearing plants, birds, fish, insects)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1017DEC","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"b.  Students know stories sometimes give plants and animals attributes they do not really have."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10030BA","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"c.  Students know how to identify major structures of common plants and animals (e.g., stems, leaves, roots, arms, wings, legs)."}]},{"leaf":false,"text":"2.  Plants and animals meet their needs in different ways.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1005EF6","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"a.  Students know different plants and animals inhabit different kinds of environments and have external features that help them thrive in different kinds of places."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1016146","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"b.  Students know both plants and animals need water, animals need food, and plants need light."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1018910","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"c.  Students know animals eat plants or other animals for food and may also use plants or even other animals for shelter and nesting."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1012E4C","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"d.  Students know how to infer what animals eat from the shapes of their teeth (e.g., sharp teeth:  eats meat; flat teeth:  eats plants)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100CF0C","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"e.  Students know roots are associated with the intake of water and soil nutrients and green leaves are associated with making food from sunlight."}]},{"leaf":false,"text":"2.  Plants and animals have predictable life cycles.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10205AB","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"a.  Students know that organisms reproduce offspring of their own kind and that the offspring resemble their parents and one another."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1001F5B","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"b.  Students know the sequential stages of life cycles are different for different animals, such as butterflies, frogs, and mice."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1005D12","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"c.  Students know many characteristics of an organism are inherited from the parents.  Some characteristics are caused or influenced by the environment."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10172A8","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"d.  Students know there is variation among individuals of one kind within a population."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10145F2","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"e.  Students know light, gravity, touch, or environmental stress can affect the germination, growth, and development of plants."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100B4B2","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"f.  Students know flowers and fruits are associated with reproduction in plants."}]},{"leaf":false,"text":"3.  Adaptations in physical structure or behavior may improve an organism's chance for survival.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1001CFD","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"a.  Students know plants and animals have structures that serve different functions in growth, survival, and reproduction."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100A2C6","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"b.  Students know examples of diverse life forms in different environments, such as oceans, deserts, tundra, forests, grasslands, and wetlands."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1004295","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"c.  Students know living things cause changes in the environment in which they live:  some of these changes are detrimental to the organism or other organisms, and some are beneficial."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S102326E","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"d.  Students know when the environment changes, some plants and animals survive and reproduce; others die or move to new locations."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1010F5A","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"e.  Students know that some kinds of organisms that once lived on Earth have completely disappeared and that some of those resembled others that are alive today."}]},{"leaf":false,"text":"2.  All organisms need energy and matter to live and grow.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1023459","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"a.  Students know plants are the primary source of matter and energy entering most food chains."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10152F1","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"b.  Students know producers and consumers (herbivores, carnivores, omnivores, and decomposers) are related in food chains and food webs and may compete with each other for resources in an ecosystem."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101E95D","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"c.  Students know decomposers, including many fungi, insects, and microorganisms, recycle matter from dead plants and animals."}]},{"leaf":false,"text":"3.  Living organisms depend on one another and on their environment for survival.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S100F30D","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"a.  Students know ecosystems can be characterized by their living and nonliving components."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10141FB","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"b.  Students know that in any particular environment, some kinds of plants and animals survive well, some survive less well, and some cannot survive at all."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100160B","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"c.  Students know many plants depend on animals for pollination and seed dispersal, and animals depend on plants for food and shelter."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1001AB3","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"d.  Students know that most microorganisms do not cause disease and that many are beneficial."}]},{"leaf":false,"text":"2.  Plants and animals have structures for respiration, digestion, waste disposal, and transport of materials.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10109A1","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"a.  Students know many multicellular organisms have specialized structures to support the transport of materials."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1024515","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"b.  Students know how blood circulates through the heart chambers, lungs, and body and how carbon dioxide (CO<sub>2</sub>) and oxygen (O<sub>2</sub>) are exchanged in the lungs and tissues."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1005060","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"c.  Students know the sequential steps of digestion and the roles of teeth and the mouth, esophagus, stomach, small intestine, large intestine, and colon in the function of the digestive system."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100C41F","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"d.  Students know the role of the kidney in removing cellular waste from blood and converting it into urine, which is stored in the bladder."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101F2A6","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"e.  Students know how sugar, water, and minerals are transported in a vascular plant."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10049BF","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"f.  Students know plants use carbon dioxide (CO<sub>2</sub>) and energy from sunlight to build molecules of sugar and release oxygen."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1008017","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"g.  Students know plant and animal cells break down sugar to obtain energy, a process resulting in carbon dioxide (CO<sub>2</sub>) and water (respiration)."}]}]},{"leaf":false,"text":"Earth Sciences","children":[{"leaf":false,"text":"3.  Earth is composed of land, air, and water.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10245F5","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"a.  Students know characteristics of mountains, rivers, oceans, valleys, deserts, and local landforms."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1006B62","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"b.  Students know changes in weather occur from day to day and across seasons, affecting Earth and its inhabitants."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10212AA","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"c.  Students know how to identify resources from Earth that are used in everyday life and understand that many resources can be conserved."}]},{"leaf":false,"text":"3.  Weather can be observed, measured, and described.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S100D0D9","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"a.  Students know how to use simple tools (e.g., thermometer, wind vane) to measure weather conditions and record changes from day to day across the seasons."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1000DB4","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"b.  Students know that the weather changes from day to day but that trends in temperature or of rain (or snow) tend to be predictable during a season."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101B8E1","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"c.  Students know the sun warms the land, air, and water."}]},{"leaf":false,"text":"3.  Earth is made of materials that have distinct properties and provide resources for human activities.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1016611","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"a.  Students know how to compare the physical properties of different kinds of rocks and know that rock is composed of different combinations of materials."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101C63F","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"b.  Students know smaller rocks come from the breakage and weathering of larger rocks."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1020169","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"c.  Students know that soil is made partly from weathered rock and partly from organic materials and that soils differ in their color, texture, capacity to retain water, and ability to support the growth of many kinds of plants."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101F824","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"d.  Students know that fossils provide evidence about the plants and animals that lived long ago and that scientists learn about the past history of Earth by studying fossils."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100F1B7","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"e.  Students know rock, water, plants, and soil provide many resources, including food, fuel, and building materials, that humans use."}]},{"leaf":false,"text":"4.  Objects in the sky move in regular and predictable patterns.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S101053F","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"a.  Students know the patterns of stars stay the same, although they appear to move across the sky nightly, and different stars can be seen in different seasons."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1014C39","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"b.  Students know the way in which the Moon's appearance changes during the four-week lunar cycle."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1004D1E","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"c.  Students know telescopes magnify the appearance of some distant objects in the sky, including the Moon and the planets.  The number of stars that can be seen through telescopes is dramatically greater than the number that can be seen by the unaided eye."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1005D54","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"d.  Students know that Earth is one of several planets that orbit the Sun and that the Moon orbits Earth."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1017824","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"e.  Students know the position of the Sun in the sky changes during the course of the day and from season to season."}]},{"leaf":false,"text":"4.  The properties of rocks and minerals reflect the processes that formed them.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S101A9CF","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"a.  Students know how to differentiate among igneous, sedimentary, and metamorphic rocks by referring to their properties and methods of formation (the rock cycle)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101DA8C","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"b.  Students know how to identify common rock-forming minerals (including quartz, calcite, feldspar, mica, and hornblende) and ore minerals by using a table of diagnostic properties."}]},{"leaf":false,"text":"5.  Waves, wind, water, and ice shape and reshape Earth's land surface.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S101DC25","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"a.  Students know some changes in the earth are due to slow processes, such as erosion, and some changes are due to rapid processes, such as landslides, volcanic eruptions, and earthquakes."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100D40A","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"b.  Students know natural processes, including freezing and thawing and the growth of roots, cause rocks to break down into smaller pieces."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1024A85","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"c.  Students know moving water erodes landforms, reshaping the land by taking it away from some places and depositing it as pebbles, sand, silt, and mud in other places (weathering, transport, and deposition)."}]},{"leaf":false,"text":"3.  Water on Earth moves between the oceans and land through the processes of evaporation and condensation.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S101193A","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"a.  Students know most of Earth's water is present as salt water in the oceans, which cover most of Earth's surface."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101673F","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"b.  Students know when liquid water evaporates, it turns into water vapor in the air and can reappear as a liquid when cooled or as a solid if cooled below the freezing point of water."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101E10B","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"c.  Students know water vapor in the air moves from one place to another and can form fog or clouds, which are tiny droplets of water or ice, and can fall to Earth as rain, hail, sleet, or snow."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100D426","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"d.  Students know that the amount of fresh water located in rivers, lakes, underground sources, and glaciers is limited and that its availability can be extended by recycling and decreasing the use of water."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1006F95","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"e.  Students know the origin of the water used by their local communities."}]},{"leaf":false,"text":"4.  Energy from the Sun heats Earth unevenly, causing air movements that result in changing weather patterns.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S100B1D4","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"a.  Students know uneven heating of Earth causes air movements (convection currents)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1002F7D","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"b.  Students know the influence that the ocean has on the weather and the role that the water cycle plays in weather patterns."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101FA40","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"c.  Students know the causes and effects of different types of severe weather."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1015913","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"d.  Students know how to use weather maps and data to predict local weather and know that weather forecasts depend on many variables."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S102611F","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"e.  Students know that the Earth's atmosphere exerts a pressure that decreases with distance above Earth's surface and that at any point it exerts this pressure equally in all directions."}]},{"leaf":false,"text":"5.  The solar system consists of planets and other bodies that orbit the Sun in predictable paths.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1004C43","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"a.  Students know the Sun, an average star, is the central and largest body in the solar system and is composed primarily of hydrogen and helium."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1017A87","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"b.  Students know the solar system includes the planet Earth, the Moon, the Sun, eight other planets and their satellites, and smaller objects, such as asteroids and comets."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101D7BE","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"c.  Students know the path of a planet around the Sun is due to the gravitational attraction between the Sun and the planet."}]},{"leaf":false,"text":"Earth's Place in the Universe","children":[{"leaf":false,"text":"1.  Astronomy and planetary exploration reveal the solar system's structure, scale, and change over time.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S101C89F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"a.  Students know how the differences and similarities among the sun, the terrestrial planets, and the gas planets may have been established during the formation of the solar system."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1021499","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"b.  Students know the evidence from Earth and moon rocks indicates that the solar system was formed from a nebular cloud of dust and gas approximately 4.6 billion years ago."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1004B50","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"c.  Students know the evidence from geological studies of Earth and other planets suggest that the early Earth was very different from Earth today."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10062AD","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"d.  Students know the evidence indicating that the planets are much closer to Earth than the stars are."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1026C41","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"e.  Students know the Sun is a typical star and is powered by nuclear reactions, primarily the fusion of hydrogen to form helium."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1023C4F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"f.  Students know the evidence for the dramatic effects that asteroid impacts have had in shaping the surface of planets and their moons and in mass extinctions of life on Earth."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1000951","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"g.* Students know the evidence for the existence of planets orbiting other stars."}]},{"leaf":false,"text":"2.  Earth-based and space-based astronomy reveal the structure, scale, and changes in stars, galaxies, and the universe over time.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S101E994","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"a.  Students know the solar system is located in an outer edge of the disc-shaped Milky Way galaxy, which spans 100,000 light years."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1008E11","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"b.  Students know galaxies are made of billions of stars and comprise most of the visible mass of the universe."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101D328","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"c.  Students know the evidence indicating that all elements with an atomic number greater than that of lithium have been formed by nuclear fusion in stars."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1017715","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"d.  Students know that stars differ in their life cycles and that visual, radio, and X-ray telescopes may be used to collect data that reveal those differences."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101812A","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"e.* Students know accelerators boost subatomic particles to energy levels that simulate conditions in the stars and in the early history of the universe before stars formed."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10261FA","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"f.* Students know the evidence indicating that the color, brightness, and evolution of a star are determined by a balance between gravitational collapse and nuclear fusion."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101BD9B","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"g.* Students know how the red-shift from distant galaxies and the cosmic background radiation provide evidence for the \"big bang\" model that suggests that the universe has been expanding for 10 to 20 billion years."}]}]},{"leaf":false,"text":"Dynamic Earth Processes","children":[{"leaf":false,"text":"3.  Plate tectonics operating over geologic time has changed the patterns of land, sea, and mountains on Earth's surface.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S101CAF5","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"a.  Students know features of the ocean floor (magnetic patterns, age, and seafloor topography) provide evidence of plate tectonics."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1013F81","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"b.  Students know the principal structures that form at the three different kinds of plate boundaries."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100DC76","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"c.  Students know how to explain the properties of rocks based on the physical and chemical conditions in which they formed, including plate tectonic processes."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1002158","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"d.  Students know why and how earthquakes occur and the scales used to measure their intensity and magnitude."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1016D58","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"e.  Students know there are two kinds of volcanoes:  one kind with violent eruptions producing steep slopes and the other kind with voluminous lava flows producing gentle slopes."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1007CA9","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"f.* Students know the explanation for the location and properties of volcanoes that are due to hot spots and the explanation for those that are due to subduction."}]}]},{"leaf":false,"text":"Energy in the Earth System","children":[{"leaf":false,"text":"4.  Energy enters the Earth system primarily as solar radiation and eventually escapes as heat.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S100E14F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"d.* Students know the differing greenhouse conditions on Earth, Mars, and Venus; the origins of those conditions; and the climatic consequences of each."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101CF60","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"a.  Students know the relative amount of incoming solar energy compared with Earth's internal energy and the energy used by society."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1023BBE","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"b.  Students know the fate of incoming solar radiation in terms of reflection, absorption, and photosynthesis."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101065C","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"c.  Students know the different atmospheric gases that absorb the Earth's thermal radiation and the mechanism and significance of the greenhouse effect."}]},{"leaf":false,"text":"5.  Heating of Earth's surface and atmosphere by the sun drives convection within the atmosphere and oceans, producing winds and ocean currents.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S100525D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"a.  Students know how differential heating of Earth results in circulation patterns in the atmosphere and oceans that globally distribute the heat."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10205F6","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"b.  Students know the relationship between the rotation of Earth and the circular motions of ocean currents and air in pressure centers."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1011318","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"c.  Students know the origin and effects of temperature inversions."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1020E12","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"d.  Students know properties of ocean water, such as temperature and salinity, can be used to explain the layered structure of the oceans, the generation of horizontal and vertical ocean currents, and the geographic distribution of marine organisms."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100CB77","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"e.  Students know rain forests and deserts on Earth are distributed in bands at specific latitudes."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101AEE9","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"f.* Students know the interaction of wind patterns, ocean currents, and mountain ranges results in the global pattern of latitudinal bands of rain forests and deserts."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1014FFA","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"g.* Students know features of the ENSO (El Niño southern oscillation) cycle in terms of sea-surface and air temperature variations across the Pacific and some climatic results of this cycle."}]},{"leaf":false,"text":"6.  Climate is the long-term average of a region's weather and depends on many factors.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S101CCD7","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"a.  Students know weather (in the short run) and climate (in the long run) involve the transfer of energy into and out of the atmosphere."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100C665","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"b.  Students know the effects on climate of latitude, elevation, topography, and proximity to large bodies of water and cold or warm ocean currents."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1026541","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"c.  Students know how Earth's climate has changed over time, corresponding to changes in Earth's geography, atmospheric composition, and other factors, such as solar radiation and plate movement."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10172C9","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"d.* Students know how computer models are used to predict the effects of the increase in greenhouse gases on climate for the planet as a whole and for specific regions."}]}]},{"leaf":false,"text":"Biogeochemical Cycles","children":[{"leaf":false,"text":"7.  Each element on Earth moves among reservoirs, which exist in the solid earth, in oceans, in the atmosphere, and within and among organisms as part of biogeochemical cycles.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S101BAC1","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"a.  Students know the carbon cycle of photosynthesis and respiration and the nitrogen cycle."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1023C80","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"b.  Students know the global carbon cycle:  the different physical and chemical forms of carbon in the atmosphere, oceans, biomass, fossil fuels, and the movement of carbon among these reservoirs."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1023B4A","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"c.  Students know the movement of matter among reservoirs is driven by Earth's internal and external sources of energy."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1016673","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"d.* Students know the relative residence times and flow characteristics of carbon in and out of its different reservoirs."}]}]},{"leaf":false,"text":"Structure and Composition of the Atmosphere","children":[{"leaf":false,"text":"8.  Life has changed Earth's atmosphere, and changes in the atmosphere affect conditions for life.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S100C58A","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"a.  Students know the thermal structure and chemical composition of the atmosphere."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10043D4","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"b.  Students know how the composition of Earth's atmosphere has evolved over geologic time and know the effect of outgassing, the variations of carbon dioxide concentration, and the origin of atmospheric oxygen."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10030D8","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"c.  Students know the location of the ozone layer in the upper atmosphere, its role in absorbing ultraviolet radiation, and the way in which this layer varies both naturally and in response to human activities."}]}]},{"leaf":false,"text":"California Geology","children":[{"leaf":false,"text":"9.  The geology of California underlies the state's wealth of natural resources as well as its natural hazards.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1012B4C","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"a.  Students know the resources of major economic importance in California and their relation to California's geology."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1002410","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"b.  Students know the principal natural hazards in different California regions and the geologic basis of those hazards."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101A366","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"c.  Students know the importance of water to society, the origins of California's fresh water, and the relationship between supply and need."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100E20F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"d.* Students know how to analyze published geologic hazard maps of California and know how to use the map's information to identify evidence of geologic events of the past and predict geologic changes in the future."}]}]}]},{"leaf":false,"text":"Investigation and Experimentation","children":[{"leaf":false,"text":"4.  Scientific progress is made by asking meaningful questions and conducting careful investigations.  As a basis for understanding this concept and addressing the content in the other three strands, students should develop their own questions and perform investigations.  Students will:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1012190","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"a.  Observe common objects by using the five senses."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101E7A8","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"b.  Describe the properties of common objects."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101EA75","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"c.  Describe the relative position of objects by using one reference (e.g., above or below)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100E7A8","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"d.  Compare and sort common objects by one physical attribute (e.g., color, shape, texture, size, weight)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10188C2","dcterms_educationLevel":[{"prefLabel":"K"}],"text":"e.  Communicate observations orally and through drawings."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10178AC","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"a.  Draw pictures that portray some features of the thing being described."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1025A3A","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"b.  Record observations and data with pictures, numbers, or written statements."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100A466","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"c.  Record observations on a bar graph."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100C49F","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"d.  Describe the relative position of objects by using two references (e.g., above and next to, below and left of)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1019E02","dcterms_educationLevel":[{"prefLabel":"1"}],"text":"e.  Make new observations when discrepancies exist between two descriptions of the same object or phenomenon."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100B738","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"a.  Make predictions based on observed patterns and not random guessing."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10148FB","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"b.  Measure length, weight, temperature, and liquid volume with appropriate tools and express those measurements in standard metric system units."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1011330","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"c.  Compare and sort common objects according to two or more physical attributes (e.g., color, shape, texture, size, weight)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1017B98","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"d.  Write or draw descriptions of a sequence of steps, events, and observations."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1014CB5","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"e.  Construct bar graphs to record data, using appropriately labeled axes."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1005B4B","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"f.  Use magnifiers or microscopes to observe and draw descriptions of small objects or small features of objects."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1009FE4","dcterms_educationLevel":[{"prefLabel":"2"}],"text":"g.  Follow oral instructions for a scientific investigation."}]},{"leaf":false,"text":"5.  Scientific progress is made by asking meaningful questions and conducting careful investigations.  As a basis for understanding this concept and addressing the content in the other three strands, students should develop their own questions and perform investigations.","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S100ED4C","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"a.  Repeat observations to improve accuracy and know that the results of similar scientific investigations seldom turn out exactly the same because of differences in the things being investigated, methods being used, or uncertainty in the observation."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101F31F","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"b.  Differentiate evidence from opinion and know that scientists do not rely on claims or conclusions unless they are backed by observations that can be confirmed."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1021E0E","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"c.  Use numerical data in describing and comparing objects, events, and measurements."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1016EEB","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"d.  Predict the outcome of a simple investigation and compare the result with the prediction."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1021FFA","dcterms_educationLevel":[{"prefLabel":"3"}],"text":"e.  Collect data in an investigation and analyze those data to develop a logical conclusion."}]},{"leaf":false,"text":"6.  Scientific progress is made by asking meaningful questions and conducting careful investigations.  As a basis for understanding this concept and addressing the content in the other three strands, students should develop their own questions and perform investigations.  Students will:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10219A9","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"a.  Differentiate observation from inference (interpretation) and know scientists' explanations come partly from what they observe and partly from how they interpret their observations."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100837A","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"b.  Measure and estimate the weight, length, or volume of objects."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101E844","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"c.  Formulate and justify predictions based on cause-and-effect relationships."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10144A6","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"d.  Conduct multiple trials to test a prediction and draw conclusions about the relationships between predictions and results."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S102572A","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"e.  Construct and interpret graphs from measurements."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100A65E","dcterms_educationLevel":[{"prefLabel":"4"}],"text":"f.  Follow a set of written instructions for a scientific investigation."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1008B00","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"a.  Classify objects (e.g., rocks, plants, leaves) in accordance with appropriate criteria."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100FC2C","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"b.  Develop a testable question."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10170E6","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"c.  Plan and conduct a simple investigation based on a student-developed question and write instructions others can follow to carry out the procedure."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10105B3","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"d.  Identify the dependent and controlled variables in an investigation."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100ADB6","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"e.  Identify a single independent variable in a scientific investigation and explain how this variable can be used to collect information to answer a question about the results of the experiment."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101D362","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"f.  Select appropriate tools (e.g., thermometers, meter sticks, balances, and graduated cylinders) and make quantitative observations."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S102599D","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"g.  Record data by using appropriate graphic representations (including charts, graphs, and labeled diagrams) and make inferences based on those data."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1008298","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"h.  Draw conclusions from scientific evidence and indicate whether further information is needed to support a specific conclusion."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100DE6A","dcterms_educationLevel":[{"prefLabel":"5"}],"text":"i.  Write a report of an investigation that includes conducting tests, collecting data or examining evidence, and drawing conclusions."}]},{"leaf":false,"text":"7.  Scientific progress is made by asking meaningful questions and conducting careful investigations.  As a basis for understanding this concept and addressing the content in the other three strands, students should develop their own questions and perform investigations.  Students will:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S100341D","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"a.  Develop a hypothesis."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10171EF","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"b.  Select and use appropriate tools and technology (including calculators, computers, balances, spring scales, microscopes, and binoculars) to perform tests, collect data, and display data."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1026673","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"c.  Construct appropriate graphs from data and develop qualitative statements about the relationships between variables."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10014E7","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"d.  Communicate the steps and results from an investigation in written reports and oral presentations."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101EF46","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"e.  Recognize whether evidence is consistent with a proposed explanation."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101C5C3","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"f.  Read a topographic map and a geologic map for evidence provided on the maps and construct and interpret a simple scale map."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1026482","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"g.  Interpret events by sequence and time from natural phenomena (e.g., the relative ages of rocks and intrusions)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100769C","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"h.  Identify changes in natural phenomena over time without manipulating the phenomena (e.g., a tree limb, a grove of trees, a stream, a hillslope)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1015CF7","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"a.  Select and use appropriate tools and technology (including calculators, computers, balances, spring scales, microscopes, and binoculars) to perform tests, collect data, and display data."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1012A59","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"b.  Use a variety of print and electronic resources (including the World Wide Web) to collect information and evidence as part of a research project."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1004908","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"c.  Communicate the logical connection among hypotheses, science concepts, tests conducted, data collected, and conclusions drawn from the scientific evidence."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10077CF","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"d.  Construct scale models, maps, and appropriately labeled diagrams to communicate scientific knowledge (e.g., motion of Earth's plates and cell structure)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1005FC2","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"e.  Communicate the steps and results from an investigation in written reports and oral presentations."}]},{"leaf":false,"text":"9.  Scientific progress is made by asking meaningful questions and conducting careful investigations.  As a basis for understanding this concept and addressing the content in the other three strands, students should develop their own questions and perform investigations.  Students will:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10031B2","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"a.  Plan and conduct a scientific investigation to test a hypothesis."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1007DBA","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"b.  Evaluate the accuracy and reproducibility of data."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101C924","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"c.  Distinguish between variable and controlled parameters in a test."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1023A56","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"d.  Recognize the slope of the linear graph as the constant in the relationship <i>y</i> = <i>kx</i> and apply this principle in interpreting graphs constructed from data."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1006518","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"e.  Construct appropriate graphs from data and develop quantitative statements about the relationships between variables."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100C2C3","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"f.  Apply simple mathematic relationships to determine a missing quantity in a mathematic expression, given the two remaining terms (including speed = distance/time, density = mass/volume, force = pressure x area, volume = area x height)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101EE15","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"g.  Distinguish between linear and nonlinear relationships on a graph of data."}]},{"leaf":false,"text":"1.  Scientific progress is made by asking meaningful questions and conducting careful investigations.  As a basis for understanding this concept and addressing the content in the other four strands, students should develop their own questions and perform investigations.  Students will:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10209C8","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"a.  Select and use appropriate tools and technology (such as computer-linked probes, spreadsheets, and graphing calculators) to perform tests, collect data, analyze relationships, and display data."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101E9D3","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"b.  Identify and communicate sources of unavoidable experimental error."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10236BA","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"c.  Identify possible reasons for inconsistent results, such as sources of error or uncontrolled conditions."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100D408","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"d.  Formulate explanations by using logic and evidence."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100A1E7","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"e.  Solve scientific problems by using quadratic equations and simple trigonometric, exponential, and logarithmic functions."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10010DD","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"f.  Distinguish between hypothesis and theory as scientific terms."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101BE2A","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"g.  Recognize the usefulness and limitations of models and theories as scientific representations of reality."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101E9AA","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"h.  Read and interpret topographic and geologic maps."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1004CBA","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"i.  Analyze the locations, sequences, or time intervals that are characteristic of natural phenomena (e.g., relative ages of rocks, locations of planets over time, and succession of species in an ecosystem)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1021C5A","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"j.  Recognize the issues of statistical variability and the need for controlled tests."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10194E9","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"k.  Recognize the cumulative nature of scientific evidence."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10118E7","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"l.  Analyze situations and solve problems that require combining and applying concepts from more than one area of science."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1024EFB","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"m.  Investigate a science-based societal issue by researching the literature, analyzing data, and communicating the findings.  Examples of issues include irradiation of food, cloning of animals by somatic cell nuclear transfer, choice of energy sources, and land and water use decisions in California."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1000379","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"n.  Know that when an observation does not agree with an accepted scientific theory, the observation is sometimes mistaken or fraudulent (e.g., the Piltdown Man fossil or unidentified flying objects) and that the theory is sometimes wrong (e.g., the Ptolemaic model of the movement of the Sun, Moon, and planets)."}]}]},{"leaf":false,"text":"Focus on Earth Science","children":[{"leaf":false,"text":"Plate Tectonics and Earth's Structure","children":[{"leaf":false,"text":"1.  Plate tectonics accounts for important features of Earth's surface and major geologic events.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1016CEB","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"a.  Students know evidence of plate tectonics is derived from the fit of the continents; the location of earthquakes, volcanoes, and midocean ridges; and the distribution of fossils, rock types, and ancient climatic zones."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100F418","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"b.  Students know Earth is composed of several layers:  a cold, brittle lithosphere; a hot, convecting mantle; and a dense, metallic core."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1007D0D","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"c.  Students know lithospheric plates the size of continents and oceans move at rates of centimeters per year in response to movements in the mantle."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1024B0F","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"d.  Students know that earthquakes are sudden motions along breaks in the crust called faults and that volcanoes and fissures are locations where magma reaches the surface."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101A798","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"e.  Students know major geologic events, such as earthquakes, volcanic eruptions, and mountain building, result from plate motions."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10070EC","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"f.  Students know how to explain major features of California geology (including mountains, faults, volcanoes) in terms of plate tectonics."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1001EEF","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"g.  Students know how to determine the epicenter of an earthquake and know that the effects of an earthquake on any region vary, depending on the size of the earthquake, the distance of the region from the epicenter, the local geology, and the type of construction in the region."}]}]},{"leaf":false,"text":"Shaping Earth's Surface","children":[{"leaf":false,"text":"2.  Topography is reshaped by the weathering of rock and soil and by the transportation and deposition of sediment.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1010397","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"a.  Students know water running downhill is the dominant process in shaping the landscape, including California's landscape."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10204CD","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"b.  Students know rivers and streams are dynamic systems that erode, transport sediment, change course, and flood their banks in natural and recurring patterns."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1014EB4","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"c.  Students know beaches are dynamic systems in which the sand is supplied by rivers and moved along the coast by the action of waves."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10024C4","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"d.  Students know earthquakes, volcanic eruptions, landslides, and floods change human and wildlife habitats."}]}]},{"leaf":false,"text":"Heat (Thermal Energy)(Physical Science)","children":[{"leaf":false,"text":"3.  Heat moves in a predictable flow from warmer objects to cooler objects until all the objects are at the same temperature.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1002279","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"a.  Students know energy can be carried from one place to another by heat flow or by waves, including water, light and sound waves, or by moving objects."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1020701","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"b.  Students know that when fuel is consumed, most of the energy released becomes heat energy."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1022BF8","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"c.  Students know heat flows in solids by conduction (which involves no flow of matter and in fluids by conduction and by convection (which involves flow of matter)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1008CB8","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"d.  Students know heat energy is also transferred between objects by radiation (radiation can travel through space)."}]}]},{"leaf":false,"text":"Energy in the Earth System","children":[{"leaf":false,"text":"4.  Many phenomena on Earth's surface are affected by the transfer of energy through radiation and convection currents.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S101A55C","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"a.  Students know the sun is the major source of energy for phenomena on Earth's surface; it powers winds, ocean currents, and the water cycle."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1000F4A","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"b.  Students know solar energy reaches Earth through radiation, mostly in the form of visible light."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10157CF","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"c.  Students know heat from Earth's interior reaches the surface primarily through convection."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100F0CA","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"d.  Students know convection currents distribute heat in the atmosphere and oceans."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1004F14","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"e.  Students know differences in pressure, heat, air movement, and humidity result in changes of weather."}]}]},{"leaf":false,"text":"Ecology (Life Science)","children":[{"leaf":false,"text":"5.  Organisms in ecosystems exchange energy and nutrients among themselves and with the environment.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S101C8E4","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"a.  Students know energy entering ecosystems as sunlight is transferred by producers into chemical energy through photosynthesis and then from organism to organism through food webs."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10140C6","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"b.  Students  know matter is transferred over time from one organism to others in the food web and between organisms and the physical environment."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101AC99","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"c.  Students know populations of organisms can be categorized by the functions they serve in an ecosystem."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101F30C","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"d.  Students know different kinds of organisms may play similar ecological roles in similar biomes."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10042B6","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"e.  Students know the number and types of organisms an ecosystem can support depends on the resources available and on abiotic factors, such as quantities of light and water, a range of temperatures, and soil composition."}]}]},{"leaf":false,"text":"Resources","children":[{"leaf":false,"text":"6.  Sources of energy and materials differ in amounts, distribution, usefulness, and the time required for their formation.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S101613E","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"a.  Students know the utility of energy sources is determined by factors that are involved in converting these sources to useful forms and the consequences of the conversion process."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101EDD1","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"b.  Students know different natural energy and material resources, including air, soil, rocks, minerals, petroleum, fresh water, wildlife, and forests, and know how to classify them as renewable or nonrenewable."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1022D61","dcterms_educationLevel":[{"prefLabel":"6"}],"text":"c.  Students know the origin of the materials used to make common objects."}]}]}]},{"leaf":false,"text":"Focus on Life Science","children":[{"leaf":false,"text":"Cell Biology","children":[{"leaf":false,"text":"1.  All living organisms are composed of cells, from just one to many trillions, whose details usually are visible only through a microscope.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S100C104","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"a.  Students know cells function similarly in all living organisms."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1007CDB","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"b.  Students know the characteristics that distinguish plant cells from animal cells, including chloroplasts and cell walls."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101E53B","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"c.  Students know the nucleus is the repository for genetic information in plant and animal cells."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10267A9","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"d.  Students know that mitochondria liberate energy for the work that cells do and that chloroplasts capture sunlight energy for photosynthesis."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101638E","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"e.  Students know cells divide to increase their numbers through a process of mitosis, which results in two daughter cells with identical sets of chromosomes."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1004F58","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"f.  Students know that as multicellular organisms develop, their cells differentiate."}]}]},{"leaf":false,"text":"Genetics","children":[{"leaf":false,"text":"2.  A typical cell of any organism contains genetic instructions that specify its traits.  Those traits may be modified by environmental influences.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1017117","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"a.  Students know the differences between the life cycles and reproduction methods of sexual and asexual organisms."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1023027","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"b.  Students know sexual reproduction produces offspring that inherit half their genes from each parent."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1010EEF","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"c.  Students know an inherited trait can be determined by one or more genes."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101A640","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"d.  Students know plant and animal cells contain many thousands of different genes and typically have two copies of every gene.  The two copies (or alleles) of the gene may or may not be identical, and one may be dominant in determining the phenotype while the other is recessive."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100D5F5","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"e.  Students know DNA (deoxyribonucleic acid) is the genetic material of living organisms and is located in the chromosomes of each cell."}]}]},{"leaf":false,"text":"Evolution","children":[{"leaf":false,"text":"3.  Biological evolution accounts for the diversity of species developed through gradual processes over many generations.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S101818D","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"a.  Students know both genetic variation and environmental factors are causes of evolution and diversity of organisms."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1020C3A","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"b.  Students know the reasoning used by Charles Darwin in reaching his conclusion that natural selection is the mechanism of evolution."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1014178","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"c.  Students know how independent lines of evidence from geology, fossils, and comparative anatomy provide the bases for the theory of evolution."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101E8AE","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"d.  Students know how to construct a simple branching diagram to classify living groups of organisms by shared derived characteristics and how to expand the diagram to include fossil organisms."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101D191","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"e.  Students know that extinction of a species occurs when the environment changes and that the adaptive characteristics of a species are insufficient for its survival."}]}]},{"leaf":false,"text":"Earth and Life History (Earth Science)","children":[{"leaf":false,"text":"4.  Evidence from rocks allows us to understand the evolution of life on Earth.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10144E1","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"a.  Students know Earth processes today are similar to those that occurred in the past and slow geologic processes have large cumulative effects over long periods of time."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10103CB","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"b.  Students know the history of life on Earth has been disrupted by major catastrophic events, such as major volcanic eruptions or the impacts of asteroids."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10016B7","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"c.  Students know that the rock cycle includes the formation of new sediment and rocks and that rocks are often found in layers, with the oldest generally on the bottom."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101BE84","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"d.  Students know that evidence from geologic layers and radioactive dating indicates Earth is approximately 4.6 billion years old and that life on this planet has existed for more than 3 billion years."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101357C","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"e.  Students know fossils provide evidence of how life and environmental conditions have changed."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101A0A4","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"f.  Students know how movements of Earth's continental and oceanic plates through time, with associated changes in climate and geographic connections, have affected the past and present distribution of organisms."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S102256F","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"g.  Students know how to explain significant developments and extinctions of plant and animal life on the geologic time scale."}]}]},{"leaf":false,"text":"Structure and Function in Living Systems","children":[{"leaf":false,"text":"5.  The anatomy and physiology of plants and animals illustrate the complementary nature of structure and function.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10062F5","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"a.  Students know plants and animals have levels of organization for structure and function, including cells, tissues, organs, organ systems, and the whole organism."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100843D","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"b.  Students know organ systems function because of the contributions of individual organs, tissues, and cells.  The failure of any part can affect the entire system."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10039E5","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"c.  Students know how bones and muscles work together to provide a structural framework for movement."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10009C9","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"d.  Students know how the reproductive organs of the human female and male generate eggs and sperm and how sexual activity may lead to fertilization and pregnancy."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1018835","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"e.  Students know the function of the umbilicus and placenta during pregnancy."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1008CEC","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"f.  Students know the structures and processes by which flowering plants generate pollen, ovules, seeds, and fruit."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1013D94","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"g.  Students know how to relate the structures of the eye and ear to their functions."}]}]},{"leaf":false,"text":"Physical Principles in Living Systems (Physical Science)","children":[{"leaf":false,"text":"6.  Physical principles underlie biological structures and functions.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S100DBB6","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"a.  Students know visible light is a small band within a very broad electromagnetic spectrum."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1012D8C","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"b.  Students know that for an object to be seen, light emitted by or scattered from it must be detected by the eye."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1013125","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"c.  Students know light travels in straight lines if the medium it travels through does not change."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10045CD","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"d.  Students know how simple lenses are used in a magnifying glass, the eye, a camera, a telescope, and a microscope."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1009D44","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"e.  Students know that white light is a mixture of many wavelengths (colors) and that retinal cells react differently to different wavelengths."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100E2D5","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"f.  Students know light can be reflected, refracted, transmitted, and absorbed by matter."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10036A0","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"g.  Students know the angle of reflection of a light beam is equal to the angle of incidence."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10004B3","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"h.  Students know how to compare joints in the body (wrist, shoulder, thigh) with structures used in machines and simple devices (hinge, ball-and-socket, and sliding joints)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100942F","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"i.  Students know how levers confer mechanical advantage and how the application of this principle applies to the musculoskeletal system."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10041A4","dcterms_educationLevel":[{"prefLabel":"7"}],"text":"j.  Students know that contractions of the heart generate blood pressure and that heart valves prevent backflow of blood in the circulatory system."}]}]}]},{"leaf":false,"text":"Focus on Physical Science","children":[{"leaf":false,"text":"Motion","children":[{"leaf":false,"text":"1.  The velocity of an object is the rate of change of its position.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1002572","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"a.  Students know position is defined in relation to some choice of a standard reference point and a set of reference directions."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1015BDF","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"b.  Students know that average speed is the total distance traveled divided by the total time elapsed and that the speed of an object along the path traveled can vary."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1010C2B","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"c.  Students know how to solve problems involving distance, time, and average speed."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1002514","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"d.  Students know the velocity of an object must be described by specifying both the direction and the speed of the object."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101351A","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"e.  Students know changes in velocity may be due to changes in speed, direction, or both."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10195BD","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"f.  Students know how to interpret graphs of position versus time and graphs of speed versus time for motion in a single direction."}]}]},{"leaf":false,"text":"Forces","children":[{"leaf":false,"text":"2.  Unbalanced forces cause changes in velocity.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S101880A","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"a.  Students know a force has both direction and magnitude."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1010CF7","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"b.  Students know when an object is subject to two or more forces at once, the result is the cumulative effect of all the forces."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1012B42","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"c.  Students know when the forces on an object are balanced, the motion of the object does not change."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101D711","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"d.  Students know how to identify separately the two or more forces that are acting on a single static object, including gravity, elastic forces due to tension or compression in matter, and friction."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1015AF5","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"e.  Students know that when the forces on an object are unbalanced, the object will change its velocity (that is, it will speed up, slow down, or change direction)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1021B96","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"f.  Students know the greater the mass of an object, the more force is needed to achieve the same rate of change in motion."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100CC8D","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"g.  Students know the role of gravity in forming and maintaining the shapes of planets, stars, and the solar system."}]}]},{"leaf":false,"text":"Structure of Matter","children":[{"leaf":false,"text":"3.  Each of the more than 100 elements of matter has distinct properties and a distinct atomic structure.  All forms of matter are composed of one or more of the elements.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1014389","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"a.  Students know the structure of the atom and know it is composed of protons, neutrons, and electrons."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100A9EA","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"b.  Students know that compounds are formed by combining two or more different elements and that compounds have properties that are different from their constituent elements."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100A873","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"c.  Students know atoms and molecules form solids by building up repeating patterns, such as the crystal structure of NaCl or long-chain polymers."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1022F60","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"d.  Students know the states of matter (solid, liquid, gas) depend on molecular motion."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101D576","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"e.  Students know that in solids the atoms are closely locked in position and can only vibrate; in liquids the atoms and molecules are more loosely connected and can collide with and move past one another; and in gases the atoms and molecules are free to move independently, colliding frequently."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1015D10","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"f.  Students know how to use the periodic table to identify elements in simple compounds."}]}]},{"leaf":false,"text":"Earth in the Solar System (Earth Science)","children":[{"leaf":false,"text":"4.  The structure and composition of the universe can be learned from studying stars and galaxies and their evolution.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1025F36","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"a.  Students know galaxies are clusters of billions of stars and may have different shapes."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1014A85","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"b.  Students know that the Sun is one of many stars in the Milky Way galaxy and that stars may differ in size, temperature, and color."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1008B79","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"c.  Students know how to use astronomical units and light years as measures of distances between the Sun, stars, and Earth."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1020FFF","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"d.  Students know that stars are the source of light for all bright objects in outer space and that the Moon and planets shine by reflected sunlight, not by their own light."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100C1F0","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"e.  Students know the appearance, general composition, relative position and size, and motion of objects in the solar system, including planets, planetary satellites, comets, and asteroids."}]}]},{"leaf":false,"text":"Reactions","children":[{"leaf":false,"text":"5.  Chemical reactions are processes in which atoms are rearranged into different combinations of molecules.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S100061F","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"a.  Students know reactant atoms and molecules interact to form products with different chemical properties."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100CFD2","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"b.  Students know the idea of atoms explains the conservation of matter.  In chemical reactions the number of atoms stays the same no matter how they are arranged, so their total mass stays the same."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101297C","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"c.  Students know chemical reactions usually liberate heat or absorb heat."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100BCC2","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"d.  Students know physical processes include freezing and boiling, in which a material changes form with no chemical reaction."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100452A","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"e.  Students know how to determine whether a solution is acidic, basic, or neutral."}]}]},{"leaf":false,"text":"Chemistry of Living Systems (Life Science)","children":[{"leaf":false,"text":"6.  Principles of chemistry underlie the functioning of biological systems.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10153C8","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"a.  Students know that carbon, because of its ability to combine in many ways with itself and other elements, has a central role in the chemistry of living organisms."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101471D","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"b.  Students know that living organisms are made of molecules consisting largely of carbon, hydrogen, nitrogen, oxygen, phosphorus, and sulfur."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10176C5","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"c.  Students know that living organisms have many different kinds of molecules, including small ones, such as water and salt, and very large ones, such as carbohydrates, fats, proteins, and DNA."}]}]},{"leaf":false,"text":"Periodic Table","children":[{"leaf":false,"text":"7.  The organization of the periodic table is based on the properties of the elements and reflects the structure of atoms.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S100A539","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"a.  Students know how to identify regions corresponding to metals, nonmetals, and inert gases."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1020578","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"b.  Students know each element has a specific number of protons in the nucleus (the atomic number) and each isotope of the element has a different but specific number of neutrons in the nucleus."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1023D33","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"c.  Students know substances can be classified by their properties, including their melting temperature, density, hardness, and thermal and electrical conductivity."}]}]},{"leaf":false,"text":"Density and Buoyancy","children":[{"leaf":false,"text":"8.  All objects experience a buoyant force when immersed in a fluid.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1000A36","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"a.  Students know density is mass per unit volume."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100D3E5","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"b.  Students know how to calculate the density of substances (regular and irregular solids and liquids) from measurements of mass and volume."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1009F8B","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"c.  Students know the buoyant force on an object in a fluid is an upward force equal to the weight of the fluid the object has displaced."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1007C6C","dcterms_educationLevel":[{"prefLabel":"8"}],"text":"d.  Students know how to predict whether an object will float or sink."}]}]}]},{"leaf":false,"text":"Physics","children":[{"leaf":false,"text":"Motion and Forces","children":[{"leaf":false,"text":"1.  Newton's laws predict the motion of most objects.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1026174","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"a.  Students know how to solve problems that involve constant speed and average speed."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10095A7","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"b.  Students know that when forces are balanced, no acceleration occurs; thus an object continues to move at a constant speed or stays at rest (Newton's first law)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1025A36","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"c.  Students know how to apply the law <i>F = ma</i> to solve one-dimensional motion problems that involve constant forces (Newton's second law)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10267CD","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"d.  Students know that when one object exerts a force on a second object, the second object always exerts a force of equal magnitude and in the opposite direction (Newton's third law)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1015906","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"e.  Students know the relationship between the universal law of gravitation and the effect of gravity on an object at the surface of Earth."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1016141","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"f.  Students know applying a force to an object perpendicular to the direction of its motion causes the object to change direction but not speed (e.g., Earth's gravitational force causes a satellite in a circular orbit to change direction but not speed)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1003545","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"g.  Students know circular motion requires the application of a constant force directed toward the center of the circle."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100F1D5","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"h.* Students know Newton's laws are not exact but provide very good approximations unless an object is moving close to the speed of light or is small enough that quantum effects are important."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1016700","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"i.* Students know how to solve two-dimensional trajectory problems."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1012452","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"j.* Students know how to resolve two-dimensional vectors into their components and calculate the magnitude and direction of a vector from its components."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10195EE","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"k.* Students know how to solve two-dimensional problems involving balanced forces (statics)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100E136","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"l.* Students know how to solve problems in circular motion by using the formula for centripetal acceleration in the following form: a= v²/r."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101DA46","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"m.* Students know how to solve problems involving the forces between two electric charges at a distance (Coulomb's law) or the forces between two masses at a distance (universal gravitation)."}]}]},{"leaf":false,"text":"Conservation of Energy and Momentum","children":[{"leaf":false,"text":"2.  The laws of conservation of energy and momentum provide a way to predict and describe the movement of objects.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S100A260","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"a.  Students know how to calculate kinetic energy by using the formula <i>E</i> = (1/2)<i>mv</i>²."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10256AF","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"b.  Students know how to calculate changes in gravitational potential energy near Earth by using the formula (change in potential energy) = <i>mgh</i> (<i>h</i> is the change in the elevation)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10017D6","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"c.  Students know how to solve problems involving conservation of energy in simple systems, such as falling objects."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1022E05","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"d.  Students know how to calculate momentum as the product <i>mv</i>."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100E7A1","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"e.  Students know momentum is a separately conserved quantity different from energy."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1014032","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"f.  Students know an unbalanced force on an object produces a change in its momentum."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S102063B","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"g.  Students know how to solve problems involving elastic and inelastic collisions in one dimension by using the principles of conservation of momentum and energy."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100EA78","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"h.* Students know how to solve problems involving conservation of energy in simple systems with various sources of potential energy, such as capacitors and springs. 32"}]}]},{"leaf":false,"text":"Heat and Thermodynamics","children":[{"leaf":false,"text":"3.  Energy cannot be created or destroyed, although in many processes energy is transferred to the environment as heat.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10053AC","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"a.  Students know heat flow and work are two forms of energy transfer between systems."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101F868","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"b.  Students know that the work done by a heat engine that is working in a cycle is the difference between the heat flow into the engine at high temperature and the heat flow out at lower temperature (first law of thermodynamics) and that this is an example of the law of conservation of energy."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10175F9","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"c.  Students know the internal energy of an object includes the energy of random motion of the object's atoms and molecules, often referred to as <i>thermal energy</i>.  The greater the temperature of the object, the greater the energy of motion of the atoms and molecules that make up the object."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1018099","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"d.  Students know that most processes tend to decrease the order of a system over time and that energy levels are eventually distributed uniformly."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100FF8D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"e.  Students know that entropy is a quantity that measures the order or disorder of a system and that this quantity is larger for a more disordered system."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1010A26","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"f.* Students know the statement \"Entropy tends to increase\" is a law of statistical probability that governs all closed systems (second law of thermodynamics)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1013A32","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"g.* Students know how to solve problems involving heat flow, work, and efficiency in a heat engine and know that all real engines lose some heat to their surroundings."}]}]},{"leaf":false,"text":"Waves","children":[{"leaf":false,"text":"4.  Waves have characteristic properties that do not depend on the type of wave.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S100D85B","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"a.  Students know waves carry energy from one place to another."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1013BD7","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"b.  Students know how to identify transverse and longitudinal waves in mechanical media, such as springs and ropes, and on the earth (seismic waves)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100A7F6","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"c.  Students know how to solve problems involving wavelength, frequency, and wave speed."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1000D10","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"d.  Students know sound is a longitudinal wave whose speed depends on the properties of the medium in which it propagates."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S102663E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"e.  Students know radio waves, light, and X-rays are different wavelength bands in the spectrum of electromagnetic waves whose speed in a vacuum is approximately 3 x 10<sup>8</sup> m/s (186,000 miles/second)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1010C02","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"f.  Students know how to identify the characteristic properties of waves:  interference (beats), diffraction, refraction, Doppler effect, and polarization."}]}]},{"leaf":false,"text":"Electric and Magnetic Phenomena","children":[{"leaf":false,"text":"5.  Electric and magnetic phenomena are related and have many practical applications.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S101B99B","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"a.  Students know how to predict the voltage or current in simple direct current(DC) electric circuits constructed from batteries, wires, resistors, and capacitors."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10242C6","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"b.  Students know how to solve problems involving Ohm's law."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1017A9D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"c.  Students know any resistive element in a DC circuit dissipates energy, which heats the resistor.  Students can calculate the power (rate of energy dissipation) in any resistive circuit element by using the formula Power = <i>IR</i> (potential difference) x <i>I</i> (current) = <i>I²R</i>."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1018556","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"d.  Students know the properties of transistors and the role of transistors in electric circuits."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101FD35","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"e.  Students know charged particles are sources of electric fields and are subject to the forces of the electric fields from other charges."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1025467","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"f.  Students know magnetic materials and electric currents (moving electric charges) are sources of magnetic fields and are subject to forces arising from the magnetic fields of other sources."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10115DF","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"g.  Students know how to determine the direction of a magnetic field produced by a current flowing in a straight wire or in a coil."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100C65C","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"h.  Students know changing magnetic fields produce electric fields, thereby inducing currents in nearby conductors."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S102140E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"i.  Students know plasmas, the fourth state of matter, contain ions or free electrons or both and conduct electricity."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100F91C","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"j.* Students know electric and magnetic fields contain energy and act as vector force fields."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101AB3C","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"k.* Students know the force on a charged particle in an electric field is qE, where E is the electric field at the position of the particle and q is the charge of the particle."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1005765","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"l.* Students know how to calculate the electric field resulting from a point charge."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10239A2","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"m.* Students know static electric fields have as their source some arrangement of electric charges."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S102563D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"n.* Students know the magnitude of the force on a moving particle (with charge q) in a magnetic field is qvB sin(a), where a is the angle between v and B (v and B are the magnitudes of vectors v and B, respectively), and students use the right-hand rule to find the direction of this force."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100EAA1","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"o.* Students know how to apply the concepts of electrical and gravitational potential energy to solve problems involving conservation of energy."}]}]}]},{"leaf":false,"text":"Chemistry","children":[{"leaf":false,"text":"Atomic and Molecular Structure","children":[{"leaf":false,"text":"1.  The periodic table displays the elements in increasing atomic number and shows how periodicity of the physical and chemical properties of the elements relates to atomic structure.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S100527F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"a.  Students know how to relate the position of an element in the periodic table to its atomic number and atomic mass."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1019F37","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"b.  Students know how to use the periodic table to identify metals, semimetals, non-metals, and halogens."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10041D4","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"c.  Students know how to use the periodic table to identify alkali metals, alkaline earth metals and transition metals, trends in ionization energy, electronegativity, and the relative sizes of ions and atoms."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1025FAA","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"d.  Students know how to use the periodic table to determine the number of electrons available for bonding."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10256D3","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"e.  Students know the nucleus of the atom is much smaller than the atom yet contains most of its mass."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1026278","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"f.* Students know how to use the periodic table to identify the lanthanide, actinide, and transactinide elements and know that the transuranium elements were synthesized and identified in laboratory experiments through the use of nuclear accelerators."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1001C60","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"g.* Students know how to relate the position of an element in the periodic table to its quantum electron configuration and to its reactivity with other elements in the table."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101F27D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"h.* Students know the experimental basis for Thomson's discovery of the electron, Rutherford's nuclear atom, Millikan's oil drop experiment, and Einstein's explanation of the photoelectric effect."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10081C7","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"i.* Students know the experimental basis for the development of the quantum theory of atomic structure and the historical importance of the Bohr model of the atom."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10171E5","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"j.* Students know that spectral lines are the result of transitions of electrons between energy levels and that these lines correspond to photons with a frequency related hv). to the energy spacing between levels by using Planck's relationship (E=hv)."}]}]},{"leaf":false,"text":"Chemical Bonds","children":[{"leaf":false,"text":"2.  Biological, chemical, and physical properties of matter result from the ability of atoms to form bonds from electrostatic forces between electrons and protons and between atoms and molecules.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S100448B","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"a.  Students know atoms combine to form molecules by sharing electrons to form covalent or metallic bonds or by exchanging electrons to form ionic bonds."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1020FA9","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"b.  Students know chemical bonds between atoms in molecules such as H<sub>2</sub>, CH<sub>4</sub>, NH<sub>3</sub>, H<sub>2</sub>CCH<sub>2</sub>, N<sub>2</sub>, Cl<sub>2</sub>, and many large biological molecules are covalent."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100129B","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"c.  Students know salt crystals, such as NaCl, are repeating patterns of positive and negative ions held together by electrostatic attraction."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1020B85","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"d.  Students know the atoms and molecules in liquids move in a random pattern relative to one another because the intermolecular forces are too weak to hold the atoms or molecules in a solid form."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101DCAD","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"e.  Students know how to draw Lewis dot structures."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101985D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"f.* Students know how to predict the shape of simple molecules and their polarity from Lewis dot structures."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10153C2","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"g.* Students know how electronegativity and ionization energy relate to bond formation."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S102532A","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"h.* Students know how to identify solids and liquids held together by van der Waals forces or hydrogen bonding and relate these forces to volatility and boiling/ melting point temperatures."}]}]},{"leaf":false,"text":"Conservation of Matter and Stoichiometry","children":[{"leaf":false,"text":"3.  The conservation of atoms in chemical reactions leads to the principle of conservation of matter and the ability to calculate the mass of products and reactants.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1020663","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"a.  Students know how to describe chemical reactions by writing balanced equations."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10044E6","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"b.  Students know the quantity <i>one mole</i> is set by defining one mole of carbon 12 atoms to have a mass of exactly 12 grams."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100F39B","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"c.  Students know one mole equals 6.02 x 10<sup>23</sup> particles (atoms or molecules)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100A34B","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"d.  Students know how to determine the molar mass of a molecule from its chemical formula and a table of atomic masses and how to convert the mass of a molecular substance to moles, number of particles, or volume of gas at standard temperature and pressure."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100F327","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"e.  Students know how to calculate the masses of reactants and products in a chemical reaction from the mass of one of the reactants or products and the relevant atomic masses."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1014B6C","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"f.* Students know how to calculate percent yield in a chemical reaction."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101C4AB","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"g.* Students know how to identify reactions that involve oxidation and reduction and how to balance oxidation-reduction reactions."}]}]},{"leaf":false,"text":"Gases and Their Properties","children":[{"leaf":false,"text":"4.  The kinetic molecular theory describes the motion of atoms and molecules and explains the properties of gases.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S100D406","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"a.  Students know the random motion of molecules and their collisions with a surface create the observable pressure on that surface."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1007CE6","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"b.  Students know the random motion of molecules explains the diffusion of gases."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101E431","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"c.  Students know how to apply the gas laws to relations between the pressure, temperature, and volume of any amount of an ideal gas or any mixture of ideal gases."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1016C99","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"d.  Students know the values and meanings of standard temperature and pressure (STP)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1016593","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"e.  Students know how to convert between the Celsius and Kelvin temperature scales."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10094B7","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"f.  Students know there is no temperature lower than 0 Kelvin."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1004E65","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"g.* Students know the kinetic theory of gases relates the absolute temperature of a gas to the average kinetic energy of its molecules or atoms."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10149CE","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"h.* Students know how to solve problems by using the ideal gas law in the form PV=nRT nRT."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10071B4","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"i.* Students know how to apply Dalton's law of partial pressures to describe the composition of gases and Graham's law to predict diffusion of gases."}]}]},{"leaf":false,"text":"Acids and Bases","children":[{"leaf":false,"text":"5.  Acids, bases, and salts are three classes of compounds that form ions in water solutions.  As a basis for understanding the concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1019C17","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"a.  Students know the observable properties of acids, bases, and salt solutions."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1016196","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"b.  Students know acids are hydrogen-ion-donating and bases are hydrogen-ion-accepting substances."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101BD32","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"c.  Students know strong acids and bases fully dissociate and weak acids and bases partially dissociate."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1002015","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"d.  Students know how to use the pH scale to characterize acid and base solutions."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1017119","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"e.* Students know the Arrhenius, Brønsted-Lowry, and Lewis acid–base definitions."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101D85B","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"f.* Students know how to calculate pH from the hydrogen-ion concentration."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101CB2D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"g.* Students know buffers stabilize pH in acid–base reactions."}]}]},{"leaf":false,"text":"Solutions","children":[{"leaf":false,"text":"6.  Solutions are homogenous mixtures of two or more substances.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1018F7C","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"a.  Students know the definitions of <i>solute</i> and <i>solvent</i>."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1010640","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"b.  Students know how to describe the dissolving process at the molecular level by using the concept of random molecular motion."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1006B6D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"c.  Students know temperature, pressure, and surface area affect the dissolving process."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1022DB9","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"d.  Students know how to calculate the concentration of a solute in terms of grams per liter, molarity, parts per million, and percent composition."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10078F3","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"e.* Students know the relationship between the molality of a solute in a solution and the solution's depressed freezing point or elevated boiling point."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100B339","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"f.* Students know how molecules in a solution are separated or purified by the methods of chromatography and distillation."}]}]},{"leaf":false,"text":"Chemical Thermodynamics","children":[{"leaf":false,"text":"7.  Energy is exchanged or transformed in all chemical reactions and physical changes of matter.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1024DA0","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"a.  Students know how to describe temperature and heat flow in terms of the motion of molecules (or atoms)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1012810","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"b.  Students know chemical processes can either release (exothermic) or absorb (endothermic) thermal energy."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1000DEC","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"c.  Students know energy is released when a material condenses or freezes and is absorbed when a material evaporates or melts."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101CD52","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"d.  Students know how to solve problems involving heat flow and temperature changes, using known values of specific heat and latent heat of phase change."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101D503","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"e.* Students know how to apply Hess's law to calculate enthalpy change in a reaction."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10040ED","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"f.* Students know how to use the Gibbs free energy equation to determine whether a reaction would be spontaneous."}]}]},{"leaf":false,"text":"Reaction Rates","children":[{"leaf":false,"text":"8.  Chemical reaction rates depend on factors that influence the frequency of collision of reactant molecules.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1001973","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"a.  Students know the rate of reaction is the decrease in concentration of reactants or the increase in concentration of products with time."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1014866","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"b.  Students know how reaction rates depend on such factors as concentration, temperature, and pressure."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100527E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"c.  Students know the role a catalyst plays in increasing the reaction rate."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10107EA","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"d.* Students know the definition and role of activation energy in a chemical reaction."}]}]},{"leaf":false,"text":"Chemical Equilibrium","children":[{"leaf":false,"text":"9.  Chemical equilibrium is a dynamic process at the molecular level.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1004619","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"a.  Students know how to use LeChatelier's principle to predict the effect of changes in concentration, temperature, and pressure."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101A392","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"b.  Students know equilibrium is established when forward and reverse reaction rates are equal."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101811F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"c.* Students know how to write and calculate an equilibrium constant expression for a reaction."}]}]},{"leaf":false,"text":"Organic Chemistry and Biochemistry","children":[{"leaf":false,"text":"10.  The bonding characteristics of carbon allow the formation of many different organic molecules of varied sizes, shapes, and chemical properties and provide the biochemical basis of life.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1000E2A","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"a.  Students know large molecules (polymers), such as proteins, nucleic acids, and starch, are formed by repetitive combinations of simple subunits."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1017EAA","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"b.  Students know the bonding characteristics of carbon that result in the formation of a large variety of structures ranging from simple hydrocarbons to complex polymers and biological molecules."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1020031","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"c.  Students know amino acids are the building blocks of proteins."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1023B77","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"d.* Students know the system for naming the ten simplest linear hydrocarbons and isomers that contain single bonds, simple hydrocarbons with double and triple bonds, and simple molecules that contain a benzene ring."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101904B","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"e.* Students know how to identify the functional groups that form the basis of alcohols, ketones, ethers, amines, esters, aldehydes, and organic acids."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10187BB","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"f.* Students know the R-group structure of amino acids and know how they combine to form the polypeptide backbone structure of proteins."}]}]},{"leaf":false,"text":"Nuclear Processes","children":[{"leaf":false,"text":"11.  Nuclear processes are those in which an atomic  nucleus changes, including radioactive decay of naturally occurring and human-made isotopes, nuclear fission, and nuclear fusion.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10209F3","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"a.  Students know protons and neutrons in the nucleus are held together by nuclear forces that overcome the electromagnetic repulsion between the protons."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101F695","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"b.  Students know the energy release per gram of material is much larger in nuclear fusion or fission reactions than in chemical reactions.  The change in mass (calculated by <i>E</i> = <i>mc²</i>) is small but significant in nuclear reactions."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1008691","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"c.  Students know some naturally occurring isotopes of elements are radioactive, as are isotopes formed in nuclear reactions."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10147BC","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"d.  Students know the three most common forms of radioactive decay (alpha, beta, and gamma) and know how the nucleus changes in each type of decay."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1012210","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"e.  Students know alpha, beta, and gamma radiation produce different amounts and kinds of damage in matter and have different penetrations."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1010199","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"f.* Students know how to calculate the amount of a radioactive substance remaining after an integral number of half-lives have passed."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101A07F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"g.* Students know protons and neutrons have substructures and consist of particles called quarks."}]}]}]},{"leaf":false,"text":"Biology/Life Sciences","children":[{"leaf":false,"text":"Cell Biology","children":[{"leaf":false,"text":"1.  The fundamental life processes of plants and animals depend on a variety of chemical reactions that occur in specialized areas of the organism's cells.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1003005","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"a.  Students know cells are enclosed within semipermeable membranes that regulate their interaction with their surroundings."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100ED9E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"b.  Students know enzymes are proteins that catalyze biochemical reactions without altering the reaction equilibrium and the activities of enzymes depend on the temperature, ionic  conditions, and the pH of the surroundings."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10089FE","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"c.  Students know how prokaryotic cells, eukaryotic cells (including those from plants and animals), and viruses differ in complexity and general structure."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101BA4C","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"d.  Students know the central dogma of molecular biology outlines the flow of information from transcription of ribonucleic acid (RNA) in the nucleus to translation of proteins on ribosomes in the cytoplasm."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S102222D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"e.  Students know the role of the endoplasmic reticulum and Golgi apparatus in the secretion of proteins."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1004B34","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"f.  Students know usable energy is captured from sunlight by chloroplasts and is stored through the synthesis of sugar from carbon dioxide."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101F019","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"g.  Students know the role of the mitochondria in making stored chemical-bond energy available to cells by completing the breakdown of glucose to carbon dioxide."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100E0B4","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"h.  Students know most macromolecules (polysaccharides, nucleic acids, proteins, lipids) in cells and organisms are synthesized from a small collection of simple precursors."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10152D5","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"i.* Students know how chemiosmotic gradients in the mitochondria and chloroplast store energy for ATP production."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1018DE4","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"j* Students know how eukaryotic cells are given shape and internal organization by a cytoskeleton or cell wall or both."}]}]},{"leaf":false,"text":"Genetics","children":[{"leaf":false,"text":"2.  Mutation and sexual reproduction lead to genetic variation in a population.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S101FE40","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"a.  Students know meiosis is an early step in sexual reproduction in which the pairs of chromosomes separate and segregate randomly during cell division to produce gametes containing one chromosome of each type."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1012E2D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"b.  Students know only certain cells in a multicellular organism undergo meiosis."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100403E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"c.  Students know how random chromosome segregation explains the probability that a particular allele will be in a gamete."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1021A26","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"d.  Students know new combinations of alleles may be generated in a zygote through the fusion of male and female gametes (fertilization)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S102617B","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"e.  Students know why approximately half of an individual's DNA sequence comes from each parent."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10187FB","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"f.  Students know the role of chromosomes in determining an individual's sex."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101E9F1","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"g.  Students know how to predict possible combinations of alleles in a zygote from the genetic makeup of the parents."}]},{"leaf":false,"text":"3.  A multicellular organism develops from a single zygote, and its phenotype depends on its genotype, which is established at fertilization.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1014C64","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"a.  Students know how to predict the probable outcome of phenotypes in a genetic cross from the genotypes of the parents and mode of inheritance (autosomal or X-linked, dominant or recessive)."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100D4F7","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"b.  Students know the genetic basis for Mendel's laws of segregation and independent assortment."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100DC6D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"c.* Students know how to predict the probable mode of inheritance from a pedigree diagram showing phenotypes."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1008502","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"d.* Students know how to use data on frequency of recombination at meiosis to estimate genetic distances between loci and to interpret genetic maps of chromosomes."}]},{"leaf":false,"text":"4.  Genes are a set of instructions encoded in the DNA sequence of each organism that specify the sequence of amino acids in proteins characteristic of that organism.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10246CB","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"a.  Students know the general pathway by which ribosomes synthesize proteins, using tRNAs to translate genetic information in mRNA."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10099B4","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"b.  Students know how to apply the genetic coding rules to predict the sequence of amino acids from a sequence of codons in RNA."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100A4B9","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"c.  Students know how mutations in the DNA sequence of a gene may or may not affect the expression of the gene or the sequence of amino acids in an encoded protein."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1025A54","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"d.  Students know specialization of cells in multicellular organisms is usually due to different patterns of gene expression rather than to differences of the genes themselves."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1019A4C","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"e.  Students know proteins can differ from one another in the number and sequence of amino acids."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100DE22","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"f.* Students know why proteins having different amino acid sequences typically have different shapes and chemical properties."}]},{"leaf":false,"text":"5.  The genetic composition of cells can be altered by incorporation of exogenous DNA into the cells.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S101B791","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"a.  Students know the general structures and functions of DNA, RNA, and protein."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1024C29","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"b.  Students know how to apply base-pairing rules to explain precise copying of DNA during semiconservative replication and transcription of information from DNA into mRNA."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10166CF","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"c.  Students know how genetic engineering (biotechnology) is used to produce novel biomedical and agricultural products."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10056CA","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"d.* Students know how basic DNA technology (restriction digestion by endonucleases, gel electrophoresis, ligation, and transformation) is used to construct recombinant DNA molecules."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1010B4D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"e.* Students know how exogenous DNA can be inserted into bacterial cells to alter their genetic makeup and support expression of new protein products."}]}]},{"leaf":false,"text":"Ecology","children":[{"leaf":false,"text":"6.  Stability in an ecosystem is a balance between competing effects.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1022B18","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"a.  Students know biodiversity is the sum total of different kinds of organisms and is affected by alterations of habitats."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1006B15","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"b.  Students know how to analyze changes in an ecosystem resulting from changes in climate, human activity, introduction of nonnative species, or changes in population."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1011D6D","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"c.  Students know how fluctuations in population size in an ecosystem are determined by the relative rates of birth, immigration, emigration, and death."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1001D7E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"d.  Students know how water, carbon, and nitrogen cycle between abiotic resources and organic matter in the ecosystem and how oxygen cycles through photosynthesis and respiration."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10179DD","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"e.  Students know a vital part of an ecosystem is the stability of its producers and decomposers."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100FB02","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"f.  Students know at each link in a food web some energy is stored in newly made structures but much energy is dissipated into the environment as heat.  This dissipation may be represented in an energy pyramid."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1021B4E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"g.* Students know how to distinguish between the accommodation of an individual organism to its environment and the gradual adaptation of a lineage of organisms through genetic change."}]}]},{"leaf":false,"text":"Evolution","children":[{"leaf":false,"text":"7.  The frequency of an allele in a gene pool of a population depends on many factors and may be stable or unstable over time.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1025C9E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"a.  Students know why natural selection acts on the phenotype rather than the genotype of an organism."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1020F0B","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"b.  Students know why alleles that are lethal in a homozygous individual may be carried in a heterozygote and thus maintained in a gene pool."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1009776","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"c.  Students know new mutations are constantly being generated in a gene pool."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10181B1","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"d.  Students know variation within a species increases the likelihood that at least some members of a species will survive under changed environmental conditions."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100CE16","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"e.* Students know the conditions for Hardy-Weinberg equilibrium in a population and why these conditions are not likely to appear in nature."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1020EE8","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"f.* Students know how to solve the Hardy-Weinberg equation to predict the frequency of genotypes in a population, given the frequency of phenotypes."}]},{"leaf":false,"text":"8.  Evolution is the result of genetic changes that occur in constantly changing environments.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S1009B32","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"a.  Students know how natural selection determines the differential survival of groups of organisms."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1016300","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"b.  Students know a great diversity of species increases the chance that at least some organisms survive major changes in the environment."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1009A7E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"c.  Students know the effects of genetic drift on the diversity of organisms in a population."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1018AD3","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"d.  Students know reproductive or geographic isolation affects speciation."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1011AFD","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"e.  Students know how to analyze fossil evidence with regard to biological diversity, episodic speciation, and mass extinction."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100CF84","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"f.* Students know how to use comparative embryology, DNA or protein sequence comparisons, and other independent sources of data to create a branching diagram (cladogram) that shows probable evolutionary relationships."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10149A1","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"g.* Students know how several independent molecular clocks, calibrated against each other and combined with evidence from the fossil record, can help to estimate how long ago various groups of organisms diverged evolutionarily from one another."}]}]},{"leaf":false,"text":"Physiology","children":[{"leaf":false,"text":"9.  As a result of the coordinated structures and functions of organ systems, the internal environment of the human body remains relatively stable (homeostatic) despite changes in the outside environment.  As a basis for understanding this concept:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10021EC","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"a.  Students know how the complementary activity of major body systems provides cells with oxygen and nutrients and removes toxic waste products such as carbon dioxide."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S10016E7","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"b.  Students know how the nervous system mediates communication between different parts of the body and the body's interactions with the environment."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100A984","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"c.  Students know how feedback loops in the nervous and endocrine systems regulate conditions in the body."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1001D8E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"d.  Students know the functions of the nervous system and the role of neurons in transmitting electrochemical impulses."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101DF9E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"e.  Students know the roles of sensory neurons, interneurons, and motor neurons in sensation, thought, and response."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101A8CB","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"f.* Students know the individual functions and sites of secretion of digestive enzymes (amylases, proteases, nucleases, lipases), stomach acid, and bile salts."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100D025","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"g.* Students know the homeostatic role of the kidneys in the removal of nitrogenous wastes and the role of the liver in blood detoxification and glucose balance."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1005953","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"h.* Students know the cellular and molecular basis of muscle contraction, including the roles of actin, myosin, Ca+2, and ATP."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S100CBFE","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"i.* Students know how hormones (including digestive, reproductive, osmoregulatory) provide internal feedback mechanisms for homeostasis at the cellular level and in whole organisms."}]},{"leaf":false,"text":"10.  Organisms have a variety of mechanisms to combat disease.  As a basis for understanding the human immune response:","children":[{"leaf":"true","id":"http://asn.jesandco.org/resources/S10012BF","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"a.  Students know the role of the skin in providing nonspecific defenses against infection."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101DC4F","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"b.  Students know the role of antibodies in the body's response to infection."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1026A6E","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"c.  Students know how vaccination protects an individual from infectious diseases."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S1016FD6","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"d.  Students know there are important differences between bacteria and viruses with respect to their requirements for growth and replication, the body's primary defenses against bacterial and viral infections, and effective treatments of these infections."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101E563","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"e.  Students know why an individual with a compromised immune system (for example, a person with AIDS) may be unable to fight off and survive infections by microorganisms that are usually benign."},{"leaf":"true","id":"http://asn.jesandco.org/resources/S101D487","dcterms_educationLevel":[{"prefLabel":"9"},{"prefLabel":"10"},{"prefLabel":"11"},{"prefLabel":"12"}],"text":"f.* Students know the roles of phagocytes, B-lymphocytes, and T-lymphocytes in the immune system."}]}]}]}]